
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	Объект.Модель = АутсорсККТСервер.МодельФНПоЗН(Объект.Код);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не СтрДлина(СтрЗаменить(Объект.Код, Символы.НПП, "")) = 16 Тогда
		Сообщить("Ошибка! Заводской номер должен быть длиной в 16 символов");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Попытка
			Объект.Код = Формат(Число(Объект.Наименование),"ЧГ=");
		Исключение
		КонецПопытки;
		Объект.Модель = АутсорсККТСервер.МодельФНПоЗН(Объект.Код);
	КонецЕсли;
КонецПроцедуры
