Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Запись
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания КАК ДоговорОбслуживания
		|ГДЕ
		|	ДоговорОбслуживания.Период МЕЖДУ &От И &До
		|	И ДоговорОбслуживания.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("От", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("До", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	//Записи = 0;
	//
	//Пока Выборка.Следующий() Цикл
	//	Записи = Записи + 1;
	//КонецЦикла;
	
	Если Выборка.Следующий() Тогда
		Движения.ДоговораОбслуживания.Записывать = Ложь;
		Отказ = Истина;
		Сообщить("Договор с контрагентом " + Контрагент + "в этом месяце уже был заключен");
		Возврат;
	Иначе	
	
	// регистр ДоговораОбслуживания
	Движения.ДоговораОбслуживания.Записывать = Истина;
	Движение = Движения.ДоговораОбслуживания.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	//Движение.Дата = Дата;
	Движение.АбонентскаяПлата = АбонентскаяПлата;
	Движение.Тариф = Тариф;
	Движение.ТарифСверхурочный = ТарифСверхурочный;

	Движение.СрокДействия = СрокДействия;
	Движение.ЧерныйСписок = ЧерныйСписок;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Фиксация в истории изменений
	АутсорсФункцииДокументовСервер.УстановитьИзменениеДокумента(ЭтотОбъект.Ссылка);
КонецПроцедуры
