
#Область ПрограммныйИнтерфейс

// Задает начальный порядок разделов в панели текущих дел.
//
// см. ТекущиеДелаПереопределяемый.ПриОпределенииПорядкаРазделовКомандногоИнтерфейса()
//
Процедура ПриОпределенииПорядкаРазделовКомандногоИнтерфейса(Разделы) Экспорт
	
	//++ Локализация
	
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователей.ПриОпределенииПорядкаРазделовКомандногоИнтерфейса(Разделы);
	// Конец ИнтернетПоддержкаПользователей
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти
