///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм расчета себестоимости
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОсновнойИнтерфейсМеханизма

// Запуск расчета себестоимости.
//
// Параметры:
//	ПараметрыЗапуска - Структура с ключами
//		Дата - Дата - период расчета себестоимости
//		МассивОрганизаций - СправочникСсылка.Организации - рассчитывать только по указанной организации;
//			также будут пересчитана себестоимость по организациям, связанным по схеме Интеркампани с указанной
//					- Массив - массив организаций, по которым надо рассчитать себестоимость, другие организации не рассчитываются
//		ПредварительныйРасчет - Булево - выполнять фактический или предварительный расчет;
//			предварительный расчет может выполняться
//				= регламентным заданием
//				= как подготовительный этап к распределению расходов на продукцию
//		РегламентноеЗадание - Булево - если Истина, значит вызвана из регламентного задания расчета предварительной себестоимости
//		МестоВызоваРасчета - Строка - необязательный, полное имя процедуры, вызвавшей расчет
//	ПараметрыРасчета - Структура - параметры расчета, сформированные в вызывающем механизме.
//	ПараметрыОтладки - Структура - предназначена для переопределения одноименных свойств структуры ПараметрыРасчета.
//		Подробнее см. пояснения в коде ИнициализироватьПараметрыРасчетаСебестоимости() к параметру ПараметрыОтладки.
//
Процедура РассчитатьВсе(ПараметрыЗапуска, ПараметрыРасчета = Неопределено, ПараметрыОтладки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыОтладки = Неопределено Тогда
		ПараметрыОтладки = Новый Структура; // для упрощения дальнейших обращений к этому свойству
	КонецЕсли;
	
	Если НЕ ПараметрыЗапуска.Свойство("ТолькоРасчетСебестоимости") Тогда
		// Запущено не из механизма расчета партий
		ПараметрыЗапуска.Вставить("ТолькоРасчетСебестоимости", (ПараметрыРасчета = Неопределено));
	КонецЕсли;
	
	// Проверим, закончено ли обновление ИБ
	Если ПараметрыЗапуска.ТолькоРасчетСебестоимости Тогда // при запуске из партионного учета версии 2.2 проверка уже выполнена там
		УниверсальныеМеханизмыПартийИСебестоимости.ПроверитьБлокировкуДанныхПриОбновленииИБ(Истина, , ПараметрыОтладки);
	КонецЕсли;
	
	// Инициализируем параметры расчета
	ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	НомерГруппы = 0;
	
	// Выполним расчет себестоимости по каждой из групп связанных организаций
	Пока НомерГруппы < ПараметрыРасчета.ГруппыОрганизацийПоИнтеркампани.Количество() Цикл
		
		ПараметрыЗапускаРасчетаПоГруппеОрганизаций = Новый Структура(
			"ГруппаОрганизаций, МетодОценки",
			ПараметрыРасчета.ГруппыОрганизацийПоИнтеркампани[НомерГруппы],
			ПараметрыРасчета.МетодыОценкиПоГруппамОрганизаций[НомерГруппы]);
		
		РассчитатьСебестоимостьПоГруппеОрганизаций(ПараметрыЗапускаРасчетаПоГруппеОрганизаций, ПараметрыРасчета, ПараметрыОтладки);
		
		НомерГруппы = НомерГруппы + 1;
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТПромежуточнаяСебестоимостьТоваров");
	
	// Записываем движения (в случае, если расчет себестоимости запущен самостоятельно, а не как этап расчета партий)
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаписатьСформированныеДвижения(
		ПараметрыРасчета,
		ПараметрыОтладки.ПротоколыРасчета);
	
КонецПроцедуры

// Обертка для запуска расчета - выполняет расчет в Попытке - Исключении
// Параметры аналогичны процедуре РассчитатьВсе()
//
// Возвращаемое значение - Булево - признак успешного выполнения расчета.
//
Функция РассчитатьВсеВПопыткеИсключении(ПараметрыЗапуска, ПараметрыРасчета = Неопределено, ПараметрыОтладки = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Попытка
		РассчитатьВсе(ПараметрыЗапуска,	ПараметрыРасчета, ПараметрыОтладки);
	Исключение
		
		Если ПараметрыРасчета = Неопределено Тогда
			ПараметрыРасчета = УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьОсновныеПараметрыРасчета(
				ПараметрыЗапуска.Дата,
				ПараметрыЗапуска.МассивОрганизаций,
				Ложь,
				Ложь);
		КонецЕсли;
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		УниверсальныеМеханизмыПартийИСебестоимости.ОбработатьИсключениеВызоваРассчитатьВсе(
			ПараметрыРасчета,
			ИнформацияОбОшибке,
			Отказ);
		
	КонецПопытки;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыВызываемыеИзРегламентныхЗаданий

// Обновления стоимости товаров регламентным заданием.
//
Процедура ПредварительныйРасчетСебестоимости() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РасчетСебестоимости); // проверка возможности запуска задания
	
	Дата = ТекущаяДатаСеанса();
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецМесяца(Дата);
	
	Если УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоПериода) Тогда	
		ПартионныйУчет22.ПредварительныйРасчетСебестоимости(НачалоПериода, КонецПериода);
	Иначе
		Если УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетНеИспользуется(НачалоПериода) Тогда
			ПартионныйУчет.ТестРассчитать("РассчитатьПартииПроизводства", НачалоПериода, КонецПериода);
			ПартионныйУчет.ТестРассчитать("РассчитатьСебестоимостьПроизводства", НачалоПериода, КонецПериода);
		ИначеЕсли УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии21(НачалоПериода) Тогда
			ПартионныйУчет.ТестРассчитать("РассчитатьПартииТоваров", НачалоПериода, КонецПериода);
			ПартионныйУчет.ТестРассчитать("РассчитатьПартииПроизводства", НачалоПериода, КонецПериода);
			ПартионныйУчет.ТестРассчитать("РассчитатьСебестоимостьПроизводства", НачалоПериода, КонецПериода);
		КонецЕсли;
		
		ПараметрыЗапускаРасчетаСебестоимости = Новый Структура;
		ПараметрыЗапускаРасчетаСебестоимости.Вставить("Дата", 					Дата);
		ПараметрыЗапускаРасчетаСебестоимости.Вставить("ПредварительныйРасчет", 	Истина);
		ПараметрыЗапускаРасчетаСебестоимости.Вставить("МассивОрганизаций", 		Неопределено);
		ПараметрыЗапускаРасчетаСебестоимости.Вставить("РегламентноеЗадание", 	Истина);
		ПараметрыЗапускаРасчетаСебестоимости.Вставить("МестоВызоваРасчета", 	"РасчетСебестоимости.ПредварительныйРасчетСебестоимости");
		
		СебестоимостьРассчитана = РассчитатьВсеВПопыткеИсключении(ПараметрыЗапускаРасчетаСебестоимости);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

// Перед началом расчета заполняет все необходимые параметры и инициализирует все структуры данных, используемые алгоритма расчета.
// Если расчет себестоимости вызывается не самостоятельно, а как этап расчета партий,
// то параметр ПараметрыРасчета уже будет инициализирован общими свойствами механизмов расчета.
//
// Внимание: если какая-то сущность используется более чем в одном этапе расчета, то ее стоит занести в ПараметрыРасчета.
//
Процедура ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьОбщиеПараметрыРасчетаСебестоимости");
	
	// Создадим контейнер всех параметров, используемых механизмом расчета партий
	ПараметрыИнициализации = Новый Структура;
	ПараметрыИнициализации.Вставить("Дата",
		?(ПараметрыЗапуска.ТолькоРасчетСебестоимости И ПараметрыЗапуска.ПредварительныйРасчет,
			КонецДня(ПараметрыЗапуска.Дата), КонецМесяца(ПараметрыЗапуска.Дата)));
	ПараметрыИнициализации.Вставить("МассивОрганизаций",
		?(ТипЗнч(ПараметрыЗапуска.МассивОрганизаций) <> Тип("Массив") И ЗначениеЗаполнено(ПараметрыЗапуска.МассивОрганизаций),
			УниверсальныеМеханизмыПартийИСебестоимости.СвязиОрганизацийПоСхемеИнтеркампани(НачалоМесяца(ПараметрыЗапуска.Дата), ПараметрыЗапуска.МассивОрганизаций),
			ПараметрыЗапуска.МассивОрганизаций));
	ПараметрыИнициализации.Вставить("ЗапущенРасчетПартий", Ложь);
	ПараметрыИнициализации.Вставить("ТолькоПредварительныйРасчетСебестоимости",
		?(ПараметрыЗапуска.ТолькоРасчетСебестоимости, ПараметрыЗапуска.ПредварительныйРасчет, Ложь));
	ПараметрыИнициализации.Вставить("ЗапущеноРегламентнымЗаданием", ПараметрыЗапуска.РегламентноеЗадание);
	
	Если ПараметрыЗапуска.Свойство("ИзмененоДокументов") Тогда
		// Штатный вызов из механизма партионного учета версии 2.1.
		ПараметрыИнициализации.Вставить("ИзмененоДокументов", ПараметрыЗапуска.ИзмененоДокументов);
	КонецЕсли;
	Если ПараметрыЗапуска.Свойство("ОписаниеЗамера") Тогда
		// Штатный вызов из механизма партионного учета версии 2.1.
		ПараметрыИнициализации.Вставить("ОписаниеЗамера", ПараметрыЗапуска.ОписаниеЗамера);
	КонецЕсли;
	
	Если ПараметрыЗапуска.Свойство("АвтоматическоеТестирование") И ПараметрыЗапуска.АвтоматическоеТестирование Тогда
		ПараметрыИнициализации.Вставить("АвтоматическоеТестирование", Истина); // вызывается при тестировании
	Иначе
		ПараметрыИнициализации.Вставить("АвтоматическоеТестирование", Ложь);
	КонецЕсли;
	
	Если ПараметрыЗапуска.ТолькоРасчетСебестоимости И ПараметрыЗапуска.Свойство("МестоВызоваРасчета") Тогда
		ПараметрыИнициализации.Вставить("МестоВызоваРасчета", ПараметрыЗапуска.МестоВызоваРасчета);
	КонецЕсли;
	
	УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьОбщиеПараметрыРасчета(
		ПараметрыИнициализации, ПараметрыРасчета, ПараметрыОтладки);
		
	УниверсальныеМеханизмыПартийИСебестоимости.СкопироватьВременнуюТаблицу(
		ПараметрыРасчета,
		"ВТСтоимостьПартийТоваров",
		"ВТСтоимостьПартийТоваровПредыдущая");
		
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
		
		УниверсальныеМеханизмыПартийИСебестоимости.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Истина);
		
		Если УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТСтоимостьПартийТоваров") > 0 Тогда
			
			// Предварительная стоимость была нужна для распределения доп. расходов в механизме расчета партий.
			// Теперь ее надо очистить - вместо нее будет сформирована фактическая стоимость.
			УниверсальныеМеханизмыПартийИСебестоимости.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТСтоимостьПартийТоваров");
			УниверсальныеМеханизмыПартийИСебестоимости.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТКэшСтоимостьТоваров");
			
			ПротоколРасчетаПартийИСебестоимости.ОчисткаСформированныхДвижений(
				ПараметрыРасчета,
				Метаданные.РегистрыСведений.СтоимостьТоваров.Имя);
			
		КонецЕсли;
		
	Иначе
		
		НомерЗаданияДоРасчета = РегистрыСведений.ЗаданияКРасчетуСебестоимости.ПолучитьНомерЗадания();
		ПараметрыРасчета.Вставить("НомерЗаданияДоРасчета", НомерЗаданияДоРасчета - 1);
		
		// Запомним протокол расчета и вернем его в место вызова расчета
		ПараметрыОтладки.Вставить("ПротоколыРасчета", Новый Массив);
		
		// Инициализируем кэши регистров, обслуживаемых механизмом партионного учета
		// Непосредственное обновление кэшей будет выполнено в ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций
		Для Каждого КлючИЗначение Из ИспользуемыеКэшиРегистровПартионногоУчета() Цикл
			
			УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьДанныеРегистра(ПараметрыРасчета, КлючИЗначение.Ключ);
			
			ОписаниеРегистра = ПараметрыРасчета.Движения[КлючИЗначение.Ключ.Имя];
			ОписаниеРегистра.ИспользоватьВТКэш = Ложь; // расчетные движения брать из данных ИБ
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Общие параметры расчета себестоимости
	ПараметрыРасчета.Вставить("ПредварительныйРасчет", ПараметрыЗапуска.ПредварительныйРасчет);
	ПараметрыРасчета.Вставить("УчитыватьКорректировкиСтоимости",
		НЕ ПараметрыЗапуска.ПредварительныйРасчет
		ИЛИ НЕ ПараметрыЗапуска.Свойство("УчитыватьКорректировкиСтоимости")
		ИЛИ ПараметрыЗапуска.УчитыватьКорректировкиСтоимости);
	
КонецПроцедуры

Процедура ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций");
	
	ПротоколРасчетаПартийИСебестоимости.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
		ПараметрыРасчета,
		ПараметрыЗапуска.ГруппаОрганизаций.Количество());
	
	// Заменим основной отбор по организациям на текущую рассчитываемую группу.
	// При окончании расчета себестоимости основной отбор будет восстановлен из ПараметрыРасчета.КопияМассивОрганизаций
	ПараметрыРасчета.Вставить("МассивОрганизаций", ПараметрыЗапуска.ГруппаОрганизаций);
	ПараметрыРасчета.Вставить("МетодОценки", 	   ПараметрыЗапуска.МетодОценки); // общий метод оценки для этой группы организаций
	
	// Обновим временные таблицы с отборами по организациям.
	УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьВременныеТаблицыДляОтборов(ПараметрыРасчета);
	
	// Обновим все расчетные кэши остатков и оборотов - в них должны быть только записи по рассчитываемой группе организаций
	// Если расчет вызван регламентной операцией, то считаем стоимость по средней (без учета партий)
	// Для этого в расчетном кэше оборотов и остатков будут "очищены" поля, относящиеся к партиям
	// Если расчет себестоимости вызван из механизма партионного учета, то по окончании расчета себестоимости
	// расчетные кэши будут восстановлены автоматически.
	УниверсальныеМеханизмыПартийИСебестоимости.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
	
	// Свойство, определяющее выполняемую ветвь алгоритма расчета
	ПараметрыРасчета.Вставить("ФИФОСкользящаяОценкаВерсии21",
		НЕ ПараметрыРасчета.ПредварительныйРасчет И НЕ ПараметрыРасчета.ПартионныйУчетВерсии22
	 	И ПараметрыЗапуска.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка);
	
	ПараметрыРасчета.Вставить("КоличествоУзлов",     0);
	ПараметрыРасчета.Вставить("КоличествоУзловРегл", 0);
	
	// Добавим информацию о текущей итерации расчета себестоимости в протокол расчета
	СтрокаПротокола = НСтр("ru='Вид расчета себестоимости'") + ": "
		+ ?(ПараметрыРасчета.ПредварительныйРасчет, НСтр("ru='Предварительный'"), НСтр("ru='Фактический'"));
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		// Метод оценки не влияет на алгоритм расчета
		ПредставлениеМетодаОценки = НСтр("ru='Неважен'");
	ИначеЕсли ПараметрыРасчета.ПартионныйУчетВерсии22 И НЕ ЗначениеЗаполнено(ПараметрыРасчета.МетодОценки) Тогда
		// См. УниверсальныеМеханизмыПартийИСебестоимости.ОпределитьМетодОценкиСтоимостиДляГруппыОрганизаций()
		ПредставлениеМетодаОценки = НСтр("ru='Не ""ФИФО (взвешенная оценка)""'");
	Иначе
		ПредставлениеМетодаОценки = ПараметрыРасчета.МетодОценки;
	КонецЕсли;
	
	СтрокаПротокола = НСтр("ru='Метод оценки стоимости'") + ": "
		+ ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ПредставлениеМетодаОценки);
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	СтрокаПротокола = НСтр("ru='Организации'") + ": "
		+ УниверсальныеМеханизмыПартийИСебестоимости.ПредставлениеОрганизаций(ПараметрыРасчета.МассивОрганизаций, ", ");
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	УниверсальныеМеханизмыПартийИСебестоимости.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТПромежуточнаяСебестоимостьТоваров");
	
КонецПроцедуры

#КонецОбласти

#Область ЭтапыРасчета

// Этап 0 - начало расчета
Процедура РассчитатьСебестоимостьПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки)
	
	ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	// Этап 1.1
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		УниверсальныеМеханизмыПартийИСебестоимости.ПроверитьКорректностьИсходныхДанныхДоРасчета(ПараметрыРасчета);
	КонецЕсли;
	
	Если ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		
		// Этап 2.1
		// Формирует движения по регистрам:
		// - СебестоимостьТоваров
		// - ПрочиеРасходы
		// - ПрочиеДоходы
		// - ДвиженияНоменклатураДоходыРасходы
		// - ДвиженияНоменклатураНоменклатура
		// - ПрочиеАктивыПассивы
		СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая(ПараметрыРасчета);
		
		// Этап 2.2
		// Формирует движения по регистрам:
		// - ВыручкаИСебестоимостьПродаж
		// - Закупки
		СкорректироватьСтоимостьПродажПоФИФОСкользящая(ПараметрыРасчета);
		
		
		// Этап 2.5
		// Формирует движения по регистрам:
		// - СтоимостьТоваров
		ЗарегистрироватьСтоимостьФИФО(ПараметрыРасчета);
		
	Иначе
		
		// Этап 3.0
		// Формирует движения по регистрам:
		// - ПрочиеРасходы
		ПодготовкаДанныхДляПрочихРасходов(ПараметрыРасчета);
		
		// Этап 3.1
		// Формирует движения по регистрам:
		// - СебестоимостьТоваров
		// - ПрочиеРасходы
		ВключитьИсключитьНДСВСтоимость(ПараметрыРасчета);
		
		// Этап 3.1.2
		// Формирует движения по регистрам:
		// - СебестоимостьТоваров
		// - ПрочиеРасходы
		ВключитьИсключитьНДСВСтоимость24(ПараметрыРасчета);
		
		// Этап 3.2
		// Формирует временные таблицы:
		// - ВТДопРасходов (для фактического расчета она пустая)
		РаспределитьРасходыНаСебестоимость(ПараметрыРасчета);

		// Этап 3.3
		// Формирует временные таблицы:
		// - ВТВозвраты (для фактического расчета она пустая)
		// - СторноОтчетыКомиссионера
		// Формирует движения по регистрам (если выполняется фактический расчет):
		// - СебестоимостьТоваров
		// - ВыручкаИСебестоимостьПродаж
		// - ПрочиеРасходы
		// - ПрочиеДоходы
		// - ДвиженияНоменклатураДоходыРасходы
		// - ДвиженияНоменклатураНоменклатура
		СкорректироватьСтоимостьВозвратовПрошлыхПериодов(ПараметрыРасчета);

		
		// Этап 3.5
		// Формирует временные таблицы:
		// - ВтПередачиТоваров (для фактического расчета она пустая)
		СформироватьТаблицуПередачМеждуОрганизациями(ПараметрыРасчета);
		
		// Этап 3.6
		// Подготовка узлов корректировки для расчета управленческих стоимостей:
		//	- Стоимость;
		//	- СтоимостьБезНДС.
		//
		// Формирует временные таблицы:
		// - ВтУзлыКорректировки
		СформироватьУзлыКорректировкиСписанияСтоимости(ПараметрыРасчета);
		
		Если ПараметрыРасчета.КоличествоУзлов <> 0 Тогда
			
			// Этап 3.7
			// Формирует временные таблицы:
			// - ВтТаблицаРешений
			// - ВтПеремещенияСписания
			РассчитатьСтоимость(ПараметрыРасчета, Ложь);
			
			// Этап 3.8
			// Дополняет временные таблицы:
			// - ВТСтоимостьПартийТоваров
			// Формирует движения по регистрам:
			// - СтоимостьТоваров
			ЗарегистрироватьСтоимость(ПараметрыРасчета, Ложь);
			
		КонецЕсли;

		
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
			"ВтУзлыКорректировки, ВтПередачиТоваров, РаботыДляДавальца,
			|ВтТаблицаРешений, ВтПеремещенияСписания, РезервыПоУзлам");
		
		// Этап 3.10
		// Формирует временные таблицы:
		// - ВтУзлыКорректировки
		СформироватьУзлыКорректировкиСписанияСтоимостиРегл(ПараметрыРасчета);
		
		Если ПараметрыРасчета.КоличествоУзловРегл <> 0 Тогда
			
			// Этап 3.11
			// Формирует временные таблицы:
			// - ВтТаблицаРешений
			// - ВтПеремещенияСписания
			РассчитатьСтоимость(ПараметрыРасчета, Истина);
			
			// Этап 3.12
			// Дополняет временные таблицы:
			// - ВТСтоимостьПартийТоваров
			// Формирует движения по регистрам:
			// - СтоимостьТоваров
			ЗарегистрироватьСтоимость(ПараметрыРасчета, Истина);

		КонецЕсли;
		
		
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
			"ВтУзлыКорректировки, ВТВозвраты, ВТДопРасходов, ЕстьВозвратныеОтходы,
			|РезервыПоУзлам, РаботыДляДавальца, ВтТаблицаРешений, ВтПеремещенияСписания");
			
		Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
			
			// Этап 3.14
			// Формирует движения по регистрам:
			// - СебестоимостьТоваров
			// - ПрочиеРасходы
			// - ПрочиеДоходы
			// - ДвиженияНоменклатураДоходыРасходы
			// - ДвиженияНоменклатураНоменклатура
			// - ПрочиеАктивыПассивы
			СкорректироватьСтоимостьСписанияЗапасов(ПараметрыРасчета);
			
			
			// Этап 3.17
			// Формирует движения по регистрам:
			// - ВыручкаИСебестоимостьПродаж
			// - Закупки
			СкорректироватьСтоимостьПродаж(ПараметрыРасчета);
			
			// Этап 3.18
			// Формирует движения по регистрам:
			// - ВыручкаИСебестоимостьПродаж
			// - ПрочиеРасходы
			// - ДвиженияНоменклатураДоходыРасходы
			ВключитьИсключитьНДСВСтоимостьПродаж(ПараметрыРасчета);
			
			// Этап 3.18.2
			// Формирует движения по регистрам:
			// - ВыручкаИСебестоимостьПродаж
			// - ПрочиеРасходы
			// - ДвиженияНоменклатураДоходыРасходы
			ВключитьИсключитьНДСВСтоимостьПродаж24(ПараметрыРасчета);
			
			Если ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьРегл > 0
			 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьУпр > 0
			 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыРегл > 0
			 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыУпр > 0 Тогда
				// Этап 3.19
				// Формирует движения по регистрам:
				// - СебестоимостьТоваров
				// - ПрочиеРасходы
				// - ПрочиеРасходыНезавершенногоПроизводства
				// - ДвиженияНоменклатураДоходыРасходы
				// - ДвиженияНоменклатураНоменклатура
				СписатьОшибкиОкругленияРасчетаСебестоимости(ПараметрыРасчета);
				
			КонецЕсли;
			
		КонецЕсли;
		
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "СторноОтчетыКомиссионера, СтоимостьВНЗП");
		
	КонецЕсли;
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
		
	Если ПараметрыРасчета.ФО.ФормироватьФинансовыйРезультат Тогда
		// Этап 4.1
		// Формирует движения по регистрам:
		// - ФинансовыеРезультаты
		РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета);
	КонецЕсли;
	
	// Этап 4.3
	// Формирует движения по регистрам:
	// - ПрочиеАктивыПассивы
	ОтразитьПрибылиИУбытки(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ФО.ФормироватьУправленческийБаланс Тогда
		// Этап 4.4
		// Формирует движения управленческого баланса
		ОтразитьВУправленческомБалансе(ПараметрыРасчета);
	КонецЕсли;
	
	// Этап 4.5
	// Формирует движения по регистрам;
	// - ПрочиеРасходы
	РаспределитьРасходыБудущихПериодов(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 2.1
Процедура СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.Количество < 0 ТОГДА 2
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация =
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов) ТОГДА 2
	|			ИНАЧЕ 3 КОНЕЦ)
	|		ИНАЧЕ 2 КОНЕЦ КАК Порядок,
	|	УчетСебестоимости.Период						КАК Период,
	|	УчетСебестоимости.Регистратор					КАК Регистратор,
	|	УчетСебестоимости.Организация					КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов					КАК ВидЗапасов,
	|	ВЫБОР КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ КАК ТипЗапасов,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу))
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой))
	|	 И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаУчетаПродукции,
	|	УчетСебестоимости.ПериодПродажи					КАК ПериодПродажи,
	|
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   						КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета					КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам		КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента					КАК ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация			КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры	КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета				КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов					КАК КорВидЗапасов,
	|	КорАналитикаНоменклатуры.МестоХранения			КАК КорСклад,
	|	УчетСебестоимости.КорОрганизация				КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение					КАК Подразделение,
	|	УчетСебестоимости.АналитикаРасходов				КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания		КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.АналитикаАктивовПассивов		КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.СтатьяАктивовПассивов			КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.СтатьяДоходов					КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов				КАК АналитикаДоходов,
	|	УчетСебестоимости.Регистратор					КАК ДокументДвижения,
	|	УчетСебестоимости.ИдентификаторСтроки			КАК ИдентификаторСтроки,
	|	УчетСебестоимости.ГруппаПродукции				КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.ВидЗапасов
	|	ИНАЧЕ
	|		Аналитика.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.КорВидЗапасов
	|	ИНАЧЕ
	|		КорАналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ КАК КорИсточникГФУНоменклатуры,
	|	Аналитика.МестоХранения КАК Склад,
	|
	|	ВЫБОР КОГДА КорАналитикаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ КАК КорТипЗапасов,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийРеализации) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК Продажа,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|	ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаМеждуОрганизациями,
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах И УчетСебестоимости.Количество < 0
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратОтКлиента,
	|
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Количество < 0 ТОГДА
	|		0 - УчетСебестоимости.Количество
	|	ИНАЧЕ
	|		УчетСебестоимости.Количество
	|	КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация
	|			= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов)
	|		ТОГДА
	|			- УчетСебестоимости.Количество
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			И УчетСебестоимости.Количество < 0
	|		ТОГДА
	|			- УчетСебестоимости.Количество
	|		ИНАЧЕ
	|			УчетСебестоимости.Количество
	|		КОНЕЦ) КАК ИсходноеКоличество,
	|	СУММА(УчетСебестоимости.КорСтоимость) КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.Стоимость) КАК ИсходнаяСтоимость,
	|	СУММА(УчетСебестоимости.СтоимостьРегл) КАК ИсходнаяСтоимостьРегл,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая) КАК ИсходнаяСтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл) КАК ИсходнаяСтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС) КАК ИсходнаяСтоимостьБезНДС
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|	ПО
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|	ПО
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Аналитика.Назначение
	|	
	|ГДЕ
	|	(НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров)
	|	)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.Количество < 0 ТОГДА 2
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация =
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов) ТОГДА 2
	|			ИНАЧЕ 3 КОНЕЦ)
	|		ИНАЧЕ 2 КОНЕЦ,
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу))
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой))
	|	 И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.ВидЗапасов,
	|	ВЫБОР КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.Регистратор,
	|	ВЫБОР КОГДА КорАналитикаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийРеализации) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.ВидЗапасов
	|	ИНАЧЕ
	|		Аналитика.Номенклатура
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.КорВидЗапасов
	|	ИНАЧЕ
	|		КорАналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ,
	|	Аналитика.МестоХранения,
	|	КорАналитикаНоменклатуры.МестоХранения,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах И УчетСебестоимости.Количество < 0
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.ТипЗапасов КАК ТипЗапасов,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ПериодПродажи,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорСклад,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписания,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовРегл,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяДоходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|
	|	НЕОПРЕДЕЛЕНО КАК КорТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Продажа,
	|	НЕОПРЕДЕЛЕНО КАК ЭтоПередачаМеждуОрганизациями,
	|	ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратОтКлиента,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.Стоимость КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА Партии.Стоимость
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	СУММА(Партии.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Партии.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.СтоимостьРегл КОНЕЦ) КАК СтоимостьРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА Партии.СтоимостьРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента ТОГДА
	|		0
	|	ИНАЧЕ
	|		Партии.НДСРегл
	|	КОНЕЦ) КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	СУММА(Партии.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Партии.ВременнаяРазница) КАК ВременнаяРазница,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость,
	|	0 КАК ИсходнаяСтоимость,
	|	0 КАК ИсходнаяСтоимостьРегл,
	|	0 КАК ИсходнаяСтоимостьЗабалансовая,
	|	0 КАК ИсходнаяСтоимостьЗабалансоваяРегл,
	|	0 КАК ИсходнаяСтоимостьБезНДС
	|ИЗ
	|	ВтПартии КАК Партии
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.ТипЗапасов,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ПериодПродажи,
	|	ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	ТипЗапасов,
	|	АналитикаУчетаПродукции,
	|	ПериодПродажи УБЫВ,
	|	Подразделение,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	КорВидЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, ВидДвижения, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов,КорОрганизация,
	|АналитикаУчетаНоменклатурыВО,АналитикаФинансовогоУчетаВО,АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ВариантРаспределенияРасходовУпр, ВариантРаспределенияРасходовРегл,
	|ДокументДвижения, ИдентификаторСтроки, КодСтроки, ПринятиеКНалоговомуУчету, ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры,
	|ПериодПродажи, ГруппаПродукции, СписаниеПриПередачеНУ, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр
	|");
	
	СуммыРаспределения = Новый Структура("Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов, АналитикаУчетаПродукции, ПериодПродажи,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СуммыВозврата = Новый Структура("Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов, АналитикаУчетаПродукции, ПериодПродажи,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	// Сформируем ВТПартии
	ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета);
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			Если Выборка.ЭтоВозвратОтКлиента Тогда
				Если СуммыВозврата.Регистратор = Выборка.Регистратор
				 И СуммыВозврата.Организация = Выборка.Организация
				 И СуммыВозврата.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
				 И СуммыВозврата.ВидЗапасов = Выборка.ВидЗапасов
				 И СуммыВозврата.ТипЗапасов = Выборка.ТипЗапасов
				 И СуммыВозврата.ПериодПродажи = Выборка.ПериодПродажи
				 И СуммыВозврата.АналитикаУчетаПродукции = Выборка.АналитикаУчетаПродукции Тогда
					СуммыВозврата.Количество = СуммыВозврата.Количество + Выборка.Количество;
					ДополнитьСуммыРаспределения(СуммыВозврата, Выборка);
				Иначе
					ЗаполнитьЗначенияСвойств(СуммыВозврата, Выборка);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.ТипЗапасов = Выборка.ТипЗапасов
			И СтрокаОстатка.АналитикаУчетаПродукции = Выборка.АналитикаУчетаПродукции
			И (СтрокаОстатка.ПериодПродажи = Выборка.ПериодПродажи
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя) Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			Если Выборка.Порядок = 2 И СтрокаОстатка.Количество > 0 Тогда
				РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);	
			ИначеЕсли Выборка.Порядок = 3 Тогда
				РаспределитьСтоимость(СуммыРаспределения, СуммыВозврата, Выборка, Выборка.Количество);
			КонецЕсли;
			
			Если НЕ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
			 И Выборка.ВидДвижения = ВидДвиженияНакопления.Приход) Тогда
				ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			КонецЕсли;
			
					
			// Корректировка списания товаров
			Если Выборка.ИсходнаяСтоимость <> 0 Тогда
				ЗаписьРаспределения.Стоимость = ЗаписьРаспределения.Стоимость - Выборка.ИсходнаяСтоимость;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьРегл <> 0 Тогда
				ЗаписьРаспределения.СтоимостьРегл = ЗаписьРаспределения.СтоимостьРегл - Выборка.ИсходнаяСтоимостьРегл;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьЗабалансовая <> 0 Тогда
				ЗаписьРаспределения.СтоимостьЗабалансовая = ЗаписьРаспределения.СтоимостьЗабалансовая - Выборка.ИсходнаяСтоимостьЗабалансовая;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьЗабалансоваяРегл <> 0 Тогда
				ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = ЗаписьРаспределения.СтоимостьЗабалансоваяРегл - Выборка.ИсходнаяСтоимостьЗабалансоваяРегл;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьБезНДС <> 0 Тогда
				ЗаписьРаспределения.СтоимостьБезНДС = ЗаписьРаспределения.СтоимостьБезНДС - Выборка.ИсходнаяСтоимостьБезНДС;
			КонецЕсли;
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов Тогда
				
				ЗаписьРаспределения.Стоимость = - ЗаписьРаспределения.Стоимость;
				ЗаписьРаспределения.СтоимостьБезНДС = - ЗаписьРаспределения.СтоимостьБезНДС;
				ЗаписьРаспределения.СтоимостьЗабалансовая = - ЗаписьРаспределения.СтоимостьЗабалансовая;
				ЗаписьРаспределения.ДопРасходы = - ЗаписьРаспределения.ДопРасходы;
				ЗаписьРаспределения.ДопРасходыБезНДС = - ЗаписьРаспределения.ДопРасходыБезНДС;
				ЗаписьРаспределения.СтоимостьРегл = - ЗаписьРаспределения.СтоимостьРегл;
				ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = - ЗаписьРаспределения.СтоимостьЗабалансоваяРегл;
				ЗаписьРаспределения.ПостояннаяРазница = - ЗаписьРаспределения.ПостояннаяРазница;
				ЗаписьРаспределения.ВременнаяРазница = - ЗаписьРаспределения.ВременнаяРазница;
				
				СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения,	ВидДвиженияНакопления.Приход);
				
			Иначе
				
				СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения, Выборка.ВидДвижения);
				
			КонецЕсли;

			// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
			Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета)
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СборкаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.РазборкаТоваров
			 И НЕ (ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") 
			 	И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
			 И ТипЗнч(Выборка.Регистратор) <> Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПересортицаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПорчаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПеремещениеТоваров Тогда
				
				СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения);
						
			КонецЕсли;
				
			// Корректировка списания товаров на затраты в регистре учет прочих расходов.
			Если (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании)
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				 
					ЭтоВыпускПродукции = Ложь;
					
					Если ЗначениеЗаполнено(ЗаписьРаспределения.СтатьяАктивовПассивов) Тогда
						СформироватьДвиженияПрочиеАктивыПассивы(
							ПараметрыРасчета,
							ЗаписьРаспределения,
							ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0));
					Иначе
						СформироватьДвиженияПрочиеРасходы(
							ПараметрыРасчета,
							ЗаписьРаспределения,
							ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0),
							ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьБезНДС, 0),
							ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьРегл, 0),
							0,
							ЗаписьРаспределения.ПостояннаяРазница,
							ЗаписьРаспределения.ВременнаяРазница);
					КонецЕсли;

			КонецЕсли;
					
			// Формирование прочих доходов\расходов при пересортице
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
			 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
			 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				 
			 СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы - Выборка.КорСтоимость;
				Если СуммаПереоценки > 0 Тогда 

					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммаПереоценки,
						ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС,
						ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл,
						0,
						ЗаписьРаспределения.ПостояннаяРазница,
						ЗаписьРаспределения.ВременнаяРазница);

				ИначеЕсли СуммаПереоценки < 0 Тогда

					СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						- СуммаПереоценки,
						- (ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл),
						0);

				КонецЕсли;

			КонецЕсли;
		
			// Формирование прочих расходов при порче
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
			
				СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы - Выборка.КорСтоимость;
				Если СуммаПереоценки <> 0 Тогда
					
					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммаПереоценки,
						ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС,
						ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл,
						0,
						ЗаписьРаспределения.ПостояннаяРазница,
						ЗаписьРаспределения.ВременнаяРазница);
					
				КонецЕсли;

			КонецЕсли;

			// Формирование прочих доходов/расходов при возврате товаров поставщику.
			Если ((Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
				И ЗаписьРаспределения.КорСтоимость <> 0)
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
				ИЛИ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
					И Выборка.КорСтоимость <> 0)
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары)
				И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
				И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				
				СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы;
				Если СуммаПереоценки > 0 ИЛИ ЗаписьРаспределения.СтоимостьРегл > 0 Тогда

					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммаПереоценки,
						ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС,
						ЗаписьРаспределения.СтоимостьРегл,
						0,
						ЗаписьРаспределения.ПостояннаяРазница,
						ЗаписьРаспределения.ВременнаяРазница);

				ИначеЕсли СуммаПереоценки < 0 Тогда

					СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						- СуммаПереоценки,
						- (ЗаписьРаспределения.СтоимостьРегл),
						0);

				КонецЕсли;
				
			КонецЕсли;
		
			// Корректировка движений по оборотным регистрам управленческого учета.
			СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, ЗаписьРаспределения);
			
		КонецЕсли;

	КонецЦикла;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТПартии");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 2.2
Процедура СкорректироватьСтоимостьПродажПоФИФОСкользящая(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПродажПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|
	|	Продажи.РазделУчета                КАК РазделУчета,
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер         КАК Партнер,
	|	АналитикаПартнеров.Контрагент      КАК Контрагент,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	СУММА(
	|		ВЫБОР КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	СУММА(Продажи.Количество)          КАК ИсходноеКоличество,
	|	0                                  КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И (Продажи.ХозяйственнаяОперация В (&МассивОперацийРеализации)
	|		ИЛИ Продажи.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов))
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер,
	|	АналитикаПартнеров.Контрагент,
	|	Продажи.Подразделение,
	|	Продажи.РазделУчета,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Продажи.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	&НачалоПериода КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Регистратор КАК ДокументДвижения,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.ТипЗапасов КАК ТипЗапасов,
	|
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|
	|	Партии.Количество КАК Количество,
	|	Партии.Стоимость КАК Стоимость,
	|	Партии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	Партии.ДопРасходы КАК ДопРасходы,
	|	Партии.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	Партии.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	Партии.НДСРегл КАК НДСРегл,
	|	Партии.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Партии.ВременнаяРазница КАК ВременнаяРазница,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	ТипЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, РазделУчета,
	|Подразделение, АналитикаУчетаПоПартнерам, Партнер, Контрагент,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры, 
	|НалогообложениеНДС, ДокументДвижения,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Количество,
	|ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");

	// Сформируем ВТПартии
	ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета, Истина);
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
		 И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
		 И СтрокаОстатка.ТипЗапасов = Выборка.ТипЗапасов
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда	
				
				СформироватьДвиженияЗакупки(ПараметрыРасчета, ЗаписьРаспределения);
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТПартии");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);

КонецПроцедуры


// Этап 2.5
Процедура ЗарегистрироватьСтоимостьФИФО(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимостьФИФО");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов						КАК ВидЗапасов,
	|	Себестоимость.Организация						КАК Организация,
	|	Себестоимость.РазделУчета						КАК РазделУчета,
	|	СУММА(Себестоимость.Количество)					КАК Количество,
	|	СУММА(Себестоимость.Стоимость)					КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)			КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.ДопРасходы)			КАК СтоимостьДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС) 	КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл)				КАК СтоимостьРегл
	|ПОМЕСТИТЬ ВТСебестоимостьОборот
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	НЕ Себестоимость.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка		КАК ДокументДвижения,
	|	&НачалоПериода								КАК Период,
	|
	|	Себестоимость.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов					КАК ВидЗапасов,
	|	Себестоимость.Организация					КАК Организация,
	|	Себестоимость.РазделУчета					КАК РазделУчета,
	|
	|	ВЫРАЗИТЬ((Себестоимость.Стоимость / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 				КАК Стоимость,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьБезНДС / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 			КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьДопРасходы / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 		КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьДопРасходыБезНДС / Себестоимость.Количество) КАК ЧИСЛО(31,10)) КАК СтоимостьДопРасходыБезНДС,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьРегл / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 			КАК СтоимостьРегл
	|ИЗ
	|	ВТСебестоимостьОборот КАК Себестоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыСведений.СтоимостьТоваров.Имя,
		Запрос);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТСебестоимостьОборот");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


// Этап 3.0
Процедура ПодготовкаДанныхДляПрочихРасходов(ПараметрыРасчета)

	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляПрочихРасходов");
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля =
		"Период, ВидДвижения, Организация, Подразделение, НаправлениеДеятельности, ХозяйственнаяОперация,
		|СтатьяРасходов, АналитикаРасходов, Сумма, СуммаБезНДС, СуммаРегл, СуммаУпр, ПостояннаяРазница, ВременнаяРазница";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.Регистратор КАК ДокументДвижения,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.Сумма,
	|	Т.СуммаБезНДС,
	|	Т.СуммаРегл,
	|	Т.СуммаУпр,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|		ПО Распределение.Ссылка = Т.Регистратор 
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И Распределение.Дата < &НачалоПериода
	|	И (Т.РасчетПартий ИЛИ Т.РасчетСебестоимости)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Добавим движение и заполним его свойства.
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, КопируемыеПоля);
	КонецЦикла;
	
КонецПроцедуры

// Этап 3.1
Процедура ВключитьИсключитьНДСВСтоимость(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимость");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов
	|ПОМЕСТИТЬ РасходыПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В(&МассивОрганизаций)
	|	И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|ИНДЕКСИРОВАТЬ ПО
	|	Партии.Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС
	|ПОМЕСТИТЬ ДвиженияСебестоимости
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|	И НЕ &ОдновременноФормироватьДвиженияПартийНДСВерсии22И24
	|	И (УчетСебестоимости.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ИЛИ УчетСебестоимости.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И УчетСебестоимости.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаПродукции КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаПродукции КАК КорАналитикаУчетаНоменклатуры,
	|		РасходыПартий.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыПартий КАК РасходыПартий
	|			ПО РасходыПартий.Регистратор = Партии.Регистратор
	|			И РасходыПартий.Организация = Партии.Организация
	|			И РасходыПартий.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаПродукции
	|			И РасходыПартий.ДокументПоступления = Партии.ДокументВыпуска
	|			И РасходыПартий.СтатьяРасходовСписания = Партии.СтатьяРасходовСписания
	|			И РасходыПартий.АналитикаРасходов = Партии.АналитикаРасходов 
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		(ВЫБОР
	|			КОГДА ДвиженияСебестоимости.Регистратор ЕСТЬ NULL ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Партии.Партия КОНЕЦ) КАК Партия,
	|		Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовАктивов КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА (ВЫБОР
	|					КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|						ТОГДА Партии.СтоимостьБезНДС + Партии.НДС
	|					КОГДА Партии.СтоимостьБезНДС = 0 ТОГДА Партии.НДС
	|					ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ)
	|			ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСебестоимости КАК ДвиженияСебестоимости
	|		 ПО ДвиженияСебестоимости.Период = Партии.Период
	|		 И ДвиженияСебестоимости.Регистратор = Партии.Регистратор
	|		 И ДвиженияСебестоимости.Организация = Партии.Организация
	|		 И ДвиженияСебестоимости.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		 И ДвиженияСебестоимости.Партия = Партии.Партия
	|		 И ДвиженияСебестоимости.АналитикаФинансовогоУчета = Партии.АналитикаФинансовогоУчета
	|		 И ДвиженияСебестоимости.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|		И НЕ &ОдновременноФормироватьДвиженияПартийНДСВерсии22И24
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|
	|	) КАК Партии
	|ГДЕ
	|	НЕ Партии.НалогообложениеПартии ЕСТЬ NULL
	|	И Партии.НалогообложениеПартии <> Партии.НалогообложениеНДС
	|	И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	УчетСебестоимости.Период КАК Период,
	|	УчетСебестоимости.Регистратор КАК Регистратор,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.Партия КАК Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ) КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов КАК КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение КАК Подразделение,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции КАК ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.Регистратор КАК ДокументДвижения,
	|	ЛОЖЬ КАК ЭтоПередачаМеждуОрганизациями,
	|
	|	СУММА(ВЫБОР
	|		КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА (ВЫБОР
	|				КОГДА УчетСебестоимости.ДопРасходыРегл = 0 ТОГДА УчетСебестоимости.НДСРегл
	|				ИНАЧЕ УчетСебестоимости.ДопРасходыРегл КОНЕЦ)
	|		ИНАЧЕ УчетСебестоимости.Количество КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.Количество) КАК ИсходноеКоличество
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|		ПО Регистраторы.Регистратор = УчетСебестоимости.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И (УчетСебестоимости.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ИЛИ УчетСебестоимости.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И УчетСебестоимости.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.АналитикаРасходов,
	|
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ),
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовРегл,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	ЛОЖЬ 		 КАК ЭтоПередачаМеждуОрганизациями,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Партии.НДСРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.НДСУпр) КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК ИсходноеКоличество
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|	ИЛИ СУММА(Партии.НДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	КорАналитикаУчетаНоменклатуры,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад, Партия, АналитикаФинансовогоУчета,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов, КорОрганизация,
	|АналитикаУчетаНоменклатурыВО, АналитикаФинансовогоУчетаВО, АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ВариантРаспределенияРасходовУпр, ВариантРаспределенияРасходовРегл,
	|ДокументДвижения, ИдентификаторСтроки, ПринятиеКНалоговомуУчету, ГруппаПродукции, СписаниеПриПередачеНУ,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл, НДСРегл,
	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр
	|");
	
	СуммыРаспределения = Новый Структура("
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, Партия, АналитикаФинансовогоУчета, СтатьяРасходовСписания, АналитикаРасходов,
	|КорАналитикаУчетаНоменклатуры,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
			И (СтрокаОстатка.КорАналитикаУчетаНоменклатуры = Выборка.КорАналитикаУчетаНоменклатуры
				ИЛИ НЕ ЗначениеЗаполнено(Выборка.КорРазделУчета))
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.Партия = Выборка.Партия
			И СтрокаОстатка.АналитикаФинансовогоУчета = Выборка.АналитикаФинансовогоУчета
			И СтрокаОстатка.СтатьяРасходовСписания = Выборка.СтатьяРасходовСписания
			И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			
			Если ЗаписьРаспределения.СтоимостьРегл <> 0 ИЛИ ЗаписьРаспределения.СтоимостьУпр <> 0 Тогда
					
				// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
				Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета) Тогда
					
					СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения, ПараметрыРасчета.ПредварительныйРасчет);
							
				КонецЕсли;
				
				Если ПараметрыРасчета.ПредварительныйРасчет Тогда
					Продолжить;
				КонецЕсли;
				
				// Корректировка списания товаров на затраты в регистре учет прочих расходов.
				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании Тогда
				 
				 	СформироватьДвиженияПрочиеРасходы(
				 		ПараметрыРасчета,
						ЗаписьРаспределения,
						0,
						0,
						ЗаписьРаспределения.СтоимостьРегл,
						ЗаписьРаспределения.СтоимостьУпр,
						0,
						0);
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "РасходыПартий, ДвиженияСебестоимости, ВтПартии, ВтРегистраторы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.1.2
Процедура ВключитьИсключитьНДСВСтоимость24(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимость24");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	ВыполненРасчетПартийНДС = УниверсальныеМеханизмыПартийИСебестоимости.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ЗнаменателиРасходов");
	
	Если НЕ ВыполненРасчетПартийНДС Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ДД.Регистратор КАК Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета КАК РазделУчета,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	0 КАК Знаменатель
		|ПОМЕСТИТЬ ЗнаменателиРасходов
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст  + "
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи,
	|	Партии.КорВидДеятельностиНДС,
	|	Партии.ВидДеятельностиНДС,
	|
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|			ТОГДА Партии.СтоимостьБезНДС + Партии.НДСРегл
	|		КОГДА Партии.СтоимостьБезНДС = 0
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ) КАК Знаменатель
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
	|		Партии.Партия КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовАктивов КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		Партии.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|		Партии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		Партии.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДляСвязи,
	|		Партии.КорВидЗапасов КАК ВидЗапасовДляСвязи
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН2_4 КАК Партии
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|
	|	) КАК Партии
	|ГДЕ
	|	НЕ Партии.ВидДеятельностиНДС ЕСТЬ NULL
	|	И Партии.ВидДеятельностиНДС <> Партии.КорВидДеятельностиНДС
	|	И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.КорВидДеятельностиНДС,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период КАК Период,
	|	УчетСебестоимости.Регистратор КАК Регистратор,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.Партия КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	УчетСебестоимости.РазделУчета КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ) КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов КАК КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение КАК Подразделение,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции КАК ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.Партия
	|		ИНАЧЕ УчетСебестоимости.КорПартия
	|	КОНЕЦ КАК КорПартия,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.АналитикаУчетаПартий
	|		ИНАЧЕ УчетСебестоимости.КорАналитикаУчетаПартий
	|	КОНЕЦ КАК КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.Регистратор КАК ДокументДвижения,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		ТОГДА УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОНЕЦ КАК АналитикаУчетаНоменклатурыДляСвязи,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.КорВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ТОГДА УчетСебестоимости.ВидЗапасов
	|		ИНАЧЕ УчетСебестоимости.КорВидЗапасов
	|	КОНЕЦ КАК ВидЗапасовДляСвязи,
	|
	|	СУММА(ВЫБОР
	|		КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|		 И УчетСебестоимости.ДопРасходыРегл	<> 0
	|			ТОГДА УчетСебестоимости.ДопРасходыРегл
	|		КОГДА НЕ ЗнаменателиРасходов.Знаменатель ЕСТЬ NULL
	|			ТОГДА ЗнаменателиРасходов.Знаменатель
	|		КОГДА ЕСТЬNULL(Цены.СтоимостьРегл + Цены.ДопРасходыРегл + Цены.ТрудозатратыРегл, 0) = 0
	|			ТОГДА УчетСебестоимости.НДСРегл
	|		ИНАЧЕ ВЫРАЗИТЬ(УчетСебестоимости.Количество * ЕСТЬNULL(Цены.СтоимостьРегл + Цены.ДопРасходыРегл + Цены.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2)) КОНЕЦ) КАК Знаменатель
	|ПОМЕСТИТЬ ВТСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|		ПО Регистраторы.Регистратор = УчетСебестоимости.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЗнаменателиРасходов КАК ЗнаменателиРасходов
	|		ПО ЗнаменателиРасходов.Регистратор = УчетСебестоимости.Регистратор
	|		И ЗнаменателиРасходов.Партия = УчетСебестоимости.Партия
	|		И ЗнаменателиРасходов.АналитикаУчетаПартий = УчетСебестоимости.АналитикаУчетаПартий
	|		И ЗнаменателиРасходов.ВидДеятельностиНДС = УчетСебестоимости.ВидДеятельностиНДС
	|		И ЗнаменателиРасходов.АналитикаФинансовогоУчета = УчетСебестоимости.АналитикаФинансовогоУчета
	|		И ЗнаменателиРасходов.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЗнаменателиРасходов.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЗнаменателиРасходов.РазделУчета = УчетСебестоимости.РазделУчета
	|		И ЗнаменателиРасходов.Организация = УчетСебестоимости.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваровПредыдущая КАК Цены
	|		ПО Цены.Организация = УчетСебестоимости.Организация
	|		И Цены.Партия = УчетСебестоимости.Партия
	|		И Цены.АналитикаУчетаПартий = УчетСебестоимости.АналитикаУчетаПартий
	|		И Цены.АналитикаФинансовогоУчета = УчетСебестоимости.АналитикаФинансовогоУчета
	|		И Цены.ВидДеятельностиНДС = УчетСебестоимости.ВидДеятельностиНДС
	|		И Цены.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И (НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов ИЛИ Цены.ВидЗапасов = УчетСебестоимости.ВидЗапасов)
	|		И Цены.РазделУчета = УчетСебестоимости.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И (УчетСебестоимости.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ИЛИ УчетСебестоимости.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И УчетСебестоимости.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.АналитикаРасходов,
	|
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ),
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.Партия
	|		ИНАЧЕ УчетСебестоимости.КорПартия
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.АналитикаУчетаПартий
	|		ИНАЧЕ УчетСебестоимости.КорАналитикаУчетаПартий
	|	КОНЕЦ,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		ТОГДА УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.КорВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ТОГДА УчетСебестоимости.ВидЗапасов
	|		ИНАЧЕ УчетСебестоимости.КорВидЗапасов
	|	КОНЕЦ
	|////////////////////////////////////////////////////////////////////////////////
	|
	|;
	|ВЫБРАТЬ
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаУчетаНоменклатурыДляСвязи,
	|	Т.ВидЗапасовДляСвязи,
	|	СУММА(ВЫБОР КОГДА Т.Знаменатель < 0
	|		ТОГДА -Т.Знаменатель
	|		ИНАЧЕ Т.Знаменатель 
	|	КОНЕЦ) КАК Знаменатель
	|ПОМЕСТИТЬ ЗнаменателиСебестоимости
	|ИЗ
	|	ВТСебестоимость КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаУчетаНоменклатурыДляСвязи,
	|	Т.ВидЗапасовДляСвязи
	|////////////////////////////////////////////////////////////////////////////////
	|
	|;
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	УчетСебестоимости.Период КАК Период,
	|	УчетСебестоимости.Регистратор КАК Регистратор,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.Партия КАК Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов КАК КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение КАК Подразделение,
	|	УчетСебестоимости.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	УчетСебестоимости.ПринятиеКНалоговомуУчету КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции КАК ГруппаПродукции,
	|	УчетСебестоимости.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.ДокументДвижения КАК ДокументДвижения,
	|	ЛОЖЬ КАК ЭтоПередачаМеждуОрганизациями,
	|	УчетСебестоимости.АналитикаУчетаНоменклатурыДляСвязи КАК АналитикаУчетаНоменклатурыДляСвязи,
	|	УчетСебестоимости.ВидЗапасовДляСвязи КАК ВидЗапасовДляСвязи,
	|
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Знаменатель < 0
	|		ТОГДА -УчетСебестоимости.Знаменатель
	|		ИНАЧЕ УчетСебестоимости.Знаменатель 
	|	КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Знаменатель < 0
	|		ТОГДА -УчетСебестоимости.Знаменатель
	|		ИНАЧЕ УчетСебестоимости.Знаменатель 
	|	КОНЕЦ) КАК ИсходноеКоличество
	|ИЗ
	|	ВТСебестоимость КАК УчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.ВариантРаспределенияРасходовРегл,
	|	УчетСебестоимости.ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции,
	|	УчетСебестоимости.НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.ДокументДвижения,
	|	УчетСебестоимости.АналитикаУчетаНоменклатурыДляСвязи,
	|	УчетСебестоимости.ВидЗапасовДляСвязи
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Знаменатель < 0
	|		ТОГДА -УчетСебестоимости.Знаменатель
	|		ИНАЧЕ УчетСебестоимости.Знаменатель 
	|	КОНЕЦ) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовРегл,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	ЛОЖЬ 		 КАК ЭтоПередачаМеждуОрганизациями,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи КАК АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи КАК ВидЗапасовДляСвязи,
	|	СУММА(ВЫБОР
	|		КОГДА НЕ ЗнаменателиСебестоимости.Знаменатель ЕСТЬ NULL
	|			ТОГДА ЗнаменателиСебестоимости.Знаменатель
	|		КОГДА Партии.Знаменатель < 0 ТОГДА
	|			-Партии.Знаменатель
	|		ИНАЧЕ Партии.Знаменатель
	|	КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Партии.НДСРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.НДСУпр) КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК ИсходноеКоличество
	|ИЗ
	|	ВтПартии КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЗнаменателиСебестоимости КАК ЗнаменателиСебестоимости
	|		ПО ЗнаменателиСебестоимости.Регистратор = Партии.Регистратор
	|		И ЗнаменателиСебестоимости.Организация = Партии.Организация
	|		И ЗнаменателиСебестоимости.Партия = Партии.Партия
	|		И ЗнаменателиСебестоимости.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|		И ЗнаменателиСебестоимости.АналитикаУчетаНоменклатурыДляСвязи = Партии.АналитикаУчетаНоменклатурыДляСвязи
	|		И ЗнаменателиСебестоимости.ВидЗапасовДляСвязи = Партии.ВидЗапасовДляСвязи
	|ГДЕ
	|	Партии.Знаменатель > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА НЕ ЗнаменателиСебестоимости.Знаменатель ЕСТЬ NULL
	|			ТОГДА ЗнаменателиСебестоимости.Знаменатель
	|		КОГДА Партии.Знаменатель < 0 ТОГДА
	|			-Партии.Знаменатель
	|		ИНАЧЕ Партии.Знаменатель
	|	КОНЕЦ) <> 0
	|	И (СУММА(Партии.НДСРегл) <> 0 ИЛИ СУММА(Партии.НДСУпр) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	Партия,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	АналитикаУчетаНоменклатурыДляСвязи,
	|	ВидЗапасовДляСвязи,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	АналитикаФинансовогоУчета,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад, Партия, АналитикаФинансовогоУчета,
	|АналитикаУчетаНоменклатурыДляСвязи, ВидЗапасовДляСвязи,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов, КорОрганизация,
	|АналитикаУчетаНоменклатурыВО, АналитикаФинансовогоУчетаВО, АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ВариантРаспределенияРасходовУпр, ВариантРаспределенияРасходовРегл,
	|ДокументДвижения, ИдентификаторСтроки, ПринятиеКНалоговомуУчету, ГруппаПродукции, СписаниеПриПередачеНУ,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл, НДСРегл,
	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр
	|");
	
	СуммыРаспределения = Новый Структура("
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, Партия, АналитикаФинансовогоУчета, СтатьяРасходовСписания, АналитикаРасходов,
	|АналитикаУчетаНоменклатурыДляСвязи, ВидЗапасовДляСвязи,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.Партия = Выборка.Партия
			И СтрокаОстатка.СтатьяРасходовСписания = Выборка.СтатьяРасходовСписания
			И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
			И СтрокаОстатка.АналитикаУчетаНоменклатурыДляСвязи = Выборка.АналитикаУчетаНоменклатурыДляСвязи
			И СтрокаОстатка.ВидЗапасовДляСвязи = Выборка.ВидЗапасовДляСвязи Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			
			Если ЗаписьРаспределения.СтоимостьРегл <> 0 ИЛИ ЗаписьРаспределения.СтоимостьУпр <> 0 Тогда
					
				// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
				Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета) Тогда
					
					СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения, ПараметрыРасчета.ПредварительныйРасчет);
							
				КонецЕсли;
				
				Если ПараметрыРасчета.ПредварительныйРасчет Тогда
					Продолжить;
				КонецЕсли;
				
				// Корректировка списания товаров на затраты в регистре учет прочих расходов.
				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании Тогда
				 
				 	СформироватьДвиженияПрочиеРасходы(
				 		ПараметрыРасчета,
						ЗаписьРаспределения,
						0,
						0,
						ЗаписьРаспределения.СтоимостьРегл,
						ЗаписьРаспределения.СтоимостьУпр,
						0,
						0);
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтПартии, ВтРегистраторы, ВТСебестоимость, ЗнаменателиСебестоимости"
		+ ?(НЕ ВыполненРасчетПартийНДС, ", ЗнаменателиРасходов", ""));
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.2
// Формирует временную таблицу ВТДопРасходов
//
Процедура РаспределитьРасходыНаСебестоимость(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьРасходыНаСебестоимость");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда 
		
		ТаблицаДопРасходов = ТаблицаРаспределенияРасходовНаСебестоимостьТоваров(ПараметрыРасчета);
		
		ТаблицаДопРасходов.Колонки.Удалить("Подразделение");
		ТаблицаДопРасходов.Колонки.Удалить("СтатьяРасходовСписания");
		ТаблицаДопРасходов.Колонки.Удалить("АналитикаРасходов");
		
		Запрос.УстановитьПараметр("ТаблицаДопРасходов", ТаблицаДопРасходов);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
		|	Таблица.ВидЗапасов                 КАК ВидЗапасов,
		|	Таблица.Организация                КАК Организация,
		|	Таблица.ДопРасходы           	   КАК ДопРасходы,
		|	Таблица.ДопРасходыБезНДС     	   КАК ДопРасходыБезНДС,
		|	Таблица.ДопРасходыРегл             КАК ДопРасходыРегл,
		|	Таблица.ДопРасходыУпр              КАК ДопРасходыУпр
		|ПОМЕСТИТЬ ВТДопРасходов
		|ИЗ
		|	&ТаблицаДопРасходов КАК Таблица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Организация
		|";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ДопРасходыУпр
		|ПОМЕСТИТЬ ВТДопРасходов
		|";
		
	КонецЕсли;
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Этап 3.3
// Выполняет корректировку стоимости возвратов от клиента прошлых периодов
//
Процедура СкорректироватьСтоимостьВозвратовПрошлыхПериодов(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьВозвратовПрошлыхПериодов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	СУММА(ДД.Количество) КАК Количество,
	|	МАКСИМУМ(Стоимости.Период) КАК Период
	|ПОМЕСТИТЬ СторноОтчетыКомиссионера
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПоКомиссииМеждуОрганизациями КАК Отчет
	|		ПО Отчет.Ссылка = ДД.Регистратор
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК Стоимости
	|		ПО Стоимости.Период < &НачалоПериода
	|		И Стоимости.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И Стоимости.РазделУчета = ДД.РазделУчета
	|		И Стоимости.ВидЗапасов = ДД.ВидЗапасов
	|		И Стоимости.Организация = ДД.Организация
	|ГДЕ
	|	НЕ ДД.СлужебноеВидДвиженияПриход
	|СГРУППИРОВАТЬ ПО
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация
	|ИМЕЮЩИЕ
	|	СУММА(ДД.Количество) < 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Себестоимость.ДокументИсточник КАК Ссылка
	|ПОМЕСТИТЬ ВтРеализацииПрошлыхПериодов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|	И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Регистратор                         КАК Ссылка,
	|	Себестоимость.АналитикаУчетаНоменклатуры          КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                         КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                          КАК ВидЗапасов,
	|	Себестоимость.Организация               		  КАК Организация,
	|	Себестоимость.Партия                          	  КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий                КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета           КАК АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22
	|		 ИЛИ Себестоимость.Период < ДатаПереходаНаПУ22.Значение
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ                                             КАК ВидДеятельностиНДС,
	|
	|	СУММА(Себестоимость.Количество)                   КАК Количество,
	|	СУММА(Себестоимость.Стоимость)                    КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)              КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)        КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.ДопРасходы)             	  КАК ДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС)       	  КАК ДопРасходыБезНДС,
	|	СУММА(Себестоимость.Трудозатраты)       		  КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеСНДС)    КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС)  КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеСНДС)    КАК ПостатейныеПеременныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеБезНДС)  КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл)                КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)    КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница)            КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)             КАК ВременнаяРазница,
	|	СУММА(Себестоимость.ДопРасходыРегл)               КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл)             КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеРегл)    КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Себестоимость.ПостатейныеПеременныеРегл)    КАК ПостатейныеПеременныеРегл,
	|	СУММА(Себестоимость.СтоимостьУпр)    			  КАК СтоимостьУпр,
	|	СУММА(Себестоимость.ДопРасходыУпр)    			  КАК ДопРасходыУпр,
	|	СУММА(Себестоимость.ТрудозатратыУпр)    		  КАК ТрудозатратыУпр,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеУпр)     КАК ПостатейныеПостоянныеУпр,
	|	СУММА(Себестоимость.ПостатейныеПеременныеУпр)     КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ВтСуммыРеализацийПрошлыхПериодов
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализацииПрошлыхПериодов КАК Продажи
	|		ПО Продажи.Ссылка = Себестоимость.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Константа.ДатаПереходаНаПартионныйУчетВерсии22 КАК ДатаПереходаНаПУ22
	|		ПО ИСТИНА
	|ГДЕ
	|	Себестоимость.Период < &НачалоПериода
	|	И Себестоимость.Организация В(&МассивОрганизаций)
	|	И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Себестоимость.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22
	|		 ИЛИ Себестоимость.Период < ДатаПереходаНаПУ22.Значение
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьПродаж.ДокументДвижения                  КАК Ссылка,
	|	СебестоимостьПродаж.АналитикаУчетаНоменклатуры        КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьПродаж.РазделУчета                       КАК РазделУчета,
	|	СебестоимостьПродаж.ВидЗапасов                        КАК ВидЗапасов,
	|	СебестоимостьПродаж.Организация               		  КАК Организация,
	|	СебестоимостьПродаж.Партия                            КАК Партия,
	|	СебестоимостьПродаж.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	СебестоимостьПродаж.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	СебестоимостьПродаж.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|
	|	СУММА(СебестоимостьПродаж.ДопРасходы)             	  КАК ДопРасходы,
	|	СУММА(СебестоимостьПродаж.ДопРасходыБезНДС)       	  КАК ДопРасходыБезНДС,
	|	СУММА(СебестоимостьПродаж.ДопРасходыРегл)             КАК ДопРасходыРегл,
	|	СУММА(СебестоимостьПродаж.ДопРасходыУпр)    		  КАК ДопРасходыУпр
	|
	|ПОМЕСТИТЬ ВтСуммыДопРасходовПрошлыхПериодов
	|ИЗ (
	|	ВЫБРАТЬ
	|		СебестоимостьПродаж.ДокументДвижения,
	|		СебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|		СебестоимостьПродаж.РазделУчета,
	|		СебестоимостьПродаж.ВидЗапасов,
	|		АналитикаПартнеров.Организация,
	|		СебестоимостьПродаж.Партия,
	|		СебестоимостьПродаж.АналитикаУчетаПартий,
	|		СебестоимостьПродаж.АналитикаФинансовогоУчета,
	|		СебестоимостьПродаж.ВидДеятельностиНДС,
	|
	|		СебестоимостьПродаж.ДопРасходы,
	|		СебестоимостьПродаж.ДопРасходыБезНДС,
	|		СебестоимостьПродаж.ДопРасходыРегл,
	|		СебестоимостьПродаж.ДопРасходыУпр
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК СебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаПартнеров
	|			ПО СебестоимостьПродаж.АналитикаУчетаПоПартнерам = АналитикаПартнеров.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализацииПрошлыхПериодов КАК Продажи
	|			ПО Продажи.Ссылка = СебестоимостьПродаж.ДокументДвижения
	|	ГДЕ
	|		СебестоимостьПродаж.Период < &НачалоПериода
	|		И АналитикаПартнеров.Организация В(&МассивОрганизаций)
	|		И СебестоимостьПродаж.РасчетПартий
	|		И СебестоимостьПродаж.Активность
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		СебестоимостьПродаж.ДокументДвижения,
	|		СебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|		СебестоимостьПродаж.РазделУчета,
	|		СебестоимостьПродаж.ВидЗапасов,
	|		АналитикаПартнеров.Организация,
	|		СебестоимостьПродаж.Партия,
	|		СебестоимостьПродаж.АналитикаУчетаПартий,
	|		СебестоимостьПродаж.АналитикаФинансовогоУчета,
	|		СебестоимостьПродаж.ВидДеятельностиНДС,
	|
	|		СебестоимостьПродаж.ДопРасходы,
	|		СебестоимостьПродаж.ДопРасходыБезНДС,
	|		СебестоимостьПродаж.ДопРасходыРегл,
	|		СебестоимостьПродаж.ДопРасходыУпр
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК СебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаПартнеров
	|			ПО СебестоимостьПродаж.АналитикаУчетаПоПартнерам = АналитикаПартнеров.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализацииПрошлыхПериодов КАК Продажи
	|			ПО Продажи.Ссылка = СебестоимостьПродаж.ДокументДвижения
	|	ГДЕ
	|		СебестоимостьПродаж.РасчетПартий
	|
	|	) КАК СебестоимостьПродаж
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьПродаж.ДокументДвижения,
	|	СебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	СебестоимостьПродаж.РазделУчета,
	|	СебестоимостьПродаж.ВидЗапасов,
	|	СебестоимостьПродаж.Организация,
	|	СебестоимостьПродаж.Партия,
	|	СебестоимостьПродаж.АналитикаУчетаПартий,
	|	СебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	СебестоимостьПродаж.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выручка.Регистратор,
	|	Выручка.АналитикаУчетаНоменклатуры,
	|	Выручка.ВидЗапасов,
	|	Выручка.ЗаказКлиента,
	|	МАКСИМУМ(Выручка.ИсточникГФУНоменклатуры) КАК ИсточникГФУНоменклатуры,
	|	МАКСИМУМ(Выручка.ИсточникГФУРасчетов) КАК ИсточникГФУРасчетов
	|ПОМЕСТИТЬ ИсточникиГФУ
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Выручка
	|ГДЕ
	|	Выручка.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|СГРУППИРОВАТЬ ПО
	|	Выручка.Регистратор,
	|	Выручка.АналитикаУчетаНоменклатуры,
	|	Выручка.ВидЗапасов,
	|	Выручка.ЗаказКлиента
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Период                              КАК Период,
	|	ВЫБОР КОГДА Себестоимость.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   						  КАК ВидДвижения,
	|	Себестоимость.АналитикаУчетаНоменклатуры          КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                         КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                          КАК ВидЗапасов,
	|	Себестоимость.ВидЗапасов.ТипЗапасов               КАК ТипЗапасов,
	|	Себестоимость.Партия                          	  КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий                КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета           КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС                  КАК ВидДеятельностиНДС,
	|
	// В кор. части могут быть данные об исходной аналитике продажи (если возврат идет на другой склад)
	|	ВЫБОР КОГДА Себестоимость.КорВидЗапасов <> Значение(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорВидЗапасов
	|		ИНАЧЕ
	|			Себестоимость.ВидЗапасов
	|	КОНЕЦ                                             КАК ВидыЗапасовДляЦены,
	// В кор. части могут быть данные об исходном виде запасов продажи (в случае возврата проданного по Интеркампани товара)
	|	ВЫБОР КОГДА Себестоимость.КорАналитикаУчетаНоменклатуры <> Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ
	|			Себестоимость.АналитикаУчетаНоменклатуры
	|	КОНЕЦ                                             КАК АналитикаНоменклатурыДляЦены,
	|
	|	СУММА(Себестоимость.Количество)                   КАК Количество,
	|
	|	СУММА(Себестоимость.Стоимость)                    КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)              КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)        КАК СтоимостьЗабалансовая,
	|
	|	СУММА(Себестоимость.ДопРасходы)             	  КАК ДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС)       	  КАК ДопРасходыБезНДС,
	|	СУММА(Себестоимость.Трудозатраты)       		  КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеСНДС)	  КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС)  КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеСНДС)	  КАК ПостатейныеПеременныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеБезНДС)  КАК ПостатейныеПеременныеБезНДС,
	|
	|	СУММА(Себестоимость.СтоимостьРегл)                КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)    КАК СтоимостьЗабалансоваяРегл,
	|
	|	СУММА(Себестоимость.ПостояннаяРазница)            КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)             КАК ВременнаяРазница,
	|
	|	СУММА(Себестоимость.ДопРасходыРегл)               КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл)             КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеРегл)	  КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Себестоимость.ПостатейныеПеременныеРегл)	  КАК ПостатейныеПеременныеРегл,
	
	|	СУММА(Себестоимость.СтоимостьУпр)	  			  КАК СтоимостьУпр,
	|	СУММА(Себестоимость.ДопРасходыУпр)	  			  КАК ДопРасходыУпр,
	|	СУММА(Себестоимость.ТрудозатратыУпр)	  		  КАК ТрудозатратыУпр,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеУпр)	  КАК ПостатейныеПостоянныеУпр,
	|	СУММА(Себестоимость.ПостатейныеПеременныеУпр)	  КАК ПостатейныеПеременныеУпр,
	|
	|	Себестоимость.ХозяйственнаяОперация               КАК ХозяйственнаяОперация,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры       КАК КорАналитикаУчетаНоменклатуры,
	|	Себестоимость.КорРазделУчета                      КАК КорРазделУчета,
	|	Себестоимость.КорВидЗапасов                       КАК КорВидЗапасов,
	|	Себестоимость.АналитикаУчетаПоПартнерам           КАК АналитикаУчетаПоПартнерам,
	|	Себестоимость.ЗаказКлиента                        КАК ЗаказКлиента,
	|	Себестоимость.Подразделение                       КАК Подразделение,
	|	Себестоимость.Организация                         КАК Организация,
	|	Себестоимость.КорОрганизация                      КАК КорОрганизация,
	|	Себестоимость.ПериодПродажи                       КАК ПериодПродажи,
	|	ЕСТЬNULL(СторноОтчетыКомиссионера.Период,
	|		НАЧАЛОПЕРИОДА(Себестоимость.ПериодПродажи, МЕСЯЦ)) КАК ПериодРеализации,
	|	Себестоимость.АналитикаРасходов                   КАК АналитикаРасходов,
	|	Себестоимость.СтатьяРасходовСписания              КАК СтатьяРасходовСписания,
	|	Себестоимость.СтатьяДоходов                       КАК СтатьяДоходов,
	|	Себестоимость.АналитикаДоходов                    КАК АналитикаДоходов,
	|	Себестоимость.ГруппаПродукции                     КАК ГруппаПродукции,
	|	Себестоимость.Регистратор                         КАК ДокументДвижения,
	|	Себестоимость.ИдентификаторСтроки                 КАК ИдентификаторСтроки,
	|	Себестоимость.КодСтроки                 		  КАК КодСтроки,
	|	Себестоимость.КорПартия                 		  КАК КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий             КАК КорАналитикаУчетаПартий,
	|	Себестоимость.КорАналитикаФинансовогоУчета        КАК КорАналитикаФинансовогоУчета,
	|	Себестоимость.КорВидДеятельностиНДС               КАК КорВидДеятельностиНДС,
	|	Себестоимость.НДСРегл                 			  КАК НДСРегл,
	|	Себестоимость.НДСУпр                 			  КАК НДСУпр,
	|	Себестоимость.СтатьяКалькуляции                   КАК СтатьяКалькуляции,
	|	Себестоимость.ТипЗаписи                 		  КАК ТипЗаписи,
	|	Себестоимость.ДокументИсточник                 	  КАК ДокументИсточник,
	|	Возврат.Соглашение КАК Соглашение,
	|	ЕСТЬNULL(Возврат.Менеджер, ВозвратМеждуОрганизациями.Менеджер) КАК Менеджер,
	|	ЕСТЬNULL(Возврат.Склад, ВозвратМеждуОрганизациями.Склад) КАК Склад,
	|	ЕСТЬNULL(Возврат.Договор, ВозвратМеждуОрганизациями.Договор) КАК Договор,
	|	ЕСТЬNULL(ИсточникиГФУ.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУНоменклатуры,
	|	ЕСТЬNULL(ИсточникиГФУ.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУРасчетов,
	|
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И (НЕ &ПартионныйУчетВерсии22 ИЛИ Себестоимость.ПериодПродажи < ДатаПереходаНаПУ22.Значение)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ											  КАК ПоЦенеПродажи,
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И &ПартионныйУчетВерсии22
	|	  И Себестоимость.ПериодПродажи > ДатаПереходаНаПУ22.Значение
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ											  КАК ПоЦенеПродажи22
	|ПОМЕСТИТЬ ВтВозвратыПрошлыхПериодов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Себестоимость.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратМеждуОрганизациями
	|		ПО ВозвратМеждуОрганизациями.Ссылка = Себестоимость.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ СторноОтчетыКомиссионера КАК СторноОтчетыКомиссионера
	|		ПО СторноОтчетыКомиссионера.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|		И СторноОтчетыКомиссионера.РазделУчета = Себестоимость.РазделУчета
	|		И СторноОтчетыКомиссионера.ВидЗапасов = Себестоимость.ВидЗапасов
	|		И СторноОтчетыКомиссионера.Организация = Себестоимость.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ Константа.ДатаПереходаНаПартионныйУчетВерсии22 КАК ДатаПереходаНаПУ22
	|		ПО ИСТИНА
	|	ЛЕВОЕ СОЕДИНЕНИЕ ИсточникиГФУ КАК ИсточникиГФУ
	|		ПО ИсточникиГФУ.Регистратор = Себестоимость.Регистратор
	|		И ИсточникиГФУ.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|		И ИсточникиГФУ.ВидЗапасов = Себестоимость.ВидЗапасов
	|		И ИсточникиГФУ.ЗаказКлиента = Себестоимость.ЗаказКлиента
	|ГДЕ
	|	(Себестоимость.СлужебноеВидДвиженияПриход
	|		И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов))
	|	ИЛИ (Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		И НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL)
	|	И НЕ Себестоимость.РасчетСебестоимости
	|	
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	ВЫБОР КОГДА Себестоимость.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.ВидЗапасов.ТипЗапасов,
	|	Себестоимость.Подразделение,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	ВЫБОР КОГДА Себестоимость.КорАналитикаУчетаНоменклатуры <> Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		ТОГДА Себестоимость.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ Себестоимость.АналитикаУчетаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА Себестоимость.КорВидЗапасов <> Значение(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорВидЗапасов
	|		ИНАЧЕ
	|			Себестоимость.ВидЗапасов
	|	КОНЕЦ,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам,
	|	Себестоимость.ХозяйственнаяОперация,
	|	Себестоимость.КорРазделУчета,
	|	Себестоимость.КорВидЗапасов,
	|	Себестоимость.ПериодПродажи,
	|	ЕСТЬNULL(СторноОтчетыКомиссионера.Период,
	|		НАЧАЛОПЕРИОДА(Себестоимость.ПериодПродажи, МЕСЯЦ)),
	|	Себестоимость.Организация,
	|	Себестоимость.КорОрганизация,
	|	Себестоимость.АналитикаРасходов,
	|	Себестоимость.СтатьяРасходовСписания,
	|	Себестоимость.СтатьяДоходов,
	|	Себестоимость.АналитикаДоходов,
	|	Себестоимость.ГруппаПродукции,
	|	Себестоимость.Регистратор,
	|	Себестоимость.ИдентификаторСтроки,
	|	Себестоимость.КодСтроки,
	|	Себестоимость.КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий,
	|	Себестоимость.КорАналитикаФинансовогоУчета,
	|	Себестоимость.КорВидДеятельностиНДС,
	|	Себестоимость.НДСРегл,
	|	Себестоимость.НДСУпр,
	|	Себестоимость.СтатьяКалькуляции,
	|	Себестоимость.ТипЗаписи,
	|	Себестоимость.ДокументИсточник,
	|	Возврат.Соглашение,
	|	ЕСТЬNULL(Возврат.Менеджер, ВозвратМеждуОрганизациями.Менеджер),
	|	ЕСТЬNULL(Возврат.Склад, ВозвратМеждуОрганизациями.Склад),
	|	ЕСТЬNULL(Возврат.Договор, ВозвратМеждуОрганизациями.Договор),
	|	ЕСТЬNULL(ИсточникиГФУ.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(ИсточникиГФУ.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО),
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И (НЕ &ПартионныйУчетВерсии22 ИЛИ Себестоимость.ПериодПродажи < ДатаПереходаНаПУ22.Значение)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И &ПартионныйУчетВерсии22
	|	  И Себестоимость.ПериодПродажи > ДатаПереходаНаПУ22.Значение
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВозвратов.Период                        КАК Период,
	|	ТаблицаВозвратов.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаВозвратов.Организация                   КАК Организация,
	|	ТаблицаВозвратов.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаВозвратов.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаВозвратов.РазделУчета                   КАК РазделУчета,
	|	ТаблицаВозвратов.ВидЗапасов                    КАК ВидЗапасов,
	|	ТаблицаВозвратов.Партия                        КАК Партия,
	|	ТаблицаВозвратов.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаВозвратов.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаВозвратов.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ЕСТЬNULL(ТаблицаВозвратов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаВозвратов.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаВозвратов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ТаблицаВозвратов.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаВозвратов.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ТаблицаВозвратов.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаВозвратов.ЗаказКлиента                  КАК ЗаказКлиента,
	|	ТаблицаВозвратов.Подразделение                 КАК Подразделение,
	|	ТаблицаВозвратов.ПериодРеализации              КАК ПериодРеализации,
	|	ТаблицаВозвратов.АналитикаДоходов              КАК АналитикаДоходов,
	|	ТаблицаВозвратов.СтатьяДоходов                 КАК СтатьяДоходов,
	|	ТаблицаВозвратов.АналитикаРасходов             КАК АналитикаРасходов,
	|	ТаблицаВозвратов.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|	ТаблицаВозвратов.ГруппаПродукции               КАК ГруппаПродукции,
	|	Назначения.НаправлениеДеятельности             КАК НаправлениеДеятельности,
	|	Назначения.НаправлениеДеятельности             КАК КорНаправлениеДеятельности,
	|	ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовУпр, НЕОПРЕДЕЛЕНО) КАК ВариантРаспределенияРасходовУпр,
	|	ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(СтатьиРасходов.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяАктивовПассивов,
	|	ТаблицаВозвратов.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаВозвратов.КодСтроки                 	   КАК КодСтроки,
	|	ТаблицаВозвратов.Менеджер                      КАК Менеджер,
	|	ТаблицаВозвратов.Склад                         КАК Склад,
	|	ТаблицаВозвратов.Соглашение                    КАК Соглашение,
	|	ТаблицаВозвратов.Договор                       КАК Договор,
	|	ТаблицаВозвратов.ИсточникГФУНоменклатуры       КАК ИсточникГФУНоменклатуры,
	|	ТаблицаВозвратов.ИсточникГФУРасчетов           КАК ИсточникГФУРасчетов,
	|	ТаблицаВозвратов.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаВозвратов.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаВозвратов.КорПартия                     КАК КорПартия,
	|	ТаблицаВозвратов.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаВозвратов.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаВозвратов.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаВозвратов.НДСРегл                       КАК НДСРегл,
	|	ТаблицаВозвратов.НДСУпр                        КАК НДСУпр,
	|	ТаблицаВозвратов.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	ТаблицаВозвратов.ТипЗаписи                     КАК ТипЗаписи,
	|	ТаблицаВозвратов.ДокументИсточник              КАК ДокументИсточник,
	|	ТаблицаВозвратов.Количество                    КАК Количество,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.Стоимость / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.Стоимость / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.Стоимость
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.Стоимость КАК ЧИСЛО(31,2)) 							КАК Стоимость,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьБезНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьБезНДС КАК ЧИСЛО(31,2)) 					КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьЗабалансовая / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьЗабалансовая / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансовая
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьЗабалансовая КАК ЧИСЛО(31,2)) 				КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходы / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходы + ЕСТЬNULL(СуммыДопРасходов.ДопРасходы, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходы
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходы КАК ЧИСЛО(31,2)) 						КАК ДопРасходы,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходыБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходыБезНДС + ЕСТЬNULL(СуммыДопРасходов.ДопРасходыБезНДС, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходыБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходыБезНДС КАК ЧИСЛО(31,2)) 					КАК ДопРасходыБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.Трудозатраты / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.Трудозатраты / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.Трудозатраты
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.Трудозатраты КАК ЧИСЛО(31,2)) 						КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеСНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеСНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеСНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПостоянныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеБезНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(31,2)) 		КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеСНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеСНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеСНДС КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПеременныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеБезНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеБезНДС КАК ЧИСЛО(31,2)) 		КАК ПостатейныеПеременныеБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьРегл КАК ЧИСЛО(31,2)) 						КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьЗабалансоваяРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьЗабалансоваяРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьЗабалансоваяРегл КАК ЧИСЛО(31,2)) 			КАК СтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостояннаяРазница / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостояннаяРазница / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостояннаяРазница
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостояннаяРазница КАК ЧИСЛО(31,2)) 					КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ВременнаяРазница / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ВременнаяРазница / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ВременнаяРазница
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ВременнаяРазница КАК ЧИСЛО(31,2)) 					КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходыРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходыРегл + ЕСТЬNULL(СуммыДопРасходов.ДопРасходыРегл, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ДопРасходыРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходыРегл КАК ЧИСЛО(31,2)) 					КАК ДопРасходыРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ТрудозатратыРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ТрудозатратыРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ТрудозатратыРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ТрудозатратыРегл КАК ЧИСЛО(31,2)) 					КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеРегл КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПостоянныеРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеРегл КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПеременныеРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьУпр КАК ЧИСЛО(31,2)) 						КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходыУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходыУпр + ЕСТЬNULL(СуммыДопРасходов.ДопРасходыУпр, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ДопРасходыУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходыУпр КАК ЧИСЛО(31,2)) 						КАК ДопРасходыУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ТрудозатратыУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ТрудозатратыУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ТрудозатратыУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ТрудозатратыУпр КАК ЧИСЛО(31,2)) 					КАК ТрудозатратыУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеУпр КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПостоянныеУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеУпр КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПеременныеУпр
	|ИЗ
	|	ВтВозвратыПрошлыхПериодов КАК ТаблицаВозвратов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыРеализацийПрошлыхПериодов КАК СтоимостиПродаж
	|		ПО ТаблицаВозвратов.ПоЦенеПродажи
	|			И ТаблицаВозвратов.ДокументИсточник          	= СтоимостиПродаж.Ссылка
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостиПродаж.АналитикаУчетаНоменклатуры
	|			И ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостиПродаж.ВидЗапасов
	|			И ТаблицаВозвратов.Организация               	= СтоимостиПродаж.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостиПродаж.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыРеализацийПрошлыхПериодов КАК СтоимостиПродаж22
	|		ПО ТаблицаВозвратов.ПоЦенеПродажи22
	|			И ТаблицаВозвратов.ДокументИсточник          	= СтоимостиПродаж22.Ссылка
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостиПродаж22.АналитикаУчетаНоменклатуры
	|			И ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостиПродаж22.ВидЗапасов
	|			И ТаблицаВозвратов.Организация               	= СтоимостиПродаж22.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостиПродаж22.РазделУчета
	|			И ТаблицаВозвратов.Партия               		= СтоимостиПродаж22.Партия
	|			И ТаблицаВозвратов.АналитикаУчетаПартий         = СтоимостиПродаж22.АналитикаУчетаПартий
	|			И ТаблицаВозвратов.АналитикаФинансовогоУчета    = СтоимостиПродаж22.АналитикаФинансовогоУчета
	|			И ТаблицаВозвратов.ВидДеятельностиНДС           = СтоимостиПродаж22.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыДопРасходовПрошлыхПериодов КАК СуммыДопРасходов
	|		ПО ТаблицаВозвратов.ДокументИсточник          		= СуммыДопРасходов.Ссылка
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СуммыДопРасходов.АналитикаУчетаНоменклатуры
	|			И ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СуммыДопРасходов.ВидЗапасов
	|			И ТаблицаВозвратов.Организация               	= СуммыДопРасходов.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СуммыДопРасходов.РазделУчета
	|			И ТаблицаВозвратов.Партия               		= СуммыДопРасходов.Партия
	|			И ТаблицаВозвратов.АналитикаУчетаПартий         = СуммыДопРасходов.АналитикаУчетаПартий
	|			И ТаблицаВозвратов.АналитикаФинансовогоУчета    = СуммыДопРасходов.АналитикаФинансовогоУчета
	|			И ТаблицаВозвратов.ВидДеятельностиНДС           = СуммыДопРасходов.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК СтоимостьТоваров
	|		ПО ТаблицаВозвратов.ПериодРеализации          		= СтоимостьТоваров.Период
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостьТоваров.АналитикаУчетаНоменклатуры
	|			И ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостьТоваров.ВидЗапасов
	|			И ТаблицаВозвратов.Организация               	= СтоимостьТоваров.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостьТоваров.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО ТаблицаВозвратов.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТаблицаВозвратов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Аналитика.Назначение
	|
	|ГДЕ
	|	(ТаблицаВозвратов.ПоЦенеПродажи И СтоимостиПродаж.Ссылка ЕСТЬ НЕ NULL)
	|		ИЛИ (ТаблицаВозвратов.ПоЦенеПродажи22 И СтоимостиПродаж22.Ссылка ЕСТЬ НЕ NULL)
	|		ИЛИ (НЕ ТаблицаВозвратов.ПоЦенеПродажи И СтоимостьТоваров.Период ЕСТЬ НЕ NULL)
	|		ИЛИ (НЕ ТаблицаВозвратов.ПоЦенеПродажи22 И СтоимостьТоваров.Период ЕСТЬ НЕ NULL)
	|";
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	// Подготовим таблицу значений для переноса во временную таблицу ВТВозвраты
	//  - в случае предварительного расчета движения с/с не пишутся в регистр - сохраняются только в этой ВТ
	//  - при окончательном расчете движения будут в регистре, а эта ВТ будет пустой
	ОписаниеРегистраСебестоимость = ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя];
	
	ПоляТаблицыВозвратов =
		"ВидДвижения, СлужебноеВидДвиженияПриход, Организация, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов,
		|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, "
		+ СтрЗаменить(ОписаниеРегистраСебестоимость.РесурсыРегистра, "%1", "");
	
	СтруктураРесурсов = Новый Структура(СтрЗаменить(ОписаниеРегистраСебестоимость.РесурсыРегистра, "%1", ""));
	
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВТВозвраты");
	
	ТаблицаВозвратов = ОписаниеРегистраСебестоимость.Таблица.СкопироватьКолонки(ПоляТаблицыВозвратов);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ВыручкаИСебестоимостьПродаж
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда

		// Корректировка стоимости.
		Пока Выборка.Следующий() Цикл
			
			// Накопим новые движения себестоимости в таблице значений
			СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, Выборка, Выборка.ВидДвижения);

			Если Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы Тогда
				
				СформироватьДвиженияВыручкаИСебестоимостьПродажВозврат(ПараметрыРасчета, Выборка);
				
			КонецЕсли;
			
			СуммаСНДС   = Выборка.Стоимость + Выборка.ДопРасходы + Выборка.Трудозатраты + Выборка.ПостатейныеПостоянныеСНДС + Выборка.ПостатейныеПеременныеСНДС;
			СуммаБезНДС = Выборка.СтоимостьБезНДС + Выборка.ДопРасходыБезНДС + Выборка.Трудозатраты + Выборка.ПостатейныеПостоянныеБезНДС + Выборка.ПостатейныеПеременныеБезНДС;
			СуммаРегл   = Выборка.СтоимостьРегл + Выборка.ДопРасходыРегл + Выборка.ТрудозатратыРегл + Выборка.ПостатейныеПостоянныеРегл + Выборка.ПостатейныеПеременныеРегл;
			СуммаУпр    = Выборка.СтоимостьУпр + Выборка.ДопРасходыУпр + Выборка.ТрудозатратыУпр + Выборка.ПостатейныеПостоянныеУпр + Выборка.ПостатейныеПеременныеУпр;
			
			// Формирование прочих доходов/расходов при возврате тары от клиента
			Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
				
				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
				 ИЛИ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов
				 		И СуммаСНДС < 0) Тогда 

					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						Выборка,
						СуммаСНДС,
						СуммаБезНДС,
						СуммаРегл,
						СуммаУпр,
						Выборка.ПостояннаяРазница,
						Выборка.ВременнаяРазница);

				ИначеЕсли Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов
				 И СуммаСНДС > 0 Тогда

					СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						Выборка,
						СуммаСНДС,
						СуммаРегл,
						СуммаУпр);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
			 И Выборка.Количество < 0 Тогда
				
				СтрокаВозврата = ТаблицаВозвратов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, Выборка);
				
				СтрокаВозврата.СлужебноеВидДвиженияПриход = Истина;
				
				Для Каждого КлючИЗначение Из СтруктураРесурсов Цикл
					СтрокаВозврата[КлючИЗначение.Ключ] = - Выборка[КлючИЗначение.Ключ];
				КонецЦикла;
				
			КонецЕсли;
			
			// Корректировка движений по оборотным регистрам управленческого учета.
			СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, Выборка);
			
		КонецЦикла;
		
	Иначе // предварительный расчет
		
		// Соберем движения себестоимости в таблице значений, подобно СформироватьДвиженияСебестоимостьТоваров()
		Пока Выборка.Следующий() Цикл
			НовСтр = ТаблицаВозвратов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;
		
		ТаблицаВозвратов.ЗаполнитьЗначения(Истина, "СлужебноеВидДвиженияПриход");
		ТаблицаВозвратов.ЗаполнитьЗначения(0,	   "Количество");
		
		Если ПараметрыРасчета.РегламентноеЗадание Тогда
			
			// Считаем по средней, без учета партий
			ТаблицаВозвратов.ЗаполнитьЗначения(Неопределено,
				"Партия,  АналитикаФинансовогоУчета, АналитикаУчетаПартий, ВидДеятельностиНДС");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Сохраним таблицу возвратов в общем менеджере временных таблиц
	УниверсальныеМеханизмыПартийИСебестоимости.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		ПараметрыРасчета,
		"ВТВозвраты",
		ТаблицаВозвратов,
		ПоляТаблицыВозвратов);
	
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтРеализацииПрошлыхПериодов, ВтСуммыРеализацийПрошлыхПериодов, ВтСуммыДопРасходовПрошлыхПериодов, ВтВозвратыПрошлыхПериодов");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


// Этап 3.5
// Формирует временную таблицу ВтПередачиТоваров
//
Процедура СформироватьТаблицуПередачМеждуОрганизациями(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьТаблицуПередачМеждуОрганизациями");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроданныеТовары.ОрганизацияВладелец            КАК ОрганизацияПродавец,
	|	ПроданныеТовары.ВидЗапасовПродавца.Организация КАК ОрганизацияПолучатель,
	|	ПроданныеТовары.АналитикаУчетаНоменклатуры     КАК АналитикаУчетаНоменклатуры,
	|	СУММА(ПроданныеТовары.КоличествоОстаток)       КАК Количество,
	|
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца.ВидЗапасовВладельца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасовПродавца,
	|
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасовПолучателя
	|
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(&ГраницаКонецПериода,
	|		&ПредварительныйРасчет
	|		И ОрганизацияВладелец В (&МассивОрганизаций)
	|		И ВидЗапасовПродавца.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	) КАК ПроданныеТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроданныеТовары.ОрганизацияВладелец,
	|	ПроданныеТовары.ВидЗапасовПродавца.Организация,
	|	ПроданныеТовары.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца.ВидЗапасовВладельца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Резервы.Организация                            КАК ОрганизацияПродавец,
	|	Резервы.КорОрганизация                         КАК ОрганизацияПолучатель,
	|	Резервы.АналитикаУчетаНоменклатуры             КАК АналитикаУчетаНоменклатуры,
	|	СУММА(Резервы.Количество)                      КАК Количество,
	|
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Резервы.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасовПродавца,
	|
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Резервы.КорВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасовПолучателя
	|
	|ИЗ
	|	РегистрНакопления.РезервыТоваровОрганизаций КАК Резервы
	|ГДЕ
	|	Резервы.Период МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И &ПредварительныйРасчет
	|	И Резервы.Организация В (&МассивОрганизаций)
	|	И Резервы.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	Резервы.Организация,
	|	Резервы.КорОрганизация,
	|	Резервы.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Резервы.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Резервы.КорВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                  КАК ВидДвижения,
	|	&КонецПериода                                                           КАК Период,
	|	Товары.АналитикаУчетаНоменклатуры                                       КАК АналитикаУчетаНоменклатуры,
	|	Товары.ОрганизацияПродавец                                              КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|
	|	Товары.ВидЗапасовПродавца   КАК ВидЗапасов,
	|	Товары.ВидЗапасовПолучателя КАК КорВидЗапасов,
	|
	|	Товары.Количество КАК Количество,
	|	0                 КАК Стоимость,
	|	0                 КАК ПостояннаяРазница,
	|	0                 КАК ВременнаяРазница,
	|	0                 КАК СтоимостьБезНДС,
	|	0                 КАК СтоимостьРегл,
	|
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)          КАК КорРазделУчета,
	|	Товары.ОрганизацияПолучатель                                                     КАК КорОрганизация,
	|	Товары.АналитикаУчетаНоменклатуры                                                КАК КорАналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ВтПередачиТоваров
	|ИЗ
	|	Товары КАК Товары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Товары.ОрганизацияПолучатель КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|
	|	Товары.ВидЗапасовПолучателя КАК ВидЗапасов,
	|	Неопределено КАК КорВидЗапасов,
	|
	|	Товары.Количество КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьРегл,
	|
	|	Неопределено КАК КорРазделУчета,
	|	Неопределено КАК КорОрганизация,
	|	Неопределено КАК КорАналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация
	|ИЗ
	|	Товары КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ Товары
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтПередачиТоваров");
	
КонецПроцедуры

// Этап 3.6
Процедура СформироватьУзлыКорректировкиСписанияСтоимости(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьУзлыКорректировкиСписанияСтоимости");
	
	ТекстЗапроса =
	"
	// Данные об аналитике для расчета.
	|//ПредварительныйРасчет ВЫБРАТЬ РАЗЛИЧНЫЕ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ПОМЕСТИТЬ ВтАналитикаНоменклатуры
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ОБЪЕДИНИТЬ
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ВЫБРАТЬ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|//ПредварительныйРасчет		Организация В (&МассивОрганизаций)
	|//ПредварительныйРасчет		И РазделУчета = Значение(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|//ПредварительныйРасчет	) КАК УчетСебестоимости
	|//ПредварительныйРасчет ;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ДД.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета
	|ПОМЕСТИТЬ
	|	ЕстьВозвратныеОтходы
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.Количество < 0
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Активность
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Данные о движении товаров за период.
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация                КАК Организация,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.РазделУчета                КАК РазделУчета,
	|	ВложенныйЗапрос.ВидЗапасов                 КАК ВидЗапасов,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ									   КАК Партия,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ									   КАК АналитикаУчетаПартий,
	|	ВложенныйЗапрос.КодСтрокиПродукция		   КАК КодСтрокиПродукция,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ									   КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ										КАК ВидДеятельностиНДС,
	|	ВложенныйЗапрос.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов				КАК СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов			КАК АналитикаРасходов,
	// Показатели узла 1го графа. Данные для расчета ресурса Стоимость.
	|	СУММА(ВложенныйЗапрос.ВесГраф_1)          	КАК ВесГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ДопРасходыГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ТрудозатратыГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПостоянныеГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПеременныеГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ПостатейныеПеременныеГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьЗабалансовая) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК СтоимостьЗабалансовая,
	|	1                             			   КАК СтоимостьЗнакГраф_1,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))  			   КАК ПостояннаяРазница,
	|	1 										   КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))  			   КАК ВременнаяРазница,
	|	1 										   КАК ВременнаяРазницаЗнак,
	
	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьБезНДС.
	|	СУММА(ВложенныйЗапрос.ВесГраф_2)    		КАК ВесГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК СтоимостьГраф_2,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ДопРасходыГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ДопРасходыГраф_2,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ТрудозатратыГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ТрудозатратыГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПостоянныеГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ПостатейныеПостоянныеГраф_2,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПеременныеГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ПостатейныеПеременныеГраф_2,
	|	1                             			   КАК СтоимостьЗнакГраф_2
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|
	|	(ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		0       									 КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	// Показатели узла 1го графа. Данные для расчета ресурса Стоимость.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ КАК ВесГраф_1,
	
		// Данные о суммах внешних поступлений.
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 	И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 	И УчетСебестоимости.Количество = 0
	|		 	И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|				УчетСебестоимости.Стоимость
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходы
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходы
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Трудозатраты
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ТрудозатратыГраф_1,

	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_1,
	
		// Делится по контурам. Расчет производится по одному из весов.
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
	
	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьБезНДС.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ 							 КАК ВесГраф_2,
	
		// Данные о суммах внешних поступлений.
	|
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьБезНДС
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_2,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходыБезНДС
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_2,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		0       									 КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	// Показатели узла 1го графа. Данные для расчета ресурса Стоимость.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ КАК ВесГраф_1,
	
		// Данные о суммах внешних поступлений.
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 	И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 	И УчетСебестоимости.Количество = 0
	|		 	И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|				УчетСебестоимости.Стоимость
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходы
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходы
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Трудозатраты
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ТрудозатратыГраф_1,

	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_1,
	
		// Делится по контурам. Расчет производится по одному из весов.
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
	
	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьБезНДС.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ 							 КАК ВесГраф_2,
	
		// Данные о суммах внешних поступлений.
	|
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьБезНДС
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_2,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходыБезНДС
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_2,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		ВТПромежуточнаяСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ГДЕ
	|		 УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные о возвратах прошлых периодов.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		0       									 КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
		// Показатели графа 1. Стоимость.
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ВесГраф_1,
			// Данные о суммах внешних поступлений.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходы
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_1,
	
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Трудозатраты
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ТрудозатратыГраф_1,
	
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_1,
	
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_1,
	
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
		// Показатели графа 2. СтоимостьБезНДС.	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ВесГраф_2,
	
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_2,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходыБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_2,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_2,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		ВТВозвраты КАК УчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные о передачах между организациям.
	|		УчетСебестоимости.Организация                				КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры 				КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                				КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                		 		КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		0       									 				КАК КодСтрокиПродукция,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
		// Показатели графа 1. Стоимость.
	|		ВЫБОР КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК ВесГраф_1,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК СтоимостьГраф_1,
	|		0                                            				КАК ДопРасходыГраф_1,
	|		0                                            				КАК ТрудозатратыГраф_1,
	|		0                                            				КАК ПостатейныеПостоянныеГраф_1,
	|		0                                            				КАК ПостатейныеПеременныеГраф_1,
	|		0                                            				КАК СтоимостьЗабалансовая,
		// Показатели графа 2. СтоимостьБезНДС.	
	|		ВЫБОР КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК ВесГраф_2,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК СтоимостьГраф_2,
	|		0                                            				КАК ДопРасходыГраф_2,
	|		0                                            				КАК ПостатейныеПостоянныеГраф_2,
	|		0                                            				КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		ВтПередачиТоваров КАК УчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.АналитикаУчетаНоменклатуры 							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета                							КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		0       									 				КАК КодСтрокиПродукция,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
		// Показатели графа 1. Стоимость.
	|		0                                  							КАК ВесГраф_1,
	|		0                                  							КАК СтоимостьГраф_1,
	|		Таблица.ДопРасходы           								КАК ДопРасходыГраф_1,
	|		0                                  							КАК ТрудозатратыГраф_1,
	|		0                                  							КАК ПостатейныеПостоянныеГраф_1,
	|		0                                            				КАК ПостатейныеПеременныеГраф_1,
	|		0                                  							КАК СтоимостьЗабалансовая,
		// Показатели графа 2. СтоимостьБезНДС.
	|		0                                  							КАК ВесГраф_2,
	|		0                                  							КАК СтоимостьГраф_2,
	|		Таблица.ДопРасходыБезНДС     								КАК ДопРасходыГраф_2,
	|		0                                  							КАК ПостатейныеПостоянныеГраф_2,
	|		0                                            				КАК ПостатейныеПеременныеГраф_2
	|	ИЗ 
	|		ВТДопРасходов КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам на начало расчетного периода.
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                   КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                   КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                    КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     	КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       	КАК АналитикаУчетаПартий,
	|		0       									 	КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  	КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         	КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
		// Показатели графа 1. Стоимость.
	|		УчетСебестоимости.КоличествоОстаток             КАК ВесГраф_1,
	|		УчетСебестоимости.СтоимостьОстаток              КАК СтоимостьГраф_1,
	|		УчетСебестоимости.ДопРасходыОстаток       		КАК ДопРасходыГраф_1,
	|		УчетСебестоимости.ТрудозатратыОстаток			КАК ТрудозатратыГраф_1,
	|		УчетСебестоимости.ПостатейныеПостоянныеСНДСОстаток		КАК ПостатейныеПостоянныеГраф_1,
	|		УчетСебестоимости.ПостатейныеПеременныеСНДСОстаток		КАК ПостатейныеПеременныеГраф_1,
	|		УчетСебестоимости.СтоимостьЗабалансоваяОстаток  КАК СтоимостьЗабалансовая,
		// Показатели графа 2. СтоимостьБезНДС.
	|		УчетСебестоимости.КоличествоОстаток             КАК ВесГраф_2,
	|		УчетСебестоимости.СтоимостьБезНДСОстаток        КАК СтоимостьГраф_2,
	|		УчетСебестоимости.ДопРасходыБезНДСОстаток 		КАК ДопРасходыГраф_2,
	|		УчетСебестоимости.ПостатейныеПостоянныеБезНДСОстаток	КАК ПостатейныеПостоянныеГраф_2,
	|		УчетСебестоимости.ПостатейныеПеременныеБезНДСОстаток	КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|			//ПредварительныйРасчет И (АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов)
	|			//ПредварительныйРасчет В
	|			//ПредварительныйРасчет (ВЫБРАТЬ
	|			//ПредварительныйРасчет 	АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов
	|			//ПредварительныйРасчет	ИЗ ВтАналитикаНоменклатуры)
	|		) КАК УчетСебестоимости
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.РазделУчета,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.Организация,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ,
	|	ВложенныйЗапрос.КодСтрокиПродукция,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ
	|";
	
	ТекстЗапроса = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПредварительныйРасчет", "");
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтУзлыКорректировки");
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет
	 И ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОВзвешеннаяОценка Тогда
		ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета, Запрос); // корректировка ВтУзлыКорректировки
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтАналитикаНоменклатуры");
	КонецЕсли;
	
	ПараметрыНумерации = УниверсальныеМеханизмыПартийИСебестоимости.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатуры", // разделитель
		, // без группировки
		"АналитикаУчетаНоменклатуры,
			|ВидЗапасов, Организация, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС", // порядок
		"НомерУзла", // поле номера
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, НомерУзла"); // индекс
	
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ВтУзлыКорректировки");
	
	ПараметрыРасчета.КоличествоУзлов =
		УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");

	ПодготовитьДанныеДляРаспределенияРезервов(ПараметрыРасчета, Ложь);
	
КонецПроцедуры

// Этап 3.7, 3.11
Процедура РассчитатьСтоимость(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РассчитатьСтоимость" + ?(РасчетСтоимостиРегл, "(Регл)", ""));
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = ?(РасчетСтоимостиРегл,
		ТекстЗапросаДвиженияСтоимостиРегл(ПараметрыРасчета),
		ТекстЗапросаДвиженияСтоимости(ПараметрыРасчета));
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	
	Если ПараметрыРасчета.ВерсияПлатформыНеНиже8_3_14
		И УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ЗначенияТехнологическихПараметров().ИспользоватьПлатформуДляРешенияСЛУ Тогда
		РешитьСЛУПлатформой(ПараметрыРасчета, РасчетСтоимостиРегл);
	Иначе
		РешитьСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл);
	КонецЕсли;
	
КонецПроцедуры

// Этап 3.8, 3.12
Процедура ЗарегистрироватьСтоимость(ПараметрыРасчета, РегистрацияСтоимостиРегл)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимость" + ?(РегистрацияСтоимостиРегл, "(Регл)", ""));
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("РегистрацияСтоимостиРегл", РегистрацияСтоимостиРегл);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ДокументДвижения КАК ДокументДвижения,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.Стоимость КАК Стоимость,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	Т.СтоимостьДопРасходы КАК СтоимостьДопРасходы,
	|	Т.СтоимостьДопРасходыБезНДС КАК СтоимостьДопРасходыБезНДС,
	|	Т.Трудозатраты КАК Трудозатраты,
	|	Т.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	Т.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	Т.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	Т.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	Т.СтоимостьРегл КАК СтоимостьРегл,
	|	Т.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	|	Т.ДопРасходыРегл КАК ДопРасходыРегл,
	|	Т.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	Т.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	Т.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	Т.СтоимостьУпр КАК СтоимостьУпр,
	|	Т.ДопРасходыУпр КАК ДопРасходыУпр,
	|	Т.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	Т.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	Т.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваровВременная
	|ИЗ
	|	ВТСтоимостьПартийТоваров КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСтоимостьПартийТоваров";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА Т.КоличествоРасход <> 0 ТОГДА Т.КоличествоРасход
	|		КОГДА &ПредварительныйРасчет ТОГДА Т.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ВТОборотыКоличествоСПартиями
	|ИЗ
	|(ВЫБРАТЬ
	|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
	|	ДанныеПоКоличеству.РазделУчета,
	|	ДанныеПоКоличеству.ВидЗапасов,
	|	ДанныеПоКоличеству.Организация,
	|	ДанныеПоКоличеству.Партия,
	|	ДанныеПоКоличеству.АналитикаУчетаПартий,
	|	ДанныеПоКоличеству.АналитикаФинансовогоУчета,
	|	ДанныеПоКоличеству.ВидДеятельностиНДС,
	|	СУММА(ДанныеПоКоличеству.КоличествоРасход)  КАК КоличествоРасход,
	|	СУММА(ДанныеПоКоличеству.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА Обороты.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И Обороты.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ Обороты.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		Обороты.ВидЗапасов,
	|		Обороты.Организация,
	|		Обороты.Партия,
	|		Обороты.АналитикаУчетаПартий,
	|		Обороты.АналитикаФинансовогоУчета,
	|		Обороты.ВидДеятельностиНДС,
	|		Обороты.Количество 	КАК КоличествоРасход,
	|		0 					КАК КоличествоОстаток
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = Обороты.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Обороты.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = Обороты.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ГДЕ
	|		НЕ Обороты.СлужебноеВидДвиженияПриход
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Остатки.АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА Остатки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И Остатки.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ Остатки.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		Остатки.ВидЗапасов,
	|		Остатки.Организация,
	|		Остатки.Партия,
	|		Остатки.АналитикаУчетаПартий,
	|		Остатки.АналитикаФинансовогоУчета,
	|		Остатки.ВидДеятельностиНДС,
	|		0 					КАК КоличествоРасход,
	|		Остатки.Количество 	КАК КоличествоОстаток
	|	ИЗ
	|		ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = Остатки.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = Остатки.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	) КАК ДанныеПоКоличеству
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
	|	ДанныеПоКоличеству.Организация,
	|	ДанныеПоКоличеству.ВидЗапасов,
	|	ДанныеПоКоличеству.РазделУчета,
	|	ДанныеПоКоличеству.Партия,
	|	ДанныеПоКоличеству.АналитикаУчетаПартий,
	|	ДанныеПоКоличеству.АналитикаФинансовогоУчета,
	|	ДанныеПоКоличеству.ВидДеятельностиНДС
	|) КАК Т
	|
	|ГДЕ
	|	ВЫБОР
	|		КОГДА Т.КоличествоРасход <> 0 ТОГДА Т.КоличествоРасход
	|		КОГДА &ПредварительныйРасчет ТОГДА Т.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ <> 0
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаНоменклатуры,
	|	Обороты.РазделУчета,
	|	Обороты.ВидЗапасов,
	|	Обороты.Организация,
	|	СУММА(Обороты.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТОборотыКоличествоБезПартий
	|ИЗ
	|	ВТОборотыКоличествоСПартиями КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаНоменклатуры,
	|	Обороты.РазделУчета,
	|	Обороты.ВидЗапасов,
	|	Обороты.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Обороты.Количество) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.Организация                КАК Организация,
	|	УзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	УзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	УзлыКорректировки.Партия					 КАК Партия,
	|	УзлыКорректировки.АналитикаУчетаПартий		 КАК АналитикаУчетаПартий,
	|	УзлыКорректировки.АналитикаФинансовогоУчета	 КАК АналитикаФинансовогоУчета,
	|	УзлыКорректировки.ВидДеятельностиНДС		 КАК ВидДеятельностиНДС,
	
	|	СУММА(ТаблицаРешений.СтоимостьГраф_1
	|		* ТаблицаРешений.СтоимостьЗнакГраф_1) 			КАК СтоимостьГраф_1,
	|	СУММА(ТаблицаРешений.ДопРасходыГраф_1)           	КАК ДопРасходыГраф_1,
	|	СУММА(ТаблицаРешений.ТрудозатратыГраф_1)            КАК ТрудозатратыГраф_1,
	|	СУММА(ТаблицаРешений.ПостатейныеПостоянныеГраф_1)   КАК ПостатейныеПостоянныеГраф_1,
	|	СУММА(ТаблицаРешений.ПостатейныеПеременныеГраф_1)	КАК ПостатейныеПеременныеГраф_1,
	
	|	СУММА(ТаблицаРешений.ПостояннаяРазница
	|		* ТаблицаРешений.ПостояннаяРазницаЗнак)         КАК ПостояннаяРазница,
	|	СУММА(ТаблицаРешений.ВременнаяРазница
	|		* ТаблицаРешений.ВременнаяРазницаЗнак)          КАК ВременнаяРазница,
	|	СУММА(ТаблицаРешений.СтоимостьЗабалансовая)         КАК СтоимостьЗабалансовая,

	|	СУММА(ТаблицаРешений.СтоимостьГраф_2
	|		* ТаблицаРешений.СтоимостьЗнакГраф_2)			КАК СтоимостьГраф_2,
	|	СУММА(ТаблицаРешений.ДопРасходыГраф_2)		 		КАК ДопРасходыГраф_2,
	|	СУММА(ТаблицаРешений.ТрудозатратыГраф_2)			КАК ТрудозатратыГраф_2,
	|	СУММА(ТаблицаРешений.ПостатейныеПостоянныеГраф_2)	КАК ПостатейныеПостоянныеГраф_2,
	|	СУММА(ТаблицаРешений.ПостатейныеПеременныеГраф_2)	КАК ПостатейныеПеременныеГраф_2
	|ПОМЕСТИТЬ ВТСтоимостьТоваровБезВидаУчета
	|ИЗ
	|	ВтТаблицаРешений КАК ТаблицаРешений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировки
	|			ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|ГДЕ
	|	(ТаблицаРешений.СтоимостьГраф_1 <> 0
	|		ИЛИ ТаблицаРешений.ДопРасходыГраф_1 <> 0
	|		ИЛИ ТаблицаРешений.ТрудозатратыГраф_1 <> 0
	|		ИЛИ ТаблицаРешений.ПостатейныеПостоянныеГраф_1 <> 0
	|		ИЛИ ТаблицаРешений.ПостатейныеПеременныеГраф_1 <> 0
	|		ИЛИ ТаблицаРешений.ВременнаяРазница <> 0
	|		ИЛИ ТаблицаРешений.ПостояннаяРазница <> 0
	|		ИЛИ ТаблицаРешений.СтоимостьЗабалансовая <> 0
	|		ИЛИ ТаблицаРешений.СтоимостьГраф_2 <> 0
	|		ИЛИ ТаблицаРешений.ДопРасходыГраф_2 <> 0
	|		ИЛИ ТаблицаРешений.ТрудозатратыГраф_2 <> 0
	|		ИЛИ ТаблицаРешений.ПостатейныеПостоянныеГраф_2 <> 0
	|		ИЛИ ТаблицаРешений.ПостатейныеПеременныеГраф_2 <> 0)
	|	И УзлыКорректировки.АналитикаУчетаНоменклатуры ССЫЛКА Справочник.КлючиАналитикиУчетаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.АналитикаУчетаНоменклатуры,
	|	УзлыКорректировки.Организация,
	|	УзлыКорректировки.ВидЗапасов,
	|	УзлыКорректировки.РазделУчета,
	|	УзлыКорректировки.Партия,
	|	УзлыКорректировки.АналитикаУчетаПартий,
	|	УзлыКорректировки.АналитикаФинансовогоУчета,
	|	УзлыКорректировки.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УзлыКорректировки.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка								КАК ДокументДвижения,
	|	&НачалоПериода 														КАК Период,
	|
	|	СтоимостьТоваров.Организация 										КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 						КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 										КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 										КАК РазделУчета,
	|	СтоимостьТоваров.Партия					 	  						КАК Партия,
	|	СтоимостьТоваров.АналитикаУчетаПартий		  						КАК АналитикаУчетаПартий,
	|	СтоимостьТоваров.АналитикаФинансовогоУчета	  						КАК АналитикаФинансовогоУчета,
	|	СтоимостьТоваров.ВидДеятельностиНДС		 	  						КАК ВидДеятельностиНДС,
	|
	// упр.
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьГраф_1
	|	КОНЕЦ 																КАК Стоимость,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьГраф_2
	|	КОНЕЦ 																КАК СтоимостьБезНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ДопРасходыГраф_1
	|	КОНЕЦ 																КАК СтоимостьДопРасходы,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ДопРасходыГраф_2
	|	КОНЕЦ 																КАК СтоимостьДопРасходыБезНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансовая
	|	КОНЕЦ 																КАК СтоимостьЗабалансовая,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ТрудозатратыГраф_1
	|	КОНЕЦ 																КАК Трудозатраты,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеГраф_1
	|	КОНЕЦ 																КАК ПостатейныеПостоянныеСНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеГраф_2
	|	КОНЕЦ 																КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеГраф_1
	|	КОНЕЦ 																КАК ПостатейныеПеременныеСНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеГраф_2
	|	КОНЕЦ 																КАК ПостатейныеПеременныеБезНДС,
	|
	// регл.
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.СтоимостьГраф_1
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК СтоимостьРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.СтоимостьЗабалансовая
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК СтоимостьЗабалансоваяРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ДопРасходыГраф_1
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ДопРасходыРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ТрудозатратыГраф_1
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ТрудозатратыРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ПостатейныеПостоянныеГраф_1
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ПостатейныеПостоянныеРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ПостатейныеПеременныеГраф_1
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ПостатейныеПеременныеРегл,
	|
	// упр.
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.СтоимостьГраф_2
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК СтоимостьУпр,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ДопРасходыГраф_2
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ДопРасходыУпр,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ТрудозатратыГраф_2
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ТрудозатратыУпр,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ПостатейныеПостоянныеГраф_2
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ПостатейныеПостоянныеУпр,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ПостатейныеПеременныеГраф_2
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ПостатейныеПеременныеУпр,
	|
	// разницы
	|	СтоимостьТоваров.ПостояннаяРазница									КАК ПостояннаяРазница,
	|	СтоимостьТоваров.ВременнаяРазница									КАК ВременнаяРазница,
	|
	// количество
	|	ЕСТЬNULL(Обороты.Количество, 0)										КАК Количество
	|
	|ПОМЕСТИТЬ ВТСтоимостьТоваров
	|ИЗ
	|	ВТСтоимостьТоваровБезВидаУчета КАК СтоимостьТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО СтоимостьТоваров.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыКоличествоСПартиями КАК Обороты
	|			ПО СтоимостьТоваров.АналитикаУчетаНоменклатуры  = Обороты.АналитикаУчетаНоменклатуры
	|			И СтоимостьТоваров.РазделУчета 					= Обороты.РазделУчета
	|			И СтоимостьТоваров.ВидЗапасов 					= Обороты.ВидЗапасов
	|			И СтоимостьТоваров.Организация 					= Обороты.Организация
	|			И СтоимостьТоваров.Партия 						= Обороты.Партия
	|			И СтоимостьТоваров.АналитикаУчетаПартий 		= Обороты.АналитикаУчетаПартий
	|			И СтоимостьТоваров.АналитикаФинансовогоУчета 	= Обороты.АналитикаФинансовогоУчета
	|			И СтоимостьТоваров.ВидДеятельностиНДС 			= Обороты.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СтоимостьТоваров.ДокументДвижения									КАК ДокументДвижения,
	|	СтоимостьТоваров.Период 											КАК Период,
	|
	|	СтоимостьТоваров.Организация 										КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 						КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 										КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 										КАК РазделУчета,
	|	СтоимостьТоваров.Партия					 	  						КАК Партия,
	|	СтоимостьТоваров.АналитикаУчетаПартий		  						КАК АналитикаУчетаПартий,
	|	СтоимостьТоваров.АналитикаФинансовогоУчета	  						КАК АналитикаФинансовогоУчета,
	|	СтоимостьТоваров.ВидДеятельностиНДС		 	  						КАК ВидДеятельностиНДС,
	|
	|	СУММА(СтоимостьТоваров.Стоимость)		 	  						КАК Стоимость,
	|	СУММА(СтоимостьТоваров.СтоимостьБезНДС)		 	  					КАК СтоимостьБезНДС,
	|	СУММА(СтоимостьТоваров.СтоимостьЗабалансовая)		 	  			КАК СтоимостьЗабалансовая,
	|	СУММА(СтоимостьТоваров.СтоимостьДопРасходы)		 	  				КАК СтоимостьДопРасходы,
	|	СУММА(СтоимостьТоваров.СтоимостьДопРасходыБезНДС)		 	  		КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(СтоимостьТоваров.Трудозатраты)		 	  					КАК Трудозатраты,
	|	СУММА(СтоимостьТоваров.ПостатейныеПостоянныеСНДС)		 	  		КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(СтоимостьТоваров.ПостатейныеПостоянныеБезНДС)		 	  		КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(СтоимостьТоваров.ПостатейныеПеременныеСНДС)                   КАК ПостатейныеПеременныеСНДС,
	|	СУММА(СтоимостьТоваров.ПостатейныеПеременныеБезНДС)                 КАК ПостатейныеПеременныеБезНДС,
	|
	|	СУММА(СтоимостьТоваров.СтоимостьРегл)		 	  					КАК СтоимостьРегл,
	|	СУММА(СтоимостьТоваров.СтоимостьЗабалансоваяРегл)		 	  		КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(СтоимостьТоваров.ПостояннаяРазница)		 	  				КАК ПостояннаяРазница,
	|	СУММА(СтоимостьТоваров.ВременнаяРазница)		 	  				КАК ВременнаяРазница,
	|	СУММА(СтоимостьТоваров.ДопРасходыРегл)		 	  					КАК ДопРасходыРегл,
	|	СУММА(СтоимостьТоваров.ТрудозатратыРегл)		 	  				КАК ТрудозатратыРегл,
	|	СУММА(СтоимостьТоваров.ПостатейныеПостоянныеРегл) 					КАК ПостатейныеПостоянныеРегл,
	|	СУММА(СтоимостьТоваров.ПостатейныеПеременныеРегл) 					КАК ПостатейныеПеременныеРегл,
	|
	|	СУММА(СтоимостьТоваров.СтоимостьУпр)                         		КАК СтоимостьУпр,
	|	СУММА(СтоимостьТоваров.ДопРасходыУпр)                      			КАК ДопРасходыУпр,
	|	СУММА(СтоимостьТоваров.ТрудозатратыУпр)                         	КАК ТрудозатратыУпр,
	|	СУММА(СтоимостьТоваров.ПостатейныеПостоянныеУпр)                    КАК ПостатейныеПостоянныеУпр,
	|	СУММА(СтоимостьТоваров.ПостатейныеПеременныеУпр)                    КАК ПостатейныеПеременныеУпр
	|
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтоимостьТоваров.ДокументДвижения								КАК ДокументДвижения,
	|		СтоимостьТоваров.Период 										КАК Период,
	|
	|		СтоимостьТоваров.Организация 									КАК Организация,
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 					КАК АналитикаУчетаНоменклатуры,
	|		СтоимостьТоваров.ВидЗапасов 									КАК ВидЗапасов,
	|		СтоимостьТоваров.РазделУчета 									КАК РазделУчета,
	|		СтоимостьТоваров.Партия					 	  					КАК Партия,
	|		СтоимостьТоваров.АналитикаУчетаПартий		  					КАК АналитикаУчетаПартий,
	|		СтоимостьТоваров.АналитикаФинансовогоУчета	  					КАК АналитикаФинансовогоУчета,
	|		СтоимостьТоваров.ВидДеятельностиНДС		 	  					КАК ВидДеятельностиНДС,
	|
	|		СтоимостьТоваров.Стоимость		 	  							КАК Стоимость,
	|		СтоимостьТоваров.СтоимостьБезНДС		 	  					КАК СтоимостьБезНДС,
	|		СтоимостьТоваров.СтоимостьЗабалансовая		 	  				КАК СтоимостьЗабалансовая,
	|		СтоимостьТоваров.СтоимостьДопРасходы		 	  				КАК СтоимостьДопРасходы,
	|		СтоимостьТоваров.СтоимостьДопРасходыБезНДС		 	  			КАК СтоимостьДопРасходыБезНДС,
	|		СтоимостьТоваров.Трудозатраты		 	  						КАК Трудозатраты,
	|		СтоимостьТоваров.ПостатейныеПостоянныеСНДС		 	  			КАК ПостатейныеПостоянныеСНДС,
	|		СтоимостьТоваров.ПостатейныеПостоянныеБезНДС		 	  		КАК ПостатейныеПостоянныеБезНДС,
	|		СтоимостьТоваров.ПостатейныеПеременныеСНДС                   	КАК ПостатейныеПеременныеСНДС,
	|		СтоимостьТоваров.ПостатейныеПеременныеБезНДС                 	КАК ПостатейныеПеременныеБезНДС,
	|
	|		СтоимостьТоваров.СтоимостьРегл		 	  						КАК СтоимостьРегл,
	|		СтоимостьТоваров.СтоимостьЗабалансоваяРегл		 	  			КАК СтоимостьЗабалансоваяРегл,
	|		СтоимостьТоваров.ПостояннаяРазница		 	  					КАК ПостояннаяРазница,
	|		СтоимостьТоваров.ВременнаяРазница		 	  					КАК ВременнаяРазница,
	|		СтоимостьТоваров.ДопРасходыРегл		 	  						КАК ДопРасходыРегл,
	|		СтоимостьТоваров.ТрудозатратыРегл		 	  					КАК ТрудозатратыРегл,
	|		СтоимостьТоваров.ПостатейныеПостоянныеРегл		 	  			КАК ПостатейныеПостоянныеРегл,
	|		СтоимостьТоваров.ПостатейныеПеременныеРегл                   	КАК ПостатейныеПеременныеРегл,
	|
	|		СтоимостьТоваров.СтоимостьУпр                         			КАК СтоимостьУпр,
	|		СтоимостьТоваров.ДопРасходыУпр		 	  						КАК ДопРасходыУпр,
	|		СтоимостьТоваров.ТрудозатратыУпр                         		КАК ТрудозатратыУпр,
	|		СтоимостьТоваров.ПостатейныеПостоянныеУпр                    	КАК ПостатейныеПостоянныеУпр,
	|		СтоимостьТоваров.ПостатейныеПеременныеУпр                    	КАК ПостатейныеПеременныеУпр
	|	ИЗ
	|		ВТСтоимостьПартийТоваровВременная КАК СтоимостьТоваров
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СтоимостьТоваров.ДокументДвижения								КАК ДокументДвижения,
	|		СтоимостьТоваров.Период 										КАК Период,
	|
	|		СтоимостьТоваров.Организация 									КАК Организация,
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 					КАК АналитикаУчетаНоменклатуры,
	|		СтоимостьТоваров.ВидЗапасов 									КАК ВидЗапасов,
	|		СтоимостьТоваров.РазделУчета 									КАК РазделУчета,
	|		СтоимостьТоваров.Партия					 	  					КАК Партия,
	|		СтоимостьТоваров.АналитикаУчетаПартий		  					КАК АналитикаУчетаПартий,
	|		СтоимостьТоваров.АналитикаФинансовогоУчета	  					КАК АналитикаФинансовогоУчета,
	|		СтоимостьТоваров.ВидДеятельностиНДС		 	  					КАК ВидДеятельностиНДС,
	|
	|		СтоимостьТоваров.Стоимость		 	  							КАК Стоимость,
	|		СтоимостьТоваров.СтоимостьБезНДС		 	  					КАК СтоимостьБезНДС,
	|		СтоимостьТоваров.СтоимостьЗабалансовая		 	  				КАК СтоимостьЗабалансовая,
	|		СтоимостьТоваров.СтоимостьДопРасходы		 	  				КАК СтоимостьДопРасходы,
	|		СтоимостьТоваров.СтоимостьДопРасходыБезНДС		 	  			КАК СтоимостьДопРасходыБезНДС,
	|		СтоимостьТоваров.Трудозатраты		 	  						КАК Трудозатраты,
	|		СтоимостьТоваров.ПостатейныеПостоянныеСНДС		 	  			КАК ПостатейныеПостоянныеСНДС,
	|		СтоимостьТоваров.ПостатейныеПостоянныеБезНДС		 	  		КАК ПостатейныеПостоянныеБезНДС,
	|		СтоимостьТоваров.ПостатейныеПеременныеСНДС                   	КАК ПостатейныеПеременныеСНДС,
	|		СтоимостьТоваров.ПостатейныеПеременныеБезНДС                 	КАК ПостатейныеПеременныеБезНДС,
	|
	|		СтоимостьТоваров.СтоимостьРегл		 	  						КАК СтоимостьРегл,
	|		СтоимостьТоваров.СтоимостьЗабалансоваяРегл		 	  			КАК СтоимостьЗабалансоваяРегл,
	|		СтоимостьТоваров.ПостояннаяРазница		 	  					КАК ПостояннаяРазница,
	|		СтоимостьТоваров.ВременнаяРазница		 	  					КАК ВременнаяРазница,
	|		СтоимостьТоваров.ДопРасходыРегл		 	  						КАК ДопРасходыРегл,
	|		СтоимостьТоваров.ТрудозатратыРегл		 	  					КАК ТрудозатратыРегл,
	|		СтоимостьТоваров.ПостатейныеПостоянныеРегл		 	  			КАК ПостатейныеПостоянныеРегл,
	|		СтоимостьТоваров.ПостатейныеПеременныеРегл                   	КАК ПостатейныеПеременныеРегл,
	|
	|		СтоимостьТоваров.СтоимостьУпр                         			КАК СтоимостьУпр,
	|		СтоимостьТоваров.ДопРасходыУпр		 	  						КАК ДопРасходыУпр,
	|		СтоимостьТоваров.ТрудозатратыУпр                         		КАК ТрудозатратыУпр,
	|		СтоимостьТоваров.ПостатейныеПостоянныеУпр                    	КАК ПостатейныеПостоянныеУпр,
	|		СтоимостьТоваров.ПостатейныеПеременныеУпр                    	КАК ПостатейныеПеременныеУпр
	|	ИЗ
	|		ВТСтоимостьТоваров КАК СтоимостьТоваров
	|	) КАК СтоимостьТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьТоваров.ДокументДвижения,
	|	СтоимостьТоваров.Период,
	|	СтоимостьТоваров.Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета,
	|	СтоимостьТоваров.Партия,
	|	СтоимостьТоваров.АналитикаУчетаПартий,
	|	СтоимостьТоваров.АналитикаФинансовогоУчета,
	|	СтоимостьТоваров.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СтоимостьТоваров.ДокументДвижения														КАК ДокументДвижения,
	|	СтоимостьТоваров.Период 																КАК Период,
	|
	|	СтоимостьТоваров.Организация 															КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 											КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 															КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 															КАК РазделУчета,
	|
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.Стоимость * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК Стоимость,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансовая * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьЗабалансовая,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходы * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьДопРасходы,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходыБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.Трудозатраты * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК Трудозатраты,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеСНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеСНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеСНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансоваяРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостояннаяРазница * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ВременнаяРазница * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ВременнаяРазница,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ДопРасходыРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ДопРасходыРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ТрудозатратыРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ТрудозатратыРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьУпр * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьУпр,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ДопРасходыУпр * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ДопРасходыУпр,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ТрудозатратыУпр * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ТрудозатратыУпр,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеУпр * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеУпр,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеУпр * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеУпр
	|ИЗ
	|	ВТСтоимостьТоваров КАК СтоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОборотыКоличествоБезПартий КАК Обороты
	|			ПО СтоимостьТоваров.АналитикаУчетаНоменклатуры  = Обороты.АналитикаУчетаНоменклатуры
	|			И СтоимостьТоваров.РазделУчета 					= Обороты.РазделУчета
	|			И СтоимостьТоваров.ВидЗапасов 					= Обороты.ВидЗапасов
	|			И СтоимостьТоваров.Организация 					= Обороты.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьТоваров.ДокументДвижения,
	|	СтоимостьТоваров.Период,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.РазделУчета,
	|	СтоимостьТоваров.ВидЗапасов,
	|	СтоимостьТоваров.Организация,
	|	Обороты.Количество
	|";
	
	// Сформируем движения по регистру сведений СтоимостьТоваров (без партий)
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыСведений.СтоимостьТоваров.Имя,
		Запрос);
	
	// Завершим расчет
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТОборотыКоличествоСПартиями, ВТОстаткиСтоимости, ВТСтоимостьТоваровБезВидаУчета,
		|ВТОборотыКоличествоБезПартий, ВТСтоимостьТоваров, ВТСтоимостьПартийТоваровВременная");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


// Этап 3.10
// Формирует временную таблицу узлов корректировки - ВтУзлыКорректировки.
//
Процедура СформироватьУзлыКорректировкиСписанияСтоимостиРегл(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьУзлыКорректировкиСписанияСтоимостиРегл");
	
	ТекстЗапроса =
	"
	// Данные об аналитике для расчета.
	|//ПредварительныйРасчет ВЫБРАТЬ РАЗЛИЧНЫЕ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ПОМЕСТИТЬ ВтАналитикаНоменклатуры
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ОБЪЕДИНИТЬ
	|//ПредварительныйРасчет 
	|//ПредварительныйРасчет ВЫБРАТЬ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|//ПредварительныйРасчет		РазделУчета = Значение(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|//ПредварительныйРасчет		И Организация В (&МассивОрганизаций)
	|//ПредварительныйРасчет	) КАК УчетСебестоимости
	|//ПредварительныйРасчет ;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// Данные о движении товаров за период.
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация                КАК Организация,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.РазделУчета                КАК РазделУчета,
	|	ВложенныйЗапрос.ВидЗапасов                 КАК ВидЗапасов,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ									   КАК Партия,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ									   КАК АналитикаУчетаПартий,
	|	ВложенныйЗапрос.КодСтрокиПродукция         КАК КодСтрокиПродукция,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ									   КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ									   КАК ВидДеятельностиНДС,
	|	ВложенныйЗапрос.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов             КАК СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов          КАК АналитикаРасходов,
	|	СУММА(ВложенныйЗапрос.ВесГраф_1)		   КАК ВесГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СтоимостьГраф_1) < 0 И СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			- ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ДопРасходыГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ТрудозатратыГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПостоянныеГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПеременныеГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ПостатейныеПеременныеГраф_1,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.СтоимостьГраф_1) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК СтоимостьЗнакГраф_1,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьЗабалансовая) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ПостояннаяРазница) < 0 И СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				-ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостояннаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостояннаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  КАК ПостояннаяРазница,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.ПостояннаяРазница) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК ПостояннаяРазницаЗнак,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВременнаяРазница) < 0 И СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				-ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  КАК ВременнаяРазница,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.ВременнаяРазница) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК ВременнаяРазницаЗнак,
	
	|	СУММА(ВложенныйЗапрос.ВесГраф_2) КАК ВесГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СтоимостьГраф_2) < 0 И СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|			- ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|		КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ДопРасходыГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ДопРасходыГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ТрудозатратыГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ТрудозатратыГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПостоянныеГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеПеременныеГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ПостатейныеПеременныеГраф_2,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.СтоимостьГраф_2) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК СтоимостьЗнакГраф_2
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|
	|	(ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|				ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		0										     КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	// Показатели узла 1го графа. Данные для расчета ресурса СтоимостьРегл.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_1,
	|		
	|		ВЫБОР КОГДА НЕ &УчитыватьКорректировкиСтоимости
	|		  И УчетСебестоимости.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости), ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
	|			ТОГДА 0
	|		КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.РасчетСебестоимости
	|				ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.Количество <> 0 ИЛИ &СредняяЗаМесяц ИЛИ &ПартионныйУчетВерсии22)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СтоимостьГраф_1,
	|		
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход И &ПартионныйУчетВерсии22
	|				ТОГДА УчетСебестоимости.ДопРасходыРегл
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|				И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				И УчетСебестоимости.Количество = 0
	|				И НЕ &СредняяЗаМесяц
	|				И НЕ УчетСебестоимости.РасчетСебестоимости
	|			ТОГДА
	|				УчетСебестоимости.СтоимостьРегл
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ДопРасходыГраф_1,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ТрудозатратыРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ТрудозатратыГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостатейныеПостоянныеГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостатейныеПеременныеГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СтоимостьЗабалансовая,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостояннаяРазница,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВременнаяРазница,

	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьУпр.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_2,
	
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И УчетСебестоимости.РасчетСебестоимости
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.Количество <> 0 ИЛИ &СредняяЗаМесяц ИЛИ &ПартионныйУчетВерсии22)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СтоимостьГраф_2,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход И &ПартионныйУчетВерсии22
	|				ТОГДА УчетСебестоимости.ДопРасходыУпр
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|				И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				И УчетСебестоимости.Количество = 0
	|				И НЕ &СредняяЗаМесяц
	|				И НЕ УчетСебестоимости.РасчетСебестоимости
	|			ТОГДА
	|				УчетСебестоимости.СтоимостьУпр
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ДопРасходыГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ТрудозатратыУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ТрудозатратыГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|		//ПредварительныйРасчет		ГДЕ
	|		//ПредварительныйРасчет    		(УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет			УчетСебестоимости.РазделУчета,
	|		//ПредварительныйРасчет			УчетСебестоимости.ВидЗапасов)
	|		//ПредварительныйРасчет				В
	|		//ПредварительныйРасчет				(ВЫБРАТЬ
	|		//ПредварительныйРасчет					АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет					РазделУчета,
	|		//ПредварительныйРасчет					ВидЗапасов
	|		//ПредварительныйРасчет			 	ИЗ ВтАналитикаНоменклатуры)
	|	
	////////////////////// Эта часть для предварительного расчета стоимости.
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|				ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		0										     КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	// Показатели узла 1го графа. Данные для расчета ресурса СтоимостьРегл.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_1,
	|		
	|		ВЫБОР КОГДА НЕ &УчитыватьКорректировкиСтоимости
	|		  И УчетСебестоимости.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости), ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
	|			ТОГДА 0
	|		КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.РасчетСебестоимости
	|				ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.Количество <> 0 ИЛИ &СредняяЗаМесяц ИЛИ &ПартионныйУчетВерсии22)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СтоимостьГраф_1,
	|		
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход И &ПартионныйУчетВерсии22
	|				ТОГДА УчетСебестоимости.ДопРасходыРегл
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|				И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				И УчетСебестоимости.Количество = 0
	|				И НЕ &СредняяЗаМесяц
	|				И НЕ УчетСебестоимости.РасчетСебестоимости
	|			ТОГДА
	|				УчетСебестоимости.СтоимостьРегл
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ДопРасходыГраф_1,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ТрудозатратыРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ТрудозатратыГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостатейныеПостоянныеГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостатейныеПеременныеГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СтоимостьЗабалансовая,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостояннаяРазница,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВременнаяРазница,

	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьУпр.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_2,
	
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И УчетСебестоимости.РасчетСебестоимости
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.Количество <> 0 ИЛИ &СредняяЗаМесяц ИЛИ &ПартионныйУчетВерсии22)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СтоимостьГраф_2,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход И &ПартионныйУчетВерсии22
	|				ТОГДА УчетСебестоимости.ДопРасходыУпр
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|				И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				И УчетСебестоимости.Количество = 0
	|				И НЕ &СредняяЗаМесяц
	|				И НЕ УчетСебестоимости.РасчетСебестоимости
	|			ТОГДА
	|				УчетСебестоимости.СтоимостьУпр
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ДопРасходыГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ТрудозатратыУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ТрудозатратыГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПостоянныеУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПостоянныеГраф_2,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеПеременныеУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		ВТПромежуточнаяСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ГДЕ
	|		 УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		//ПредварительныйРасчет    		И (УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет			УчетСебестоимости.РазделУчета,
	|		//ПредварительныйРасчет			УчетСебестоимости.ВидЗапасов)
	|		//ПредварительныйРасчет				В
	|		//ПредварительныйРасчет				(ВЫБРАТЬ
	|		//ПредварительныйРасчет					АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет					РазделУчета,
	|		//ПредварительныйРасчет					ВидЗапасов
	|		//ПредварительныйРасчет			 	ИЗ ВтАналитикаНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		0										     КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	        // Показатели граф 1.
	|		УчетСебестоимости.Количество 					КАК ВесГраф_1,
	|		УчетСебестоимости.СтоимостьРегл 				КАК СтоимостьГраф_1,
	|		УчетСебестоимости.ДопРасходыРегл 				КАК ДопРасходыГраф_1,
	|		УчетСебестоимости.ТрудозатратыРегл 				КАК ТрудозатратыГраф_1,
	|		УчетСебестоимости.ПостатейныеПостоянныеРегл 	КАК ПостатейныеПостоянныеГраф_1,
	|		УчетСебестоимости.ПостатейныеПеременныеРегл 	КАК ПостатейныеПеременныеГраф_1,
	|		УчетСебестоимости.СтоимостьЗабалансоваяРегл 	КАК СтоимостьЗабалансовая,
	|		УчетСебестоимости.ПостояннаяРазница 			КАК ПостояннаяРазница,
	|		УчетСебестоимости.ВременнаяРазница 				КАК ВременнаяРазница,
	        // Показатели граф 2.
	|		УчетСебестоимости.Количество                 	КАК ВесГраф_2,
	|		УчетСебестоимости.СтоимостьУпр               	КАК СтоимостьГраф_2,
	|		УчетСебестоимости.ДопРасходыУпр              	КАК ДопРасходыГраф_2,
	|		УчетСебестоимости.ТрудозатратыУпр            	КАК ТрудозатратыГраф_2,
	|		УчетСебестоимости.ПостатейныеПостоянныеУпр  	КАК ПостатейныеПостоянныеГраф_2,
	|		УчетСебестоимости.ПостатейныеПеременныеУпр   	КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		ВТВозвраты КАК УчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Доп. расходы
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.АналитикаУчетаНоменклатуры 							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета                							КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		0										    				КАК КодСтрокиПродукция,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	        // Показатели граф 1.
	|		0                                  							КАК ВесГраф_1,
	|		0                                  							КАК СтоимостьГраф_1,
	|		Таблица.ДопРасходыРегл             							КАК ДопРасходыГраф_1,
	|		0                                  							КАК ТрудозатратыГраф_1,
	|		0                                  							КАК ПостатейныеПостоянныеГраф_1,
	|		0                                  							КАК ПостатейныеПеременныеГраф_1,
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК ПостояннаяРазница,
	|		0                                  							КАК ВременнаяРазница,
	        // Показатели граф 2.
	|		0                                  							КАК ВесГраф_2,
	|		0                                  							КАК СтоимостьГраф_2,
	|		Таблица.ДопРасходыУпр             							КАК ДопРасходыГраф_2,
	|		0                                  							КАК ТрудозатратыГраф_2,
	|		0                                  							КАК ПостатейныеПостоянныеГраф_2,
	|		0                                  							КАК ПостатейныеПеременныеГраф_2
	|
	|	ИЗ
	|		ВТДопРасходов КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам на начало расчетного периода.
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                           	КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры            	КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                           	КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                            	КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     				КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       				КАК АналитикаУчетаПартий,
	|		0										    				КАК КодСтрокиПродукция,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  				КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         				КАК ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	        // Показатели граф 1.
	|		УчетСебестоимости.КоличествоОстаток 				КАК ВесГраф_1,
	|		УчетСебестоимости.СтоимостьРеглОстаток 				КАК СтоимостьГраф_1,
	|		УчетСебестоимости.ДопРасходыРеглОстаток 			КАК ДопРасходыГраф_1,
	|		УчетСебестоимости.ТрудозатратыРеглОстаток 			КАК ТрудозатратыГраф_1,
	|		УчетСебестоимости.ПостатейныеПостоянныеРеглОстаток 	КАК ПостатейныеПостоянныеГраф_1,
	|		УчетСебестоимости.ПостатейныеПеременныеРеглОстаток 	КАК ПостатейныеПеременныеГраф_1,
	|		УчетСебестоимости.СтоимостьЗабалансоваяРеглОстаток 	КАК СтоимостьЗабалансовая,
	|		УчетСебестоимости.ПостояннаяРазницаОстаток 			КАК ПостояннаяРазница,
	|		УчетСебестоимости.ВременнаяРазницаОстаток 			КАК ВременнаяРазница,
	        // Показатели граф 2.
	|		УчетСебестоимости.КоличествоОстаток					КАК ВесГраф_2,
	|		УчетСебестоимости.СтоимостьУпрОстаток 				КАК СтоимостьГраф_2,
	|		УчетСебестоимости.ДопРасходыУпрОстаток 				КАК ДопРасходыГраф_2,
	|		УчетСебестоимости.ТрудозатратыУпрОстаток			КАК ТрудозатратыГраф_2,
	|		УчетСебестоимости.ПостатейныеПостоянныеУпрОстаток 	КАК ПостатейныеПостоянныеГраф_2,
	|		УчетСебестоимости.ПостатейныеПеременныеУпрОстаток 	КАК ПостатейныеПеременныеГраф_2
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|			//ПредварительныйРасчет И (АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов)
	|			//ПредварительныйРасчет В
	|			//ПредварительныйРасчет (ВЫБРАТЬ
	|			//ПредварительныйРасчет 	АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов
	|			//ПредварительныйРасчет	ИЗ ВтАналитикаНоменклатуры)
	|		) КАК УчетСебестоимости
	|	ГДЕ
	|		УчетСебестоимости.КоличествоОстаток <> 0
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.РазделУчета,
	|	ВложенныйЗапрос.Организация,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ,
	|	ВложенныйЗапрос.КодСтрокиПродукция,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов
	|";
	
	ТекстЗапроса = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПредварительныйРасчет", "");
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтУзлыКорректировки");
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет
	 И ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОВзвешеннаяОценка Тогда
		ПодготовитьДанныеДляРасчетаСтоимостиРеглПоФИФО(ПараметрыРасчета, Запрос); // корректировка ВтУзлыКорректировки
	КонецЕсли;

	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтАналитикаНоменклатуры");
	КонецЕсли;
	
	ПараметрыНумерации = УниверсальныеМеханизмыПартийИСебестоимости.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатуры", // разделитель
		, // без группировки
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
			|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС", // порядок
		"НомерУзла", // поле номера
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
			|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, НомерУзла"); // индекс
	
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ВтУзлыКорректировки");
	
	ПараметрыРасчета.КоличествоУзловРегл =
		УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");

	ПодготовитьДанныеДляРаспределенияРезервов(ПараметрыРасчета, Истина);
	
КонецПроцедуры


// Этап 3.14
// Процедура рассчитывает отклонения в суммах движений по регистру СебестоимостьТоваров от рассчитанной себестоимости 
// и производит корректировку движений следующих регистров:
// СебестоимостьТоваров, ПрочиеРасходы
//
Процедура СкорректироватьСтоимостьСписанияЗапасов(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияЗапасов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ДД.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета
	|ПОМЕСТИТЬ
	|	ЕстьВозвратныеОтходы
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.Количество < 0
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Активность
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	ИСТИНА КАК РаботаДляДавальца
	|ПОМЕСТИТЬ
	|	РаботыДляДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КорАналитикаУчетаНоменклатуры,
	|	КорВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период                        	КАК Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   							КАК ВидДвижения,
	|	УчетСебестоимости.Регистратор                   	КАК ДокументДвижения,
	|	УчетСебестоимости.Организация                   	КАК Организация,
	|	АналитикаНоменклатуры.МестоХранения             	КАК Склад,
	|	АналитикаНоменклатуры.Номенклатура             		КАК Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры    	КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|		ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	УчетСебестоимости.ВидЗапасов                    	КАК ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов            	КАК ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация         	КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры 	КАК КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения          	КАК КорСклад,
	|	КорАналитикаНоменклатуры.Номенклатура           	КАК КорНоменклатура,
	|	УчетСебестоимости.КорРазделУчета                	КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов                 	КАК КорВидЗапасов,
	|	УчетСебестоимости.КорВидЗапасов.ТипЗапасов         	КАК КорТипЗапасов,
	|	УчетСебестоимости.КорОрганизация                	КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение                 	КАК Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам     	КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента                  	КАК ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов            		КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания        	КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр		  КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл		  КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.СтатьяДоходов                 	КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов              	КАК АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов         	КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов      	КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки           	КАК ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки                     	КАК КодСтроки,
	|	УчетСебестоимости.ПериодПродажи                 	КАК ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции               	КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности        КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL
	|	 И УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПоКомиссииМеждуОрганизациями 
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ 												КАК СторноОтчетПоКомиссии,
	|	УчетСебестоимости.Партия                          	КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия                 		КАК КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий           КАК КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета      КАК КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС             КАК КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции                 КАК СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи                 		КАК ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник                 	КАК ДокументИсточник,
	|	ЕСТЬNULL(РаботыДляДавальца.РаботаДляДавальца, ЛОЖЬ) КАК ПродукцияДавальца,
	|	ЛОЖЬ												КАК РаботаДляДавальца,
	|	СУММА(УчетСебестоимости.Количество)        			КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость)              	КАК Стоимость,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС)        	КАК СтоимостьБезНДС,
	|	СУММА(УчетСебестоимости.СтоимостьРегл)          	КАК СтоимостьРегл,
	|	СУММА(УчетСебестоимости.ПостояннаяРазница)      	КАК ПостояннаяРазница,
	|	СУММА(УчетСебестоимости.ВременнаяРазница)       	КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая)      КАК СтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл)  КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.КорСтоимость)           	КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.НДСРегл)           			КАК НДСРегл,
	|	СУММА(УчетСебестоимости.СтоимостьУпр)              	КАК СтоимостьУпр,
	|	СУММА(УчетСебестоимости.НДСУпр)           			КАК НДСУпр
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ СторноОтчетыКомиссионера КАК СторноОтчетыКомиссионера
	|		ПО СторноОтчетыКомиссионера.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И СторноОтчетыКомиссионера.РазделУчета = УчетСебестоимости.РазделУчета
	|		И СторноОтчетыКомиссионера.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И СторноОтчетыКомиссионера.Организация = УчетСебестоимости.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|		И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|		И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|		И РаботыДляДавальца.КорАналитикаУчетаПартий = УчетСебестоимости.КорАналитикаУчетаПартий
	|ГДЕ
	|	(НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И НЕ УчетСебестоимости.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|		ИЛИ (УчетСебестоимости.Количество <> 0
	|			 И УчетСебестоимости.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))))
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	АналитикаНоменклатуры.МестоХранения,
	|	АналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ),
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения,
	|	КорАналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL
	|	 И УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПоКомиссииМеждуОрганизациями 
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник,
	|	ЕСТЬNULL(РаботыДляДавальца.РаботаДляДавальца, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период                        	КАК Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   							КАК ВидДвижения,
	|	УчетСебестоимости.Регистратор                   	КАК ДокументДвижения,
	|	УчетСебестоимости.Организация                   	КАК Организация,
	|	АналитикаНоменклатуры.МестоХранения             	КАК Склад,
	|	АналитикаНоменклатуры.Номенклатура             		КАК Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры    	КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|		ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	УчетСебестоимости.ВидЗапасов                    	КАК ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов            	КАК ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация         	КАК ХозяйственнаяОперация,
	|	РаботыДляДавальца.АналитикаУчетаНоменклатуры 		КАК КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения          	КАК КорСклад,
	|	КорАналитикаНоменклатуры.Номенклатура           	КАК КорНоменклатура,
	|	РаботыДляДавальца.РазделУчета                		КАК КорРазделУчета,
	|	РаботыДляДавальца.ВидЗапасов                 		КАК КорВидЗапасов,
	|	РаботыДляДавальца.ТипЗапасов         				КАК КорТипЗапасов,
	|	УчетСебестоимости.КорОрганизация                	КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение                 	КАК Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам     	КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента                  	КАК ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов            		КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания        	КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр		  КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл		  КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.СтатьяДоходов                 	КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов              	КАК АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов         	КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов      	КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки           	КАК ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки                     	КАК КодСтроки,
	|	УчетСебестоимости.ПериодПродажи                 	КАК ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции               	КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности        КАК КорНаправлениеДеятельности,
	|	ЛОЖЬ 												КАК СторноОтчетПоКомиссии,
	|	УчетСебестоимости.Партия                          	КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия                 		КАК КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий           КАК КорАналитикаУчетаПартий,
	|	РаботыДляДавальца.АналитикаФинансовогоУчета         КАК КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС             КАК КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции                 КАК СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи                 		КАК ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник                 	КАК ДокументИсточник,
	|	ЛОЖЬ												КАК ПродукцияДавальца,
	|	ИСТИНА												КАК РаботаДляДавальца,
	|	СУММА(УчетСебестоимости.Количество)        			КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость)              	КАК Стоимость,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС)        	КАК СтоимостьБезНДС,
	|	СУММА(УчетСебестоимости.СтоимостьРегл)          	КАК СтоимостьРегл,
	|	СУММА(УчетСебестоимости.ПостояннаяРазница)      	КАК ПостояннаяРазница,
	|	СУММА(УчетСебестоимости.ВременнаяРазница)       	КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая)      КАК СтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл)  КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.КорСтоимость)           	КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.НДСРегл)           			КАК НДСРегл,
	|	СУММА(УчетСебестоимости.СтоимостьУпр)              	КАК СтоимостьУпр,
	|	СУММА(УчетСебестоимости.НДСУпр)           			КАК НДСУпр
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|		И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|		И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|		И РаботыДляДавальца.КорАналитикаУчетаПартий = УчетСебестоимости.КорАналитикаУчетаПартий
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО РаботыДляДавальца.АналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	АналитикаНоменклатуры.МестоХранения,
	|	АналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ),
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	РаботыДляДавальца.АналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения,
	|	КорАналитикаНоменклатуры.Номенклатура,
	|	РаботыДляДавальца.РазделУчета,
	|	РаботыДляДавальца.ВидЗапасов,
	|	РаботыДляДавальца.ТипЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	РаботыДляДавальца.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Организация,
	|	РазделУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                        КАК Период,
	|	ТаблицаКорректировки.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаКорректировки.Организация                   КАК Организация,
	|	ТаблицаКорректировки.Склад                         КАК Склад,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		ИНАЧЕ ТаблицаКорректировки.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов                    КАК ВидЗапасов,
	|	ЕСТЬNULL(ТаблицаКорректировки.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ТаблицаКорректировки.КорСклад                      КАК КорСклад,
	|	ТаблицаКорректировки.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаКорректировки.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ЕСТЬNULL(ТаблицаКорректировки.КорТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК КорТипЗапасов,
	|	ТаблицаКорректировки.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаКорректировки.Подразделение                 КАК Подразделение,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.ЗаказКлиента                  КАК ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями))
	|			И (ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))
	|				- ТаблицаКорректировки.СтоимостьРегл) < 0
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаКорректировки.АналитикаРасходов КОНЕЦ) КАК АналитикаРасходов,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями))
	|			И (ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))
	|				- ТаблицаКорректировки.СтоимостьРегл) < 0
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаКорректировки.СтатьяРасходовСписания КОНЕЦ) КАК СтатьяРасходовСписания,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ТаблицаКорректировки.ПринятиеКНалоговомуУчету      КАК ПринятиеКНалоговомуУчету,
	|	ТаблицаКорректировки.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями))
	|			И (ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))
	|				- ТаблицаКорректировки.СтоимостьРегл) > 0
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаКорректировки.СтатьяДоходов КОНЕЦ) КАК СтатьяДоходов,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями))
	|			И (ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))
	|				+ ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))
	|				- ТаблицаКорректировки.СтоимостьРегл) > 0
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаКорректировки.АналитикаДоходов КОНЕЦ) КАК АналитикаДоходов,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаКорректировки.КодСтроки                     КАК КодСтроки,
	|	ТаблицаКорректировки.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаКорректировки.ГруппаПродукции               КАК ГруппаПродукции,
	|	ТаблицаКорректировки.СторноОтчетПоКомиссии		   КАК СторноОтчетПоКомиссии,
	|	ТаблицаКорректировки.Партия                        КАК Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ТаблицаКорректировки.КорПартия                 	   КАК КорПартия,
	|	ТаблицаКорректировки.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаКорректировки.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаКорректировки.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	ТаблицаКорректировки.ТипЗаписи                 	   КАК ТипЗаписи,
	|	ТаблицаКорректировки.ДокументИсточник              КАК ДокументИсточник,
	|	
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ТаблицаКорректировки.ВидЗапасов
	|		ИНАЧЕ 
	|			ТаблицаКорректировки.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ТаблицаКорректировки.КорВидЗапасов
	|		ИНАЧЕ 
	|			ТаблицаКорректировки.КорНоменклатура
	|	КОНЕЦ КАК КорИсточникГФУНоменклатуры,
	|	ВЫБОР КОГДА ТаблицаКорректировки.ХозяйственнаяОперация В (&МассивОперацийПередачи) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ                                              КАК ЭтоПередачаМеждуОрганизациями,
	|	ТаблицаКорректировки.КорСтоимость                  КАК КорСтоимость,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.Стоимость
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.Стоимость, 0) КАК ЧИСЛО(31,2))
	|		- ТаблицаКорректировки.Стоимость
	|	КОНЕЦ) КАК Стоимость,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.РаботаДляДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(31,2))
	|		- ТаблицаКорректировки.СтоимостьЗабалансовая
	|	КОНЕЦ) КАК СтоимостьЗабалансовая,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьБезНДС
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьБезНДС, 0) КАК ЧИСЛО(31,2))
	|		- ТаблицаКорректировки.СтоимостьБезНДС
	|	КОНЕЦ) КАК СтоимостьБезНДС,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостояннаяРазница, 0)  КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.ПостояннаяРазница КОНЕЦ) КАК ПостояннаяРазница,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ВременнаяРазница, 0)  КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.ВременнаяРазница КОНЕЦ) КАК ВременнаяРазница,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходы, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходы,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходыБезНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.Трудозатраты, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК Трудозатраты,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеСНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеСНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеБезНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеБезНДС,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеСНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеСНДС,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеБезНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеБезНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходыРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ТрудозатратыРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеРегл,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьРегл
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.СтоимостьРегл КОНЕЦ) КАК СтоимостьРегл,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.РаботаДляДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(31,2))
	|	 		- ТаблицаКорректировки.СтоимостьЗабалансоваяРегл КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьУпр
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьУпр, 0) КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.СтоимостьУпр КОНЕЦ) КАК СтоимостьУпр,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходыУпр,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ТрудозатратыУпр,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеУпр,
	
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеУпр,
	|
	|	ТаблицаКорректировки.НДСРегл КАК НДСРегл,
	|	ТаблицаКорректировки.НДСУпр КАК НДСУпр,
	|	ТаблицаКорректировки.Стоимость КАК ИсходнаяСтоимость,
	|	ТаблицаКорректировки.СтоимостьБезНДС КАК ИсходнаяСтоимостьБезНДС,
	|	ТаблицаКорректировки.СтоимостьРегл КАК ИсходнаяСтоимостьРегл,
	|	ТаблицаКорректировки.СтоимостьРегл КАК ИсходнаяСтоимостьУпр,
	|	ТаблицаКорректировки.Количество КАК Количество
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТСтоимостьПартийТоваров КАК СтоимостьТоваров
	|	ПО 
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 	= ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|		И СтоимостьТоваров.ВидЗапасов               	= ТаблицаКорректировки.ВидЗапасов
	|		И СтоимостьТоваров.Организация              	= ТаблицаКорректировки.Организация
	|		И СтоимостьТоваров.РазделУчета              	= ТаблицаКорректировки.РазделУчета
	|		И СтоимостьТоваров.Партия 						= ТаблицаКорректировки.Партия
	|		И СтоимостьТоваров.АналитикаУчетаПартий 		= ТаблицаКорректировки.АналитикаУчетаПартий
	|		И СтоимостьТоваров.АналитикаФинансовогоУчета 	= ТаблицаКорректировки.АналитикаФинансовогоУчета
	|		И СтоимостьТоваров.ВидДеятельностиНДС 			= ТаблицаКорректировки.ВидДеятельностиНДС
	|		И (ТаблицаКорректировки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИЛИ ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление))
	|	
	|ГДЕ
	|	НЕ ТаблицаКорректировки.СторноОтчетПоКомиссии
	|";
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	Пока Выборка.Следующий() Цикл

		СуммаСНДС   = Выборка.Стоимость + Выборка.ДопРасходы + Выборка.Трудозатраты + Выборка.ПостатейныеПостоянныеСНДС + Выборка.ПостатейныеПеременныеСНДС;
		СуммаБезНДС = Выборка.СтоимостьБезНДС + Выборка.ДопРасходыБезНДС + Выборка.Трудозатраты + Выборка.ПостатейныеПостоянныеБезНДС + Выборка.ПостатейныеПеременныеБезНДС;
		СуммаРегл   = Выборка.СтоимостьРегл + Выборка.ДопРасходыРегл + Выборка.ТрудозатратыРегл + Выборка.ПостатейныеПостоянныеРегл + Выборка.ПостатейныеПеременныеРегл;
		СуммаУпр    = Выборка.СтоимостьУпр + Выборка.ДопРасходыУпр + Выборка.ТрудозатратыУпр + Выборка.ПостатейныеПостоянныеУпр + Выборка.ПостатейныеПеременныеУпр;
		
		// Корректировка списания товаров
		СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, Выборка, Выборка.ВидДвижения);

		// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
		Если ЗначениеЗаполнено(Выборка.КорРазделУчета)
		 И НЕ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
		 И НЕ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
				И Выборка.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) Тогда
			
			СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, Выборка);
			
		КонецЕсли;
		
		// Сторнирование себестоимости товаров по управленческой организации.
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет
		 ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет Тогда

			СформироватьДвиженияСебестоимостьТоваровСторноВУпрУчете(ПараметрыРасчета, Выборка);

		КонецЕсли;

		// Корректировка списания товаров на затраты в регистре учет прочих расходов.
		Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
		 И (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровУХранителя
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
				И ЗначениеЗаполнено(Выборка.СтатьяРасходовСписания)
				И ЗначениеЗаполнено(Выборка.КорОрганизация)
		)
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
		
			ЭтоВыпускПродукции = Ложь;
			
			Если ЗначениеЗаполнено(Выборка.СтатьяАктивовПассивов) Тогда
				СформироватьДвиженияПрочиеАктивыПассивы(
					ПараметрыРасчета,
					Выборка,
					СуммаСНДС + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0));
			Иначе
				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					СуммаСНДС + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0),
					СуммаБезНДС + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьБезНДС, 0),
					СуммаРегл + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьРегл, 0),
					СуммаУпр + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьУпр, 0),
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);
			КонецЕсли;
		КонецЕсли;
		
		// Формирование прочих доходов\расходов при пересортице
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
		 И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда

			Если СуммаСНДС - Выборка.КорСтоимость > 0 Тогда 

				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					СуммаСНДС - Выборка.КорСтоимость,
					СуммаБезНДС,
					СуммаРегл,
					СуммаУпр,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);

			ИначеЕсли СуммаСНДС - Выборка.КорСтоимость < 0 Тогда

				СформироватьДвиженияПрочиеДоходы(
					ПараметрыРасчета,
					Выборка,
					- (СуммаСНДС - Выборка.КорСтоимость),
					- СуммаРегл,
					- СуммаУпр);

			КонецЕсли;

		КонецЕсли;

		// Формирование прочих расходов при порче
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
		 И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда

			Если СуммаСНДС - Выборка.КорСтоимость <> 0 Тогда
				
				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					СуммаСНДС - Выборка.КорСтоимость,
					СуммаБезНДС,
					СуммаРегл,
					СуммаУпр,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);

			КонецЕсли;

		КонецЕсли;

		// Формирование прочих доходов/расходов при возврате товаров поставщику.
		ЭтоВозвратМеждуОрганизациями = (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями);
		Если (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
			ИЛИ ЭтоВозвратМеждуОрганизациями
			ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
			ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары)
			И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
			
			Если СуммаРегл > 0 И ЗначениеЗаполнено(Выборка.СтатьяРасходовСписания) Тогда

				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					?(ЭтоВозвратМеждуОрганизациями, 0, СуммаСНДС),
					?(ЭтоВозвратМеждуОрганизациями, 0, СуммаБезНДС),
					СуммаРегл,
					СуммаУпр,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);

			ИначеЕсли СуммаСНДС < 0 И ЗначениеЗаполнено(Выборка.СтатьяДоходов) Тогда

				СформироватьДвиженияПрочиеДоходы(
					ПараметрыРасчета,
					Выборка,
					?(ЭтоВозвратМеждуОрганизациями, 0, - СуммаСНДС),
					- СуммаРегл,
					- СуммаУпр);

			КонецЕсли;
			
		КонецЕсли;
		
		// Корректировка движений по оборотным регистрам управленческого учета.
		СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, Выборка);

	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтТаблицаКорректировки, ЕстьВозвратныеОтходы, РаботыДляДавальца");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


// Этап 3.17
Процедура СкорректироватьСтоимостьПродаж(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПродаж");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер         КАК Партнер,
	|	АналитикаПартнеров.Контрагент      КАК Контрагент,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Продажи.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ) КАК ВидЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА
	|		Продажи.РазделУчета
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	КОГДА Продажи.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ КАК РазделУчета,
	|	Продажи.Партия 					   КАК Партия,
	|	Продажи.АналитикаУчетаПартий 	   КАК АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС 		   КАК ВидДеятельностиНДС,
	|	СУММА(Продажи.Количество)          КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Продажи.АналитикаУчетаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ХозяйственнаяОперация В (&МассивОперацийРеализации)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер,
	|	АналитикаПартнеров.Контрагент,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Продажи.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ),
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА
	|		Продажи.РазделУчета
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	КОГДА Продажи.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ,
	|	Продажи.Партия,
	|	Продажи.АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|
	|	СУММА(Продажи.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Организация,
	|	РазделУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.ДокументДвижения КАК ДокументДвижения
	|ПОМЕСТИТЬ ВтРегистраторыПродаж
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Себестоимость.Период,
	|	Себестоимость.Регистратор КАК ДокументДвижения,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Себестоимость.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ) КАК ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам,
	|	СУММА(Себестоимость.Количество) КАК Количество,
	|	СУММА(Себестоимость.Стоимость) КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.Трудозатраты) КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Себестоимость.ДопРасходыРегл) КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Себестоимость.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|	СУММА(Себестоимость.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Себестоимость.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(Себестоимость.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
	|	СУММА(Себестоимость.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ВтСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторыПродаж КАК РегистраторыПродаж
	|		ПО РегистраторыПродаж.Период = Себестоимость.Период
	|		И РегистраторыПродаж.ДокументДвижения = Себестоимость.Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Себестоимость.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ),
	|	Себестоимость.Организация,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                     КАК Период,
	|	ТаблицаКорректировки.ДокументДвижения           КАК ДокументДвижения,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаКорректировки.ЗаказКлиента               КАК ЗаказКлиента,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.Организация                КАК Организация,
	|	ТаблицаКорректировки.РазделУчета 			    КАК РазделУчета,
	|	ТаблицаКорректировки.Партия 					КАК Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий 	    КАК АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС 		КАК ВидДеятельностиНДС,
	|	ТаблицаКорректировки.Партнер                    КАК Партнер,
	|	ТаблицаКорректировки.Контрагент                 КАК Контрагент,
	|	ТаблицаКорректировки.Подразделение              КАК Подразделение,
	|	ТаблицаКорректировки.ТипЗапасов                 КАК ТипЗапасов,
	|	ТаблицаКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаКорректировки.Менеджер                   КАК Менеджер,
	|	ТаблицаКорректировки.Склад                      КАК Склад,
	|	ТаблицаКорректировки.Соглашение                 КАК Соглашение,
	|	ТаблицаКорректировки.Договор                    КАК Договор,
	|	ТаблицаКорректировки.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	ТаблицаКорректировки.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	ТаблицаКорректировки.ВалютаДокумента            КАК ВалютаДокумента,
	|	ТаблицаКорректировки.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	ТаблицаКорректировки.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ТаблицаКорректировки.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.Стоимость / Себестоимость.Количество КАК ЧИСЛО(31,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.Стоимость, 0) КАК ЧИСЛО(31,2))) КАК Стоимость,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.СтоимостьБезНДС / Себестоимость.Количество КАК ЧИСЛО(31,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьБезНДС, 0) КАК ЧИСЛО(31,2))) КАК СтоимостьБезНДС,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.ПостояннаяРазница / Себестоимость.Количество КАК ЧИСЛО(31,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостояннаяРазница, 0) КАК ЧИСЛО(31,2))) КАК ПостояннаяРазница,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.ВременнаяРазница / Себестоимость.Количество КАК ЧИСЛО(31,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ВременнаяРазница, 0) КАК ЧИСЛО(31,2))) КАК ВременнаяРазница,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.ДопРасходы / Себестоимость.Количество КАК ЧИСЛО(31,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходы, 0) КАК ЧИСЛО(31,2))) КАК ДопРасходы,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.ДопРасходыБезНДС / Себестоимость.Количество КАК ЧИСЛО(31,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(31,2))) КАК ДопРасходыБезНДС,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.СтоимостьРегл / Себестоимость.Количество КАК ЧИСЛО(31,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))) КАК СтоимостьРегл,
	|
	|	ЕСТЬNULL(Себестоимость.СтоимостьЗабалансовая,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(31,2))) КАК СтоимостьЗабалансовая,
	|
	|	ЕСТЬNULL(Себестоимость.Трудозатраты,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.Трудозатраты, 0) КАК ЧИСЛО(31,2))) КАК Трудозатраты,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПостоянныеСНДС,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеСНДС, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПостоянныеСНДС,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПеременныеСНДС,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеСНДС, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПеременныеСНДС,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПостоянныеБезНДС,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеБезНДС, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПостоянныеБезНДС,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПеременныеБезНДС,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеБезНДС, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПеременныеБезНДС,
	|
	|	ЕСТЬNULL(Себестоимость.СтоимостьЗабалансоваяРегл,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(31,2))) КАК СтоимостьЗабалансоваяРегл,
	|
	|	ЕСТЬNULL(Себестоимость.ДопРасходыРегл,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))) КАК ДопРасходыРегл,
	|
	|	ЕСТЬNULL(Себестоимость.ТрудозатратыРегл,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))) КАК ТрудозатратыРегл,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПостоянныеРегл,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПостоянныеРегл,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПеременныеРегл,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПеременныеРегл,
	|
	|	ЕСТЬNULL(Себестоимость.СтоимостьУпр,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьУпр, 0) КАК ЧИСЛО(31,2))) КАК СтоимостьУпр,
	|
	|	ЕСТЬNULL(Себестоимость.ДопРасходыУпр,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ДопРасходыУпр, 0) КАК ЧИСЛО(31,2))) КАК ДопРасходыУпр,
	|
	|	ЕСТЬNULL(Себестоимость.ТрудозатратыУпр,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыУпр, 0) КАК ЧИСЛО(31,2))) КАК ТрудозатратыУпр,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПостоянныеУпр,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеУпр, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПостоянныеУпр,
	|
	|	ЕСТЬNULL(Себестоимость.ПостатейныеПеременныеУпр,
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеУпр, 0) КАК ЧИСЛО(31,2))) КАК ПостатейныеПеременныеУпр,
	|
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТКэшСтоимостьТоваров КАК СтоимостьТоваров
	|	ПО 
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры = ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|		И СтоимостьТоваров.ВидЗапасов = ТаблицаКорректировки.ВидЗапасов
	|		И СтоимостьТоваров.Организация = ТаблицаКорректировки.Организация
	|		И СтоимостьТоваров.РазделУчета = ТаблицаКорректировки.РазделУчета
	|		И НЕ &ПартионныйУчетВерсии22
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСебестоимость КАК Себестоимость
	|		ПО Себестоимость.Период = ТаблицаКорректировки.Период
	|		И Себестоимость.ДокументДвижения = ТаблицаКорректировки.ДокументДвижения
	|		И Себестоимость.АналитикаУчетаНоменклатуры = ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|		И (Себестоимость.ВидЗапасов = ТаблицаКорректировки.ВидЗапасов ИЛИ Себестоимость.ВидЗапасов = НЕОПРЕДЕЛЕНО)
	|		И Себестоимость.Организация = ТаблицаКорректировки.Организация
	|		И Себестоимость.РазделУчета = ТаблицаКорректировки.РазделУчета
	|		И Себестоимость.Партия = ТаблицаКорректировки.Партия
	|		И Себестоимость.АналитикаУчетаПартий = ТаблицаКорректировки.АналитикаУчетаПартий
	|		И Себестоимость.АналитикаФинансовогоУчета = ТаблицаКорректировки.АналитикаФинансовогоУчета
	|		И Себестоимость.ВидДеятельностиНДС = ТаблицаКорректировки.ВидДеятельностиНДС
	|		И Себестоимость.ЗаказКлиента = ТаблицаКорректировки.ЗаказКлиента
	|		И Себестоимость.АналитикаУчетаПоПартнерам = ТаблицаКорректировки.АналитикаУчетаПоПартнерам
	|		И Себестоимость.Количество <> 0
	|";
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	Пока Выборка.Следующий() Цикл
		
		// Корректировка себестоимости продаж по хоз операциям продажи.
		СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, Выборка);
		
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда	
			
			СформироватьДвиженияЗакупки(ПараметрыРасчета, Выборка);
				
		КонецЕсли;

	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки, ВтРегистраторыПродаж, ВтСебестоимость");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.18
Процедура ВключитьИсключитьНДСВСтоимостьПродаж(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимостьПродаж");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	АналитикаПартнеров.Организация,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.Партия,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС
	|ПОМЕСТИТЬ ДвиженияПродаж
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|		ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|	И НЕ &ОдновременноФормироватьДвиженияПартийНДСВерсии22И24
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.РаспределениеПоВыбывшимТоварам,
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДСУпр
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаПродукции КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР КОГДА Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|			ТОГДА Партии.КорВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов
	|		КОНЕЦ КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА (ВЫБОР
	|					КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|						ТОГДА Партии.СтоимостьБезНДС + Партии.НДС
	|					КОГДА Партии.СтоимостьБезНДС = 0 ТОГДА Партии.НДС
	|					ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ)
	|			ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		Партии.РазделУчета,
	|		(ВЫБОР
	|			КОГДА ДвиженияПродаж.Регистратор ЕСТЬ NULL ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Партии.Партия КОНЕЦ) КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		Партии.АналитикаФинансовогоУчета,
	|		Партии.ВидДеятельностиНДС,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПродаж КАК ДвиженияПродаж
	|		 ПО ДвиженияПродаж.Период = Партии.Период
	|		 И ДвиженияПродаж.Регистратор = Партии.Регистратор
	|		 И ДвиженияПродаж.Организация = Партии.Организация
	|		 И ДвиженияПродаж.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		 И ДвиженияПродаж.Партия = Партии.Партия
	|		 И ДвиженияПродаж.АналитикаФинансовогоУчета = Партии.АналитикаФинансовогоУчета
	|		 И ДвиженияПродаж.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|		И НЕ &ОдновременноФормироватьДвиженияПартийНДСВерсии22И24
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|	
	|	) КАК Партии
	|ГДЕ
	|	Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.РаспределениеПоВыбывшимТоварам
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.РазделУчета				   КАК РазделУчета,
	|	Продажи.Партия				   	   КАК Партия,
	|	Продажи.АналитикаУчетаПартий	   КАК АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	СУММА(ВЫБОР
	|		КОГДА Продажи.РасчетПартий И Продажи.Количество = 0
	|			ТОГДА (ВЫБОР
	|				КОГДА Продажи.ДопРасходыРегл = 0 ТОГДА Продажи.НДСРегл
	|				ИНАЧЕ Продажи.ДопРасходыРегл КОНЕЦ)
	|		КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	СУММА(Продажи.Количество)          КАК ИсходноеКоличество,
	|	0                                  КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Продажи.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	Продажи.РазделУчета,
	|	Продажи.Партия,
	|	Продажи.АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА Продажи.РасчетПартий И Продажи.Количество = 0
	|			ТОГДА (ВЫБОР
	|				КОГДА Продажи.ДопРасходыРегл = 0 ТОГДА Продажи.НДСРегл
	|				ИНАЧЕ Продажи.ДопРасходыРегл КОНЕЦ)
	|		КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 								   КАК Порядок,
	|	Партии.Период 					   КАК Период,
	|	Партии.Регистратор 				   КАК Регистратор,
	|	Партии.Регистратор 				   КАК ДокументДвижения,
	|	Партии.Организация 				   КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов 				   КАК ВидЗапасов,
	|	Партии.РазделУчета				   КАК РазделУчета,
	|	Партии.Партия				   	   КАК Партия,
	|	Партии.АналитикаУчетаПартий	       КАК АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета   КАК АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСРегл КОНЕЦ) КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСРегл КОНЕЦ) КАК СтоимостьУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|	ИЛИ СУММА(Партии.НДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	РазделУчета,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов,
	|Подразделение, АналитикаУчетаПоПартнерам,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры,
	|НалогообложениеНДС, ДокументДвижения,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Стоимость, СтоимостьБезНДС, Количество,
	|ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, НДСРегл, НДСУпр, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
		 И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
		 И СтрокаОстатка.РазделУчета = Выборка.РазделУчета
		 И СтрокаОстатка.Партия = Выборка.Партия
		 И СтрокаОстатка.АналитикаФинансовогоУчета = Выборка.АналитикаФинансовогоУчета
		 И СтрокаОстатка.ВидДеятельностиНДС = Выборка.ВидДеятельностиНДС
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);

		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ПараметрыРасчета.ПартионныйУчетВерсии22
	 ИЛИ НЕ ПараметрыРасчета.Отладка.ОдновременноФормироватьДвиженияПартийНДСВерсии22И24 Тогда
		
	 	// Формируются движения по регистрам:
		// - ПрочиеРасходы
		СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
		
		// Формируются движения по регистрам:
		// - ДвиженияНоменклатураДоходыРасходы
		СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
		
	КонецЕсли;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтПартии, ДвиженияПродаж, ВтРегистраторы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.18.2
Процедура ВключитьИсключитьНДСВСтоимостьПродаж24(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимостьПродаж24");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	АналитикаПартнеров.Организация,
	|	Продажи.Партия,
	|	Продажи.ВидДеятельностиНДС,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДляСвязи,
	|	Продажи.ВидЗапасов КАК ВидЗапасовДляСвязи
	|ПОМЕСТИТЬ ДвиженияПродаж
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|		ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	Партия,
	|	ВидДеятельностиНДС,
	|	АналитикаУчетаНоменклатурыДляСвязи,
	|	ВидЗапасовДляСвязи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи,
	|	Партии.РаспределениеПоВыбывшимТоварам,
	|
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДСУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|			ТОГДА Партии.СтоимостьБезНДС + Партии.НДСРегл
	|		КОГДА Партии.СтоимостьБезНДС = 0
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ) КАК Стоимость
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		Партии.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		(ВЫБОР
	|			КОГДА ДвиженияПродаж.Регистратор ЕСТЬ NULL ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Партии.Партия КОНЕЦ) КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.ВидДеятельностиНДС,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДляСвязи,
	|		Партии.КорВидЗапасов КАК ВидЗапасовДляСвязи,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН2_4 КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПродаж КАК ДвиженияПродаж
	|		 ПО ДвиженияПродаж.Период = Партии.Период
	|		 И ДвиженияПродаж.Регистратор = Партии.Регистратор
	|		 И ДвиженияПродаж.Организация = Партии.Организация
	|		 И ДвиженияПродаж.Партия = Партии.Партия
	|		 И ДвиженияПродаж.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|		 И ДвиженияПродаж.АналитикаУчетаНоменклатурыДляСвязи = Партии.КорАналитикаУчетаНоменклатуры
	|		 И ДвиженияПродаж.ВидЗапасовДляСвязи = Партии.КорВидЗапасов
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|	
	|	) КАК Партии
	|ГДЕ
	|	Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи,
	|	Партии.РаспределениеПоВыбывшимТоварам
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.РазделУчета				   КАК РазделУчета,
	|	Продажи.Партия				   	   КАК Партия,
	|	Продажи.АналитикаУчетаПартий	   КАК АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДляСвязи,
	|	Продажи.ВидЗапасов КАК ВидЗапасовДляСвязи,
	|
	|	СУММА(ВЫБОР // полностью аналогичное условие должно быть в конструкции ИМЕЮЩИЕ
	|		КОГДА Продажи.РасчетПартий И Продажи.Количество = 0 И Продажи.ДопРасходыРегл <> 0
	|			ТОГДА Продажи.ДопРасходыРегл
	|		КОГДА ЕСТЬNULL(Цены.СтоимостьРегл + Цены.ДопРасходыРегл + Цены.ТрудозатратыРегл, 0) = 0
	|			ТОГДА Продажи.НДСРегл
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(Цены.СтоимостьРегл + Цены.ДопРасходыРегл + Цены.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|	) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	СУММА(ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(Цены.СтоимостьРегл + Цены.ДопРасходыРегл + Цены.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))) КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Продажи.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваровПредыдущая КАК Цены
	|			ПО Цены.Организация = АналитикаПартнеров.Организация
	|			И Цены.Партия = Продажи.Партия
	|			И Цены.АналитикаУчетаПартий = Продажи.АналитикаУчетаПартий
	|			И Цены.АналитикаФинансовогоУчета = Продажи.АналитикаФинансовогоУчета
	|			И Цены.ВидДеятельностиНДС = Продажи.ВидДеятельностиНДС
	|			И Цены.АналитикаУчетаНоменклатуры = Продажи.АналитикаУчетаНоменклатуры
	|			И (НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов ИЛИ Цены.ВидЗапасов = Продажи.ВидЗапасов)
	|			И Цены.РазделУчета = Продажи.РазделУчета
	|
	|ГДЕ
	|	АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	Продажи.РазделУчета,
	|	Продажи.Партия,
	|	Продажи.АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА Продажи.РасчетПартий И Продажи.Количество = 0 И Продажи.ДопРасходыРегл <> 0
	|			ТОГДА Продажи.ДопРасходыРегл
	|		КОГДА ЕСТЬNULL(Цены.СтоимостьРегл + Цены.ДопРасходыРегл + Цены.ТрудозатратыРегл, 0) = 0
	|			ТОГДА Продажи.НДСРегл
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(Цены.СтоимостьРегл + Цены.ДопРасходыРегл + Цены.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|	) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 								   КАК Порядок,
	|	Партии.Период 					   КАК Период,
	|	Партии.Регистратор 				   КАК Регистратор,
	|	Партии.Регистратор 				   КАК ДокументДвижения,
	|	Партии.Организация 				   КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов 				   КАК ВидЗапасов,
	|	Партии.РазделУчета				   КАК РазделУчета,
	|	Партии.Партия				   	   КАК Партия,
	|	НЕОПРЕДЕЛЕНО	       			   КАК АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета   КАК АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи КАК АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи КАК ВидЗапасовДляСвязи,
	|
	|	СУММА(ВЫБОР КОГДА Партии.Стоимость < 0 ТОГДА -Партии.Стоимость
	|		ИНАЧЕ Партии.Стоимость КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСРегл КОНЕЦ) КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСУпр КОНЕЦ) КАК СтоимостьУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Стоимость <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.АналитикаУчетаНоменклатурыДляСвязи,
	|	Партии.ВидЗапасовДляСвязи
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|	ИЛИ СУММА(Партии.НДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	РазделУчета,
	|	Партия,
	|	АналитикаУчетаПартий,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|АналитикаУчетаНоменклатурыДляСвязи, ВидЗапасовДляСвязи,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов,
	|Подразделение, АналитикаУчетаПоПартнерам,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры,
	|НалогообложениеНДС, ДокументДвижения,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Стоимость, СтоимостьБезНДС, Количество,
	|ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, НДСРегл, НДСУпр, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|АналитикаУчетаНоменклатурыДляСвязи, ВидЗапасовДляСвязи,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.Партия = Выборка.Партия
		 И СтрокаОстатка.ВидДеятельностиНДС = Выборка.ВидДеятельностиНДС
		 И СтрокаОстатка.АналитикаУчетаНоменклатурыДляСвязи = Выборка.АналитикаУчетаНоменклатурыДляСвязи
		 И СтрокаОстатка.ВидЗапасовДляСвязи = Выборка.ВидЗапасовДляСвязи
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);

		КонецЕсли;
		
	КонецЦикла;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтПартии, ДвиженияПродаж, ВтРегистраторы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.19
Процедура СписатьОшибкиОкругленияРасчетаСебестоимости(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СписатьОшибкиОкругленияРасчетаСебестоимости");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	// Списываем только те остатки, в которых все "суммовые" ресурсы имеют значения, укладывающиеся в пределы погрешности. 
	// Если хоть один "суммовой" ресурс превышает величину погрешности, то такой остаток ошибкой округления не считаем.
	// Для регистра ПрочиеРасходы подход отличается: для него проверка ведется остатка для каждого ресурса по-отдельности.
	// Если какой-то ресурс укладывается в пределы погрешности, то списываем только его.
	
	// Списание ошибок округления в регистре СебестоимостьТоваров
	// Также создадим пустую временную таблицу ВТОкруглениеПрочиеРасходы для УТ - там не будет ошибок округления в регистре ПрочиеРасходы.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК ДокументДвижения,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|
	|	Себестоимость.Организация 					КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета 					КАК РазделУчета,
	|	Себестоимость.ВидЗапасов 					КАК ВидЗапасов,
	|	Себестоимость.Партия                        КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА Аналитика.Подразделение
	|		ИНАЧЕ Аналитика.СкладскаяТерритория.Подразделение
	|	КОНЕЦ 										КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости)	КАК СтатьяРасходовСписания,
	|	Аналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Себестоимость.Стоимость 					КАК Стоимость,
	|	Себестоимость.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
	|	Себестоимость.ДопРасходы 					КАК ДопРасходы,
	|	Себестоимость.ДопРасходыБезНДС 				КАК ДопРасходыБезНДС,
	|	Себестоимость.СтоимостьРегл 				КАК СтоимостьРегл,
	|	Себестоимость.ПостояннаяРазница 			КАК ПостояннаяРазница,
	|	Себестоимость.ВременнаяРазница 				КАК ВременнаяРазница,
	|	Себестоимость.СтоимостьЗабалансовая         КАК СтоимостьЗабалансовая,
	|	Себестоимость.Трудозатраты       		    КАК Трудозатраты,
	|	Себестоимость.ПостатейныеПостоянныеСНДС     КАК ПостатейныеПостоянныеСНДС,
	|	Себестоимость.ПостатейныеПостоянныеБезНДС   КАК ПостатейныеПостоянныеБезНДС,
	|	Себестоимость.ПостатейныеПеременныеСНДС     КАК ПостатейныеПеременныеСНДС,
	|	Себестоимость.ПостатейныеПеременныеБезНДС   КАК ПостатейныеПеременныеБезНДС,
	|	Себестоимость.СтоимостьЗабалансоваяРегл     КАК СтоимостьЗабалансоваяРегл,
	|	Себестоимость.ДопРасходыРегл                КАК ДопРасходыРегл,
	|	Себестоимость.ТрудозатратыРегл              КАК ТрудозатратыРегл,
	|	Себестоимость.ПостатейныеПостоянныеРегл     КАК ПостатейныеПостоянныеРегл,
	|	Себестоимость.ПостатейныеПеременныеРегл     КАК ПостатейныеПеременныеРегл,
	|	Себестоимость.СтоимостьУпр     				КАК СтоимостьУпр,
	|	Себестоимость.ДопРасходыУпр     			КАК ДопРасходыУпр,
	|	Себестоимость.ТрудозатратыУпр     			КАК ТрудозатратыУпр,
	|	Себестоимость.ПостатейныеПостоянныеУпр     	КАК ПостатейныеПостоянныеУпр,
	|	Себестоимость.ПостатейныеПеременныеУпр     	КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ВТОкруглениеСебестоимостьТоваров
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Себестоимость.АналитикаУчетаНоменклатуры
	|
	|ГДЕ
	|	Себестоимость.Количество = 0
	|	И (Себестоимость.Стоимость МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.СтоимостьБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ДопРасходы МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ДопРасходыБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.СтоимостьРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.СтоимостьУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.СтоимостьЗабалансовая МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.Трудозатраты МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПостоянныеСНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПостоянныеБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПеременныеСНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПеременныеБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.СтоимостьЗабалансоваяРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ДопРасходыРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ТрудозатратыРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ПостатейныеПостоянныеРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ПостатейныеПеременныеРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.СтоимостьУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ДопРасходыУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ТрудозатратыУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПостоянныеУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПеременныеУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ		 КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	0 			 КАК Сумма,
	|	0 			 КАК СуммаБезНДС,
	|	0 			 КАК СуммаРегл,
	|	0 			 КАК СуммаУпр,
	|	0 			 КАК ПостояннаяРазница,
	|	0 			 КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ         КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
	|	НЕОПРЕДЕЛЕНО КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК ПравилоОтнесенияНаВыпуск,
	|	0            КАК Стоимость,
	|	0            КАК СтоимостьБезНДС,
	|	0            КАК СтоимостьРегл,
	|	0            КАК СтоимостьУпр,
	|	0            КАК ПостояннаяРазница,
	|	0            КАК ВременнаяРазница,
	|	0            КАК ДоляСтоимости
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходыНЗП
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ         КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВидРезервов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектУчетаРезервов,
	|	0            КАК СуммаУпр,
	|	0            КАК СуммаРегл
	|ПОМЕСТИТЬ ВТОкруглениеРезервыПредстоящихРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.ДокументДвижения КАК ДокументДвижения,
	|	Т.Период КАК Период,
	|	Т.ВидДвижения КАК ВидДвижения,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.Подразделение КАК Подразделение,
	|	Т.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Стоимость КАК Стоимость,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.ДопРасходы КАК ДопРасходы,
	|	Т.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	Т.СтоимостьРегл КАК СтоимостьРегл,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	|	Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	Т.Трудозатраты КАК Трудозатраты,
	|	Т.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	Т.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	Т.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	Т.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	Т.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	Т.ДопРасходыРегл КАК ДопРасходыРегл,
	|	Т.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	Т.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	Т.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	Т.СтоимостьУпр КАК СтоимостьУпр,
	|	Т.ДопРасходыУпр КАК ДопРасходыУпр,
	|	Т.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	Т.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	Т.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр
	|ИЗ
	|	ВТОкруглениеСебестоимостьТоваров КАК Т
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя,
		Запрос,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	
	// Формирование кор. движений в регистре ПрочиеРасходы
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ДокументДвижения 																КАК ДокументДвижения,
	|	&КонецПериода 																	КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 											КАК ВидДвижения,
	|	Т.Организация 																	КАК Организация,
	|	Т.Подразделение																	КАК Подразделение,
	|	Т.НаправлениеДеятельности														КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяРасходов,
	|	СУММА(Т.Сумма) 																	КАК Сумма,
	|	СУММА(Т.СуммаРегл) 																КАК СуммаРегл,
	|	СУММА(Т.СуммаУпр) 																КАК СуммаУпр
	|ПОМЕСТИТЬ ВТКорДвиженияПрочиеРасходы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.ДокументДвижения 				 КАК ДокументДвижения,
	|		Т.Организация 					 КАК Организация,
	|		Т.Подразделение 				 КАК Подразделение,
	|		Т.НаправлениеДеятельности 		 КАК НаправлениеДеятельности,
	|		Т.Стоимость
	|			+ Т.ДопРасходы
	|			+ Т.Трудозатраты
	|			+ Т.ПостатейныеПостоянныеСНДС
	|			+ Т.ПостатейныеПеременныеСНДС КАК Сумма,
	|		Т.СтоимостьРегл
	|			+ Т.ДопРасходыРегл
	|			+ Т.ТрудозатратыРегл
	|			+ Т.ПостатейныеПостоянныеРегл
	|			+ Т.ПостатейныеПеременныеРегл КАК СуммаРегл,
	|		Т.СтоимостьУпр
	|			+ Т.ДопРасходыУпр
	|			+ Т.ТрудозатратыУпр
	|			+ Т.ПостатейныеПостоянныеУпр
	|			+ Т.ПостатейныеПеременныеУпр КАК СуммаУпр
	|	ИЗ
	|		ВТОкруглениеСебестоимостьТоваров КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения,
	|		Т.Организация,
	|		Т.Подразделение,
	|		Т.НаправлениеДеятельности,
	|		Т.Сумма,
	|		Т.СуммаРегл,
	|		Т.СуммаУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходы КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения,
	|		Т.Организация,
	|		Т.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|		Т.Стоимость,
	|		Т.СтоимостьРегл,
	|		Т.СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходыНЗП КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения,
	|		Т.Организация,
	|		Т.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|		Т.СуммаУпр,
	|		Т.СуммаРегл,
	|		Т.СуммаУпр
	|	ИЗ
	|		ВТОкруглениеРезервыПредстоящихРасходов КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности
	|
	|ИМЕЮЩИЕ
	|	СУММА(Т.Сумма) <> 0
	|	ИЛИ СУММА(Т.СуммаРегл) <> 0
	|	ИЛИ СУММА(Т.СуммаУпр) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.ДокументДвижения КАК ДокументДвижения,
	|	Т.Период КАК Период,
	|	Т.ВидДвижения КАК ВидДвижения,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.Сумма КАК Сумма,
	|	Т.СуммаРегл КАК СуммаРегл,
	|	Т.СуммаУпр КАК СуммаУпр
	|ИЗ
	|	ВТКорДвиженияПрочиеРасходы КАК Т
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя,
		Запрос,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя);
		
	// Корректировка движений по оборотным регистрам управленческого учета.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&КонецПериода 					КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакрытиеМесяца) КАК ХозяйственнаяОперация,
	|	Т.ДокументДвижения 				КАК ДокументДвижения,
	|	Т.Организация 					КАК Организация,
	|	Т.Подразделение 				КАК Подразделение,
	|	Т.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Т.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	Т.НаправлениеДеятельности		КАК КорНаправлениеДеятельности,
	|	Т.Склад 						КАК Склад,
	|	Т.ТипЗапасов 					КАК ТипЗапасов,
	|	Т.ВидЗапасов 					КАК ВидЗапасов,
	|	Т.СтатьяРасходовСписания 		КАК СтатьяРасходовСписания,
	|	Т.АналитикаРасходов 			КАК АналитикаРасходов,
	|	Т.ИсточникГФУНоменклатуры		КАК ИсточникГФУНоменклатуры,
	|	СУММА(Т.Стоимость) 				КАК Стоимость,
	|	СУММА(Т.СтоимостьБезНДС) 		КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьРегл) 			КАК СтоимостьРегл,
	|	СУММА(Т.СтоимостьУпр) 			КАК СтоимостьУпр
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		НЕОПРЕДЕЛЕНО 												КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		Т.АналитикаУчетаНоменклатуры 								КАК АналитикаУчетаНоменклатуры,
	|		АналитикаНоменклатуры.МестоХранения							КАК Склад,
	|		Т.ВидЗапасов.ТипЗапасов 									КАК ТипЗапасов,
	|		Т.ВидЗапасов 												КАК ВидЗапасов,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяРасходовСписания,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|				ТОГДА Т.ВидЗапасов
	|			ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|		КОНЕЦ 														КАК ИсточникГФУНоменклатуры,
	|		-(Т.Стоимость + Т.ДопРасходы)								КАК Стоимость,
	|		-(Т.СтоимостьБезНДС + Т.ДопРасходыБезНДС)					КАК СтоимостьБезНДС,
	|		-Т.СтоимостьРегл 											КАК СтоимостьРегл,
	|		-Т.СтоимостьУпр 											КАК СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеСебестоимостьТоваров КАК Т
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО Т.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		Т.Подразделение 											КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		Т.СтатьяРасходов 											КАК СтатьяДоходовРасходов,
	|		Т.АналитикаРасходов 										КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		-Т.Сумма 													КАК Стоимость,
	|		-Т.СуммаБезНДС 												КАК СтоимостьБезНДС,
	|		-Т.СуммаРегл 												КАК СтоимостьРегл,
	|		-Т.СуммаУпр 												КАК СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходы КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		Т.Подразделение 											КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		Т.СтатьяРасходов 											КАК СтатьяДоходовРасходов,
	|		Т.АналитикаРасходов 										КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		-Т.Стоимость												КАК Стоимость,
	|		-Т.СтоимостьБезНДС											КАК СтоимостьБезНДС,
	|		-Т.СтоимостьРегл											КАК СтоимостьРегл,
	|		-Т.СтоимостьУпр												КАК СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходыНЗП КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		НЕОПРЕДЕЛЕНО 												КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяДоходовРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		Т.Сумма 													КАК Стоимость,
	|		0 															КАК СтоимостьБезНДС,
	|		0 															КАК СтоимостьРегл,
	|		0 															КАК СтоимостьУпр
	|	ИЗ
	|		ВТКорДвиженияПрочиеРасходы КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.Склад,
	|	Т.ТипЗапасов,
	|	Т.ВидЗапасов,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.ИсточникГФУНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Т.Стоимость) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДС) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРегл) <> 0
	|		ИЛИ СУММА(Т.СтоимостьУпр) <> 0)";
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,, НСтр("ru='Регистры упр. учета'"));
	
	Пока Выборка.Следующий() Цикл
		СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, Выборка);
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТОкруглениеСебестоимостьТоваров, ВТОкруглениеПрочиеРасходы, ВТОкруглениеПрочиеРасходыНЗП, ВТОкруглениеРезервыПредстоящихРасходов, ВТКорДвиженияПрочиеРасходы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


// Этап 4.1
// Процедура выполняет распределение выручки и себестоимости продаж по направлениям деятельности.
// Параметры:
// НачалоПериода - дата, начало периода для сбора данных о продажах.
// КонецПериода - дата, окончание периода для сбора данных о продажах.
//
Процедура РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьВыручкуПоНаправлениямДеятельности");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыручкаИСебестоимость.Подразделение             		 КАК Подразделение,
	|	АналитикаПоПартнерам.Организация                		 КАК Организация,
	|	АналитикаПоПартнерам.Партнер                    		 КАК Партнер,
	|	АналитикаПоПартнерам.НаправлениеДеятельности      		 КАК НаправлениеДеятельности,
	|	АналитикаНоменклатуры.Номенклатура              		 КАК Номенклатура,
	|	СУММА(ВыручкаИСебестоимость.СуммаВыручки)				 КАК СуммаВыручки,
	|	СУММА(ВыручкаИСебестоимость.Стоимость
	|		+ ВыручкаИСебестоимость.ДопРасходы
	|		+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|		+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС
	|		+ ВыручкаИСебестоимость.Трудозатраты) КАК Себестоимость
	|ПОМЕСТИТЬ ВТТаблицаВыручки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|ГДЕ
	|	ВыручкаИСебестоимость.ТипЗапасов В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.Подразделение,
	|	АналитикаПоПартнерам.Организация,
	|	АналитикаПоПартнерам.Партнер,
	|	АналитикаПоПартнерам.НаправлениеДеятельности,
	|	АналитикаНоменклатуры.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВыручкаИСебестоимость.СуммаВыручки) <> 0
	|	ИЛИ СУММА(ВыручкаИСебестоимость.Стоимость + ВыручкаИСебестоимость.ДопРасходы) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВыручки.Подразделение               КАК Подразделение,
	|	ТаблицаВыручки.Организация                 КАК Организация,
	|	ТаблицаВыручки.Номенклатура                КАК Номенклатура,
	|	ТаблицаВыручки.Партнер                     КАК Партнер,
	|	ТаблицаВыручки.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ТаблицаВыручки.СуммаВыручки                КАК СуммаВыручки,
	|	ТаблицаВыручки.Себестоимость               КАК Себестоимость,
	|	НастройкаРаспределения.СпособРаспределения КАК СпособРаспределения,
	|	ВЫБОР
	|		КОГДА ТаблицаВыручки.Партнер = НастройкаРаспределения.Партнер ТОГДА
	|			1000
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Подразделение = НастройкаРаспределения.Подразделение ТОГДА
	|			100
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Номенклатура = НастройкаРаспределения.Номенклатура ТОГДА
	|			10
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Организация = НастройкаРаспределения.Организация ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                      КАК Приоритет
	|ПОМЕСТИТЬ ВтТаблицаРаспределения
	|
	|ИЗ
	|	ВТТаблицаВыручки КАК ТаблицаВыручки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности.СрезПоследних(
	|			&КонецПериода,
	|		) КАК НастройкаРаспределения
	|		ПО
	|			НастройкаРаспределения.Используется
	|			И ТаблицаВыручки.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			И (ТаблицаВыручки.Организация              = НастройкаРаспределения.Организация
	|				ИЛИ НастройкаРаспределения.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Партнер              = НастройкаРаспределения.Партнер
	|				ИЛИ НастройкаРаспределения.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Подразделение              = НастройкаРаспределения.Подразделение
	|				ИЛИ НастройкаРаспределения.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Номенклатура              = НастройкаРаспределения.Номенклатура
	|				ИЛИ НастройкаРаспределения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Подразделение,
	|	Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 								 КАК ДокументДвижения,
	|	&КонецПериода                                                        КАК Период,
	|	ТаблицаФинансовыхРезультатов.Организация                             КАК Организация,
	|	ТаблицаФинансовыхРезультатов.Подразделение                           КАК Подразделение,
	|	ТаблицаФинансовыхРезультатов.СпособРаспределения                     КАК СпособРаспределения,
	|	СУММА(ТаблицаФинансовыхРезультатов.СуммаВыручки)                     КАК СуммаВыручки,
	|	СУММА(ТаблицаФинансовыхРезультатов.Себестоимость)                    КАК Себестоимость,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ВыручкаОтПродаж)       КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.СебестоимостьПродаж)  КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			ТаблицаФинансовыхРезультатов.СпособРаспределения
	|		ИНАЧЕ
	|			СпособыРаспределения.НаправлениеДеятельности
	|	КОНЕЦ                                                                КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			1
	|		ИНАЧЕ
	|			ЕСТЬNULL(СпособыРаспределения.Коэффициент, 1)
	|	КОНЕЦ                                                                КАК КоэффициентРаспределения
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		ТаблицаРаспределения.Организация                   КАК Организация,
	|		ТаблицаРаспределения.Подразделение                 КАК Подразделение,
	|		СУММА(ТаблицаРаспределения.СуммаВыручки)           КАК СуммаВыручки,
	|		СУММА(ТаблицаРаспределения.Себестоимость)          КАК Себестоимость,
	|		ЕСТЬNULL(ТаблицаРаспределения.СпособРаспределения, НЕОПРЕДЕЛЕНО) КАК СпособРаспределения
	|	ИЗ
	|		ВтТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|	ГДЕ
	|		ТаблицаРаспределения.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		И ТаблицаРаспределения.Приоритет В
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(Таб.Приоритет) КАК Приоритет
	|				ИЗ
	|					ВтТаблицаРаспределения КАК Таб
	|				ГДЕ
	|					Таб.Организация        = ТаблицаРаспределения.Организация
	|					И Таб.Партнер            = ТаблицаРаспределения.Партнер
	|					И Таб.Подразделение      = ТаблицаРаспределения.Подразделение
	|					И Таб.Номенклатура         = ТаблицаРаспределения.Номенклатура)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРаспределения.Организация,
	|		ТаблицаРаспределения.Подразделение,
	|		ЕСТЬNULL(ТаблицаРаспределения.СпособРаспределения, НЕОПРЕДЕЛЕНО)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаРаспределения.Организация                   КАК Организация,
	|		ТаблицаРаспределения.Подразделение                 КАК Подразделение,
	|		СУММА(ТаблицаРаспределения.СуммаВыручки)           КАК СуммаВыручки,
	|		СУММА(ТаблицаРаспределения.Себестоимость)          КАК Себестоимость,
	|		ТаблицаРаспределения.НаправлениеДеятельности       КАК СпособРаспределения
	|	ИЗ
	|		ВтТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|	ГДЕ
	|		ТаблицаРаспределения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРаспределения.Организация,
	|		ТаблицаРаспределения.Подразделение,
	|		ТаблицаРаспределения.НаправлениеДеятельности
	|
	|	) КАК ТаблицаФинансовыхРезультатов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.СпособыРаспределенияПоНаправлениямДеятельности.НаправленияДеятельности КАК СпособыРаспределения
	|		ПО ТаблицаФинансовыхРезультатов.СпособРаспределения = СпособыРаспределения.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|		ПО ТаблицаФинансовыхРезультатов.Организация = ДокументыРасчетаСебестоимости.Организация
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДокументыРасчетаСебестоимости.Ссылка,
	|	ТаблицаФинансовыхРезультатов.Организация,
	|	ТаблицаФинансовыхРезультатов.Подразделение,
	|	ТаблицаФинансовыхРезультатов.СпособРаспределения,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			ТаблицаФинансовыхРезультатов.СпособРаспределения
	|		ИНАЧЕ
	|			СпособыРаспределения.НаправлениеДеятельности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			1
	|		ИНАЧЕ
	|			ЕСТЬNULL(СпособыРаспределения.Коэффициент, 1)
	|	КОНЕЦ
	|
	|ИТОГИ
	|	МАКСИМУМ(СуммаВыручки),
	|	МАКСИМУМ(Себестоимость),
	|	СУММА(КоэффициентРаспределения)
	|
	|ПО
	|	Организация,
	|	Подразделение,
	|	СпособРаспределения
	|";
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ФинансовыеРезультаты.Имя;
	
	РезультатЗапроса = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаПодразделение = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
		
		Пока ВыборкаПодразделение.Следующий() Цикл
			
			ВыборкаСпособыРаспределения = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СпособРаспределения");
			
			Пока ВыборкаСпособыРаспределения.Следующий() Цикл
				
				ВсегоДолей            = ВыборкаСпособыРаспределения.КоэффициентРаспределения;
				РасходыКРаспределению = ВыборкаСпособыРаспределения.Себестоимость;
				ДоходыКРаспределению  = ВыборкаСпособыРаспределения.СуммаВыручки;
				
				ВыборкаДетали = ВыборкаСпособыРаспределения.Выбрать(ОбходРезультатаЗапроса.Прямой);
				
				ПротоколРасчетаПартийИСебестоимости.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
					ПараметрыРасчета,
					ВыборкаДетали.Количество());
				
				Пока ВыборкаДетали.Следующий() Цикл

					Если ВсегоДолей <> 0 Тогда
						Расходы = Окр(РасходыКРаспределению * ВыборкаДетали.КоэффициентРаспределения / ВсегоДолей,
										2, РежимОкругления.Окр15как20);
					Иначе
						Расходы = 0;
					КонецЕсли;

					Если ВсегоДолей <> 0 Тогда
						Доходы = Окр(ДоходыКРаспределению * ВыборкаДетали.КоэффициентРаспределения / ВсегоДолей,
										2, РежимОкругления.Окр15как20);
					Иначе
						Доходы = 0;
					КонецЕсли;

					РасходыКРаспределению = РасходыКРаспределению - Расходы;
					ДоходыКРаспределению  = ДоходыКРаспределению  - Доходы;
					ВсегоДолей            = ВсегоДолей            - ВыборкаДетали.КоэффициентРаспределения;

					// Формирование движений по финансовому результату.
					ДанныеДвижения = Новый Структура(
						"Период, ДокументДвижения, Организация, Подразделение, НаправлениеДеятельности, СпособРаспределения");
					
					ЗаполнитьЗначенияСвойств(ДанныеДвижения, ВыборкаДетали);
					
					Если Доходы <> 0 Тогда
						ДанныеДвижения.Вставить("Доходы", 		 Доходы);
						ДанныеДвижения.Вставить("СтатьяДоходов", ВыборкаДетали.СтатьяДоходов);
					КонецЕсли;

					Если Расходы <> 0 Тогда
						ДанныеДвижения.Вставить("Расходы", 		  Расходы);
						ДанныеДвижения.Вставить("СтатьяРасходов", ВыборкаДетали.СтатьяРасходов);
					КонецЕсли;
					
					Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТТаблицаВыручки, ВтТаблицаРаспределения");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);

КонецПроцедуры

// Этап 4.3
Процедура ОтразитьПрибылиИУбытки(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ОтразитьПрибылиИУбытки");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Организация				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности 	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица1
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период 								КАК Период,
	|		АналитикаПоПартнерам.Организация                			КАК Организация,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВЫБОР КОГДА ВыручкаИСебестоимость.ТипЗапасов В (
	|			Значение(Перечисление.ТипыЗапасов.Товар),
	|			Значение(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА
	|			ВыручкаИСебестоимость.СуммаВыручки
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ 														КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|				ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Организация				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности 	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 						  КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период 							  КАК Период,
	|		АналитикаПоПартнерам.Организация 						  КАК Организация,
	|		ВыручкаИСебестоимость.Подразделение						  КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельности,
	|		ВЫБОР КОГДА ВыручкаИСебестоимость.ТипЗапасов В (
	|			Значение(Перечисление.ТипыЗапасов.Товар),
	|			Значение(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА
	|			ВыручкаИСебестоимость.Стоимость
	|			+ ВыручкаИСебестоимость.ДопРасходы
	|			+ ВыручкаИСебестоимость.Трудозатраты
	|			+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|			+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС
	|		ИНАЧЕ
	|			ВыручкаИСебестоимость.ДопРасходы
	|		КОНЕЦ 													  КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|				ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица2
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.СуммаВыручки							КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|			<> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Стоимость
	|			+ ВыручкаИСебестоимость.ДопРасходы 
	|			+ ВыручкаИСебестоимость.Трудозатраты
	|			+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|			+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.СуммаВыручки							КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ВыручкаИСебестоимость.Активность
	|		И ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|			<> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ АналитикаПоПартнерам.Организация В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Стоимость
	|			+ ВыручкаИСебестоимость.ДопРасходы
	|			+ ВыручкаИСебестоимость.Трудозатраты
	|			+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|			+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ВыручкаИСебестоимость.Активность
	|		И ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ АналитикаПоПартнерам.Организация В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)	 КАК ВидДвижения,
	|	ПрочиеДоходы.Регистратор				 КАК ДокументДвижения,
	|	ПрочиеДоходы.Период						 КАК Период,
	|	ПрочиеДоходы.Организация				 КАК Организация,
	|	ПрочиеДоходы.Подразделение				 КАК Подразделение,
	|	ПрочиеДоходы.НаправлениеДеятельности	 КАК НаправлениеДеятельности,
	|	СУММА(ПрочиеДоходы.Сумма)				 КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица3
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеДоходы КАК ПрочиеДоходы
	|ГДЕ
	|	НЕ &ФормироватьФинансовыйРезультат
	|	И ПрочиеДоходы.РасчетСебестоимости
	|	И НЕ ПрочиеДоходы.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеДоходы.Регистратор,
	|	ПрочиеДоходы.Период,
	|	ПрочиеДоходы.Организация,
	|	ПрочиеДоходы.Подразделение,
	|	ПрочиеДоходы.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)	  КАК ВидДвижения,
	|	ПрочиеРасходы.Регистратор				  КАК ДокументДвижения,
	|	ПрочиеРасходы.Период					  КАК Период,
	|	ПрочиеРасходы.Организация				  КАК Организация,
	|	ПрочиеРасходы.Подразделение				  КАК Подразделение,
	|	ПрочиеРасходы.НаправлениеДеятельности	  КАК НаправлениеДеятельности,
	|	СУММА(ПрочиеРасходы.Сумма) 			      КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица4
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	НЕ &ФормироватьФинансовыйРезультат
	|	И ПрочиеРасходы.РасчетСебестоимости
	|	И НЕ ПрочиеРасходы.СлужебноеВидДвиженияПриход
	|	И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходы.Регистратор,
	|	ПрочиеРасходы.Период,
	|	ПрочиеРасходы.Организация,
	|	ПрочиеРасходы.Подразделение,
	|	ПрочиеРасходы.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДанныеДвижений.ДокументДвижения 	 								  КАК ДокументДвижения,
	|	ДанныеДвижений.Период				 								  КАК Период,
	|	ДанныеДвижений.Организация			 								  КАК Организация,
	|	ДанныеДвижений.Подразделение			 							  КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО			 											  КАК Аналитика,
	|	ДанныеДвижений.НаправлениеДеятельности			 					  КАК НаправлениеДеятельности,
	|	ДанныеДвижений.ВидДвижения			 								  КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки) КАК Статья,
	|	СУММА(ДанныеДвижений.Сумма)			 								  КАК Сумма
	|ИЗ
	|
	|	(ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица1 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица2 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица3 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица4 КАК Т
	|
	|	) КАК ДанныеДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДвижений.ДокументДвижения,
	|	ДанныеДвижений.Период,
	|	ДанныеДвижений.Организация,
	|	ДанныеДвижений.Подразделение,
	|	ДанныеДвижений.НаправлениеДеятельности,
	|	ДанныеДвижений.ВидДвижения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеДвижений.Сумма) <> 0
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя,
		Запрос);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТПромежуточнаяТаблица1, ВТПромежуточнаяТаблица2, ВТПромежуточнаяТаблица3, ВТПромежуточнаяТаблица4");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 4.4
Процедура ОтразитьВУправленческомБалансе(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ОтразитьВУправленческомБалансе");
	
	// Дополним перечень измененных документов документами внеоборотных активов.
	// Для полученного перечня документов установим признак необходимости повторного отражения в учете.
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ТекстЗапросаУправленческогоБаланса
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыОрганизаций.АналитикаРасходов КАК Объект
	|ПОМЕСТИТЬ ВТВнеоборотныеАктивы
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТоварыОрганизаций.Активность
	|	И ТоварыОрганизаций.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	И ТоварыОрганизаций.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СебестоимостьТоваров.АналитикаРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|ГДЕ
	|	СебестоимостьТоваров.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.КорВидЗапасов КАК КорВидЗапасов,
	|	Т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.Стоимость КАК Стоимость,
	|	Т.ДопРасходы КАК ДопРасходы,
	|	Т.Трудозатраты КАК Трудозатраты,
	|	Т.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	Т.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости
	|ПОМЕСТИТЬ ВТСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЗапасов,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТПрочиеДоходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеДоходы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.Сумма КАК Сумма,
	|	Т.СуммаУпр КАК СуммаУпр
	|ПОМЕСТИТЬ ВТПрочиеРасходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТПартииПрочихРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК Т
	|ГДЕ
	|	Т.Стоимость <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Статья КАК Статья,
	|	Т.Аналитика КАК Аналитика,
	|	Т.Сумма КАК Сумма,
	|	Т.ВидИсточника КАК ВидИсточника,
	|	Т.Источник КАК Источник,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости
	|ПОМЕСТИТЬ ВТАктивыПассивы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеАктивыПассивы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыКОтражению.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ ДокументыКОтражению
	|ИЗ
	|	(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СебестоимостьТоваров.Регистратор КАК Ссылка
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		НЕ(СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПартииПрочихРасходов.Регистратор
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.Регистратор) <> ТИП(Документ.СчетФактураНалоговыйАгент)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеАктивыПассивы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ГДЕ
	|		ПрочиеАктивыПассивы.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеДоходы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеДоходы КАК ПрочиеДоходы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеРасходы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеРасходы КАК ПрочиеРасходы
	|
	|) КАК ДокументыКОтражению
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";
	#КонецОбласти
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ДокументыКОтражению");
	
	Если УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ДокументыКОтражению") > 0 Тогда
		
		// Передадим временную таблицу ДокументыКОтражению
		ПараметрыДвижений = Новый Структура;
		ПараметрыДвижений.Вставить("ВидОтложенногоРасчета", Перечисления.ВидыИсточниковУправленческогоБаланса.РасчетСебестоимости);
		ПараметрыДвижений.Вставить("ДокументыКОтражению",   ПараметрыРасчета.МенеджерВременныхТаблиц);
		ПараметрыДвижений.Вставить("Период", ПараметрыРасчета.РасчетныйПериод.НачалоПериода);
		ПараметрыДвижений.Вставить("ИмяВременнойТаблицыРезультата", "ВТДвиженияАктивыПассивы");
		
		ЗапросДвижений = УправленческийУчетПроведениеСервер.ЗапросДвиженийАктивовПассивов(ПараметрыДвижений);
		
		#Область ВычтемОнлайновыеДвижения
		ТекстВычитания = 
		"ВЫБРАТЬ
		|	Т.ВидДвижения КАК ВидДвижения,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.Статья КАК Статья,
		|	Т.Аналитика КАК Аналитика,
		|	Т.Сумма КАК Сумма,
		|	Т.ВидИсточника КАК ВидИсточника,
		|	Т.Источник КАК Источник,
		|	Т.РасчетСебестоимости КАК РасчетСебестоимости
		|ПОМЕСТИТЬ ВТГруппировкаАктивыПассивы
		|ИЗ
		|	ВТДвиженияАктивыПассивы КАК Т
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
		|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.Статья КАК Статья,
		|	Т.Аналитика КАК Аналитика,
		|	-Т.Сумма КАК Сумма,
		|	Т.ВидИсточника КАК ВидИсточника,
		|	Т.Источник КАК Источник,
		|	Т.РасчетСебестоимости КАК РасчетСебестоимости
		|ИЗ
		|	ВТКэшРасчетныеОборотыПрочиеАктивыПассивы КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
		|	ПО Т.Регистратор = ДокументыКОтражению.Регистратор
		|ГДЕ
		|	Т.Сумма <> 0
		|	И НЕ Т.РасчетСебестоимости
		|	И Т.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковУправленческогоБаланса.РасчетСебестоимости)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ВидДвижения КАК ВидДвижения,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.Статья КАК Статья,
		|	Т.Аналитика КАК Аналитика,
		|	СУММА(Т.Сумма) КАК Сумма,
		|	Т.ВидИсточника КАК ВидИсточника,
		|	Т.Источник КАК Источник,
		|	МИНИМУМ(Т.РасчетСебестоимости) КАК РасчетСебестоимости,
		|	Т.Регистратор КАК ДокументДвижения
		|ИЗ
		|	ВТГруппировкаАктивыПассивы КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ВидДвижения,
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.НаправлениеДеятельности,
		|	Т.Статья,
		|	Т.Аналитика,
		|	Т.ВидИсточника,
		|	Т.Источник
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.Сумма) <> 0";
		ЗапросДвижений.Текст = ЗапросДвижений.Текст + ТекстВычитания;
		#КонецОбласти
		
		УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
			ПараметрыРасчета,
			Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя,
			ЗапросДвижений);
			
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
			ЗапросДвижений.Параметры.ИменаВременныхТаблиц);
		
	КонецЕсли;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ДокументыКОтражению, ВТВнеоборотныеАктивы, ВТСебестоимость, ВТПрочиеДоходы, ВТПрочиеРасходы, ВТПартииПрочихРасходов, "
		+ "ВТТрудозатратыНЗП, ВТПрочиеРасходыНЗП, ВТАктивыПассивы, ВТГруппировкаАктивыПассивы, ВТДвиженияАктивыПассивы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 4.5
Процедура РаспределитьРасходыБудущихПериодов(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьРасходыБудущихПериодов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьРегл,
	|	
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл
	|
	|ПОМЕСТИТЬ ВтРаспределенияРБП
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО Статья.Ссылка = ДД.СтатьяРасходов
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности
	|;
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Расходы.Организация КАК Организация,
	|	Расходы.Подразделение КАК Подразделение,
	|	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	|	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА Распределение.РаспределитьУпр ТОГДА Расходы.Сумма
	|		ИНАЧЕ 0 КОНЕЦ) КАК Сумма,
	|	(ВЫБОР
	|		КОГДА Распределение.РаспределитьУпр ТОГДА Расходы.СуммаУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	|	(ВЫБОР
	|		КОГДА Распределение.РаспределитьРегл ТОГДА Расходы.СуммаРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	(ВЫБОР
	|		КОГДА Распределение.РаспределитьРегл ТОГДА Расходы.ПостояннаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостояннаяРазница,
	|	(ВЫБОР
	|		КОГДА Распределение.РаспределитьРегл ТОГДА Расходы.ВременнаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ВременнаяРазница,
	|
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	Распределение.ДоляСтоимостиУпр КАК ДоляСтоимостиУпр,
	|	Распределение.ДоляСтоимостиРегл КАК ДоляСтоимостиРегл,
	|	ДАТАВРЕМЯ(1,1,1) КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовПолучатель
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРаспределенияРБП КАК Распределение
	|		ПО Распределение.Организация = Расходы.Организация
	|		И Распределение.Подразделение = Расходы.Подразделение
	|		И Распределение.СтатьяРасходов = Расходы.СтатьяРасходов
	|		И Распределение.АналитикаРасходов = Расходы.АналитикаРасходов
	|		И Распределение.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|ГДЕ
	|	Расходы.СлужебноеВидДвиженияПриход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	0 КАК Сумма,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	ДД.Ссылка КАК ДокументДвижения,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл,
	|	Строки.Дата КАК Период,
	|	Строки.Подразделение КАК ПодразделениеПолучатель,
	|	Строки.СтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	Строки.АналитикаРасходов КАК АналитикаРасходовПолучатель
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение,
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	НаправлениеДеятельности,
	|	Порядок ВОЗР,
	|	ДокументДвижения,
	|	Период ВОЗР
	|";
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	СтрокаОстатка = Новый Структура;
	СуммовыеРесурсы = Новый Структура;
	
	Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл
		СтрокаОстатка.Вставить(Колонка.Имя);
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			СуммовыеРесурсы.Вставить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.Подразделение = Выборка.Подразделение
		 И СтрокаОстатка.СтатьяРасходов = Выборка.СтатьяРасходов
		 И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
		 И СтрокаОстатка.НаправлениеДеятельности = Выборка.НаправлениеДеятельности Тогда
		
		 	Если СтрокаОстатка.ДоляСтоимостиУпр <= Выборка.ДоляСтоимостиУпр Тогда
			    ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "Сумма, СуммаУпр");
				СтрокаОстатка.ДоляСтоимостиУпр = 0;
			Иначе
				Если СтрокаОстатка.ДоляСтоимостиУпр <> 0 Тогда
					СуммовыеРесурсы.Сумма = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.Сумма / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
					СуммовыеРесурсы.СуммаУпр = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.СуммаУпр / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиУпр = СтрокаОстатка.ДоляСтоимостиУпр - Выборка.ДоляСтоимостиУпр;
			КонецЕсли;
				
			Если СтрокаОстатка.ДоляСтоимостиРегл <= Выборка.ДоляСтоимостиРегл Тогда
				ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "СуммаРегл, ПостояннаяРазница, ВременнаяРазница");
				СтрокаОстатка.ДоляСтоимостиРегл = 0;
			Иначе	
				Если СтрокаОстатка.ДоляСтоимостиРегл <> 0 Тогда
					СуммовыеРесурсы.СуммаРегл = 
						Окр(Выборка.ДоляСтоимостиРегл * СтрокаОстатка.СуммаРегл / СтрокаОстатка.ДоляСтоимостиРегл, 2, 1);
					СуммовыеРесурсы.ПостояннаяРазница = 
						Окр(Выборка.ДоляСтоимостиРегл * СтрокаОстатка.ПостояннаяРазница / СтрокаОстатка.ДоляСтоимостиРегл, 2, 1);
					СуммовыеРесурсы.ВременнаяРазница = 
						Окр(Выборка.ДоляСтоимостиРегл * СтрокаОстатка.ВременнаяРазница / СтрокаОстатка.ДоляСтоимостиРегл, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиРегл = СтрокаОстатка.ДоляСтоимостиРегл - Выборка.ДоляСтоимостиРегл;
			КонецЕсли;
			
			СтрокаОстатка.Сумма = СтрокаОстатка.Сумма - СуммовыеРесурсы.Сумма;
			СтрокаОстатка.СуммаУпр = СтрокаОстатка.СуммаУпр - СуммовыеРесурсы.СуммаУпр;
			СтрокаОстатка.СуммаРегл = СтрокаОстатка.СуммаРегл - СуммовыеРесурсы.СуммаРегл;
			СтрокаОстатка.ПостояннаяРазница = СтрокаОстатка.ПостояннаяРазница - СуммовыеРесурсы.ПостояннаяРазница;
			СтрокаОстатка.ВременнаяРазница = СтрокаОстатка.ВременнаяРазница - СуммовыеРесурсы.ВременнаяРазница;
			
			// Формируются движения по регистрам:
			// - ПрочиеРасходы
			СформироватьДвиженияРаспределениеРБП(ПараметрыРасчета, Выборка, СуммовыеРесурсы);
		КонецЕсли;
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтРаспределенияРБП");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаВтТаблицаРасходовПоОстаткам()
	
	ТекстЗапроса = "
	| ВЫБРАТЬ
	|	ТаблицаРасходы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.Подразделение КАК Подразделение,
	|	ТаблицаРасходы.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаРасходы.ПравилоРаспределения КАК ПравилоРаспределения,
	|	ТаблицаРасходы.Сумма КАК Сумма,
	|	ТаблицаРасходы.СуммаБезНДС КАК СуммаБезНДС,
	|	ТаблицаРасходы.СуммаРегл КАК СуммаРегл,
	|	ТаблицаРасходы.СуммаУпр КАК СуммаУпр,
	|	ТаблицаРасходы.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ТаблицаРасходы.ВременнаяРазница КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ ВтТаблицаРасходов
	|ИЗ
	|	&ТаблицаРасходов КАК ТаблицаРасходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаСпособовРаспределения()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.ПравилоРаспределения КАК ПравилоРаспределения,
	|	ТаблицаРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ВЫБОР КОГДА ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	ТОГДА
	|		Ложь
	|	ИНАЧЕ
	|		Истина
	|	КОНЕЦ КАК АналитикаЗаполнена,
	|	МАКСИМУМ(ТаблицаРасходы.НомерСтроки) КАК ИндексБазы
	|ПОМЕСТИТЬ ТаблицаСпособовРаспределения
	|ИЗ
	|	ВтТаблицаРасходов КАК ТаблицаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.ПравилоРаспределения,
	|	ТаблицаРасходы.АналитикаРасходов,
	|	ВЫБОР КОГДА ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	ТОГДА
	|		Ложь
	|	ИНАЧЕ
	|		Истина
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаДокументов()
	
	ТекстЗапроса = "
	// Приобретение товаров по конкретным документам закупки или по заказам поставщикам.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТовары
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаЗаполнена
	|		И (ДанныеДокумента.Ссылка = ТаблицаСпособовРаспределения.АналитикаРасходов
	|       	ИЛИ ТаблицаТовары.ЗаказПоставщику = ТаблицаСпособовРаспределения.АналитикаРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Приобретения товаров по любым документам закупки.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТовары
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ТаблицаТовары.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		И ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Перемещения товаров по конкретным документам перемещения или по заказам на перемещение.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаЗаполнена
	|		И (ДанныеДокумента.Ссылка = ТаблицаСпособовРаспределения.АналитикаРасходов
	|       	ИЛИ ДанныеДокумента.ЗаказНаПеремещение = ТаблицаСпособовРаспределения.АналитикаРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Перемещения товаров по любым документам перемещения или по любым заказам на перемещение.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДанныеДокумента.ЗаказНаПеремещение <> ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка) И ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Передачи товаров между организациями.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаСпособовРаспределения.АналитикаРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаПоступленияТоваров()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.КоличествоОстаток КАК Количество,
	|	УчетСебестоимости.СтоимостьОстаток КАК Стоимость
	|ПОМЕСТИТЬ ВтПоступленияТоваров
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|		РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|		И Организация В(&МассивОрганизаций)
	|	) КАК УчетСебестоимости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров ТОГДА
	|			0
	|		ИНАЧЕ
	|			УчетСебестоимости.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров ТОГДА
	|			0
	|		ИНАЧЕ
	|			УчетСебестоимости.Стоимость
	|		КОНЕЦ
	|	) КАК Стоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|ГДЕ
	|	УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И (УчетСебестоимости.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.СборкаТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров ТОГДА
	|			0
	|		ИНАЧЕ
	|			УчетСебестоимости.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров ТОГДА
	|			0
	|		ИНАЧЕ
	|			УчетСебестоимости.Стоимость
	|		КОНЕЦ
	|	) КАК Стоимость
	|ИЗ
	|	ВТПромежуточнаяСебестоимостьТоваров КАК УчетСебестоимости
	|ГДЕ
	|	УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И (УчетСебестоимости.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.СборкаТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.ИндексБазы КАК ИндексБазы,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(УчетСебестоимости.Количество) КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость) КАК Стоимость
	|ПОМЕСТИТЬ ТаблицаПоступленияТоваров
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК УчетСебестоимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|			ПО УчетСебестоимости.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|ГДЕ
	// движения прошлых периодов
	|	УчетСебестоимости.Период < &НачалоПериода
	|	И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И УчетСебестоимости.Активность
	|	И УчетСебестоимости.Организация В (&МассивОрганизаций)
	|	И (УчетСебестоимости.АналитикаУчетаНоменклатуры, УчетСебестоимости.ВидЗапасов) В (
	|		ВЫБРАТЬ
	|       	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры,
	|           ВтПоступленияТоваров.ВидЗапасов
	|		ИЗ
	|			ВтПоступленияТоваров КАК ВтПоступленияТоваров
	|		)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.ИндексБазы,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.ИндексБазы КАК ИндексБазы,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(УчетСебестоимости.Количество) КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость) КАК Стоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|			ПО УчетСебестоимости.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|ГДЕ
	|	УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И (УчетСебестоимости.АналитикаУчетаНоменклатуры, УчетСебестоимости.ВидЗапасов) В (
	|		ВЫБРАТЬ
	|       	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры,
	|           ВтПоступленияТоваров.ВидЗапасов
	|		ИЗ
	|			ВтПоступленияТоваров КАК ВтПоступленияТоваров
	|		)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.ИндексБазы,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.ИндексБазы КАК ИндексБазы,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(УчетСебестоимости.Количество) КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость) КАК Стоимость
	|ИЗ
	|	ВТПромежуточнаяСебестоимостьТоваров КАК УчетСебестоимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|			ПО УчетСебестоимости.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|ГДЕ
	|	УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И (УчетСебестоимости.АналитикаУчетаНоменклатуры, УчетСебестоимости.ВидЗапасов) В (
	|		ВЫБРАТЬ
	|       	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры,
	|           ВтПоступленияТоваров.ВидЗапасов
	|		ИЗ
	|			ВтПоступленияТоваров КАК ВтПоступленияТоваров
	|		)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.ИндексБазы,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы,
	|	ВтПоступленияТоваров.Организация КАК Организация,
	|	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВтПоступленияТоваров.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(ВтПоступленияТоваров.Количество) КАК Количество,
	|	СУММА(ВтПоступленияТоваров.Стоимость) КАК Стоимость
	|ИЗ
	|	ВтПоступленияТоваров КАК ВтПоступленияТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО ВтПоступленияТоваров.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|			ПО ВтПоступленияТоваров.Организация = ТаблицаСпособовРаспределения.Организация
	|			И (ТаблицаСпособовРаспределения.АналитикаРасходов = АналитикаНоменклатуры.МестоХранения
	|				ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = АналитикаНоменклатуры.Номенклатура
	|				ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСпособовРаспределения.ИндексБазы,
	|	ВтПоступленияТоваров.Организация,
	|	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры,
	|	ВтПоступленияТоваров.ВидЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИндексБазы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаБазыРаспределения()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы,
	|	ТаблицаСпособовРаспределения.Организация КАК Организация,
	|	ТаблицаСпособовРаспределения.ПравилоРаспределения КАК ПравилоРаспределения,
	|	ТаблицаСпособовРаспределения.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаПоступленияТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаПоступленияТоваров.ВидЗапасов КАК ВидЗапасов,
	|	ВЫБОР КОГДА ТаблицаСпособовРаспределения.ПравилоРаспределения
	|		= ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноКоличеству)
	|	ТОГДА
	|		ЕСТЬNULL(ТаблицаПоступленияТоваров.Количество, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаПоступленияТоваров.Стоимость, 0)
	|	КОНЕЦ КАК База
	|
	|ИЗ
	|	ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаПоступленияТоваров КАК ТаблицаПоступленияТоваров
	|	ПО
	|		ТаблицаСпособовРаспределения.ИндексБазы = ТаблицаПоступленияТоваров.ИндексБазы
	|		И ТаблицаСпособовРаспределения.Организация = ТаблицаПоступленияТоваров.Организация
	|ИТОГИ
	|	СУММА(База)
	|ПО
	|	ИндексБазы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаРасходов()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаРасходы.НомерСтроки) КАК НомерСтроки,
	|	&КонецПериода КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.Подразделение КАК Подразделение,
	|	ТаблицаРасходы.СтатьяРасходов КАК СтатьяРасходовСписания,
	|	ТаблицаРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы,
	|	СУММА(ТаблицаРасходы.Сумма) КАК Сумма,
	|	СУММА(ТаблицаРасходы.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ТаблицаРасходы.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаРасходы.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ТаблицаРасходы.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ТаблицаРасходы.ВременнаяРазница) КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика) КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТаблицаРасходов КАК ТаблицаРасходы
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаРасходы.ПравилоРаспределения = ТаблицаСпособовРаспределения.ПравилоРаспределения
	|		И ТаблицаРасходы.АналитикаРасходов = ТаблицаСпособовРаспределения.АналитикаРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.Подразделение,
	|	ТаблицаРасходы.СтатьяРасходов,
	|	ТаблицаРасходы.АналитикаРасходов,
	|	ТаблицаСпособовРаспределения.ИндексБазы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции


// Служебная, этап 3.7
Функция ТекстЗапросаДвиженияСтоимости(ПараметрыРасчета)

	ТекстЗапроса = 
	"
	// В качестве вектора решений на первой итерации берутся свободные коэффициенты.
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                             	КАК НомерУзла,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_1 КАК ЧИСЛО(28,10))                КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_1 КАК ЧИСЛО(28,10))        		КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ТрудозатратыГраф_1 КАК ЧИСЛО(28,10))  			КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПостоянныеГраф_1 КАК ЧИСЛО(28,10))  	КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПеременныеГраф_1 КАК ЧИСЛО(28,10))    КАК ПостатейныеПеременныеГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая КАК ЧИСЛО(28,10))      	КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостояннаяРазница КАК ЧИСЛО(28,10))          	КАК ПостояннаяРазница,
	|	УзлыКорректировки.ПостояннаяРазницаЗнак                                 	КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВременнаяРазница КАК ЧИСЛО(28,10))           	КАК ВременнаяРазница,
	|	УзлыКорректировки.ВременнаяРазницаЗнак                                  	КАК ВременнаяРазницаЗнак,
	|	УзлыКорректировки.СтоимостьЗнакГраф_1                                       КАК СтоимостьЗнакГраф_1,
	
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_2 КАК ЧИСЛО(28,10))   				КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_2 КАК ЧИСЛО(28,10))   			КАК ДопРасходыГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ТрудозатратыГраф_2 КАК ЧИСЛО(28,10))   			КАК ТрудозатратыГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПостоянныеГраф_2 КАК ЧИСЛО(28,10))   	КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПеременныеГраф_2 КАК ЧИСЛО(28,10))   	КАК ПостатейныеПеременныеГраф_2,
	|	УзлыКорректировки.СтоимостьЗнакГраф_2                                      	КАК СтоимостьЗнакГраф_2
	|ПОМЕСТИТЬ ВтТаблицаРешений
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// Подготовим таблицу списаний за период (коэффициенты уравнения)
	|ВЫБРАТЬ
	|	УчетСебестоимости.НомерУзлаИсточник 				КАК НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник 				КАК НомерУзлаПриемник,
	|	ЛОЖЬ 												КАК ПередачаВЭксплуатацию,
	|	ИСТИНА												КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 												КАК КосвенныеЗатратыНУ,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПостоянные)	КАК ПостатейныеПостоянныеГраф_1,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПеременные)	КАК ПостатейныеПеременныеГраф_1,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПостоянные)	КАК ПостатейныеПостоянныеГраф_2,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПеременные)	КАК ПостатейныеПеременныеГраф_2,
	|	МАКСИМУМ(УчетСебестоимости.РаботаДляДавальца)		КАК РаботаДляДавальца,
	|	МАКСИМУМ(УчетСебестоимости.ПродукцияДавальца)		КАК ПродукцияДавальца,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_1)				КАК ВесДугиГраф_1,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_2)				КАК ВесДугиГраф_2
	|
	|ПОМЕСТИТЬ ВтПеремещенияСписания
	|ИЗ (
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет))
	|			ТОГДА УзлыКорректировкиПриемникРеглУчет.НомерУзла
	|		КОГДА УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|			УзлыКорректировкиПриемникПередачи.НомерУзла
	|		ИНАЧЕ
	|			УзлыКорректировкиПриемник.НомерУзла
	|		КОНЕЦ КАК НомерУзлаПриемник,
	|		УчетСебестоимости.Количество КАК ВесДугиГраф_1,
	|		УчетСебестоимости.Количество КАК ВесДугиГраф_2,
	|		ЛОЖЬ КАК ПостатейныеПостоянные,
	|		ЛОЖЬ КАК ПостатейныеПеременные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		(ВЫБОР
	|			КОГДА &ПартионныйУчетВерсии22 И
	|				(ЛОЖЬ
	|				) ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета               = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 				 = УзлыКорректировкиПриемник.Организация
	|			И УчетСебестоимости.КорОрганизация 				 = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемник.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникПередачи
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемникПередачи.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемникПередачи.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемникПередачи.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемникПередачи.Организация
	|			И УчетСебестоимости.КорОрганизация 				 <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И УчетСебестоимости.РазделУчета 				 <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемникПередачи.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемникПередачи.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемникПередачи.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемникПередачи.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникРеглУчет
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры 	 = УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 				 = УзлыКорректировкиПриемникРеглУчет.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемникРеглУчет.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация				 = УзлыКорректировкиПриемникРеглУчет.Организация
	|			И УчетСебестоимости.КорПартия 					 = УзлыКорректировкиПриемникРеглУчет.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий 	 = УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемникРеглУчет.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС 		 = УзлыКорректировкиПриемникРеглУчет.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И НЕ (УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			И УчетСебестоимости.Количество < 0
	|			И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL)
	|		И (УзлыКорректировкиПриемник.НомерУзла ЕСТЬ НЕ NULL
	|			ИЛИ УзлыКорректировкиПриемникПередачи.НомерУзла ЕСТЬ НЕ NULL
	|			ИЛИ УзлыКорректировкиПриемникРеглУчет.НомерУзла ЕСТЬ НЕ NULL)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		УчетСебестоимости.Количество		КАК ВесДугиГраф_1,
	|		УчетСебестоимости.Количество 		КАК ВесДугиГраф_2,
	|		ЛОЖЬ 								КАК ПостатейныеПостоянные,
	|		ЛОЖЬ 								КАК ПостатейныеПеременные,
	|		ЛОЖЬ 								КАК РаботаДляДавальца,
	|		ЛОЖЬ 								КАК ПродукцияДавальца
	|	ИЗ
	|		ВтПередачиТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 			  = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов 				  = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			  = УзлыКорректировкиИсточник.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемник.Организация
	|	ГДЕ
	|		УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	) КАК УчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник
	|";

	
	ТекстЗапроса = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции

// Служебная, этап 3.11
Функция ТекстЗапросаДвиженияСтоимостиРегл(ПараметрыРасчета)

	ТекстЗапроса = 
	"
	// В качестве вектора решений на первой итерации берутся свободные коэффициенты.
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                            		КАК НомерУзла,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_1 КАК ЧИСЛО(28,10))                КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_1 КАК ЧИСЛО(28,10))       		КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ТрудозатратыГраф_1 КАК ЧИСЛО(28,10))  			КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПостоянныеГраф_1 КАК ЧИСЛО(28,10))    КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПеременныеГраф_1 КАК ЧИСЛО(28,10))    КАК ПостатейныеПеременныеГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостояннаяРазница КАК ЧИСЛО(28,10))         		КАК ПостояннаяРазница,
	|	УзлыКорректировки.ПостояннаяРазницаЗнак                                		КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВременнаяРазница КАК ЧИСЛО(28,10))          		КАК ВременнаяРазница,
	|	УзлыКорректировки.ВременнаяРазницаЗнак                                 		КАК ВременнаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая КАК ЧИСЛО(28,10))     		КАК СтоимостьЗабалансовая,
	|	УзлыКорректировки.СтоимостьЗнакГраф_1                                       КАК СтоимостьЗнакГраф_1,
	
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_2 КАК ЧИСЛО(28,10))           		КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_2 КАК ЧИСЛО(28,10)) 				КАК ДопРасходыГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ТрудозатратыГраф_2 КАК ЧИСЛО(28,10))  			КАК ТрудозатратыГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПостоянныеГраф_2 КАК ЧИСЛО(28,10))   	КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеПеременныеГраф_2 КАК ЧИСЛО(28,10))   	КАК ПостатейныеПеременныеГраф_2,
	|	УзлыКорректировки.СтоимостьЗнакГраф_2                                     	КАК СтоимостьЗнакГраф_2
	|ПОМЕСТИТЬ ВтТаблицаРешений
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// Подготовим таблицу списаний за период (коэффициенты уравнения)
	|ВЫБРАТЬ
	|	УчетСебестоимости.НомерУзлаИсточник 			  		КАК НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник 			  		КАК НомерУзлаПриемник,
	|	УчетСебестоимости.ПередачаВЭксплуатацию           		КАК ПередачаВЭксплуатацию,
	|	МАКСИМУМ(УчетСебестоимости.ПринимаемыеВНУ)        		КАК ПринимаемыеВНУ,
	|	МАКСИМУМ(УчетСебестоимости.КосвенныеЗатратыНУ) 	  		КАК КосвенныеЗатратыНУ,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПостоянныеГраф_1)	КАК ПостатейныеПостоянныеГраф_1,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПеременныеГраф_1)	КАК ПостатейныеПеременныеГраф_1,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПостоянныеГраф_2)	КАК ПостатейныеПостоянныеГраф_2,
	|	МАКСИМУМ(УчетСебестоимости.ПостатейныеПеременныеГраф_2)	КАК ПостатейныеПеременныеГраф_2,
	|	МАКСИМУМ(УчетСебестоимости.РаботаДляДавальца)	  		КАК РаботаДляДавальца,
	|	МАКСИМУМ(УчетСебестоимости.ПродукцияДавальца)	  		КАК ПродукцияДавальца,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_1) 			  		КАК ВесДугиГраф_1,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_2) 			  		КАК ВесДугиГраф_2
	|ПОМЕСТИТЬ ВтПеремещенияСписания
	|ИЗ (
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_1,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_2,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ,
	|	ЛОЖЬ								  КАК ПостатейныеПостоянныеГраф_2,
	|	ЛОЖЬ								  КАК ПостатейныеПеременныеГраф_2,
	|	ЛОЖЬ								  КАК ПостатейныеПостоянныеГраф_1,
	|	ЛОЖЬ								  КАК ПостатейныеПеременныеГраф_1,
	|	ЛОЖЬ								  КАК РаботаДляДавальца,
	|	(ВЫБОР
	|		КОГДА &ПартионныйУчетВерсии22 И
	|			(ЛОЖЬ
	|			) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ПродукцияДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|		И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|		И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|		И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|		И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры   = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.КорРазделУчета 			  	 = УзлыКорректировкиПриемник.РазделУчета
	|		И УчетСебестоимости.КорВидЗапасов 			  	 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И УчетСебестоимости.Организация 			  	 = УзлыКорректировкиПриемник.Организация
	|		И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемник.Партия
	|		И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|		И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|		И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И УчетСебестоимости.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ (УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И УчетСебестоимости.Количество < 0
	|		И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_1,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_2,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ,
	|	ЛОЖЬ								  КАК ПостатейныеПостоянныеГраф_2,
	|	ЛОЖЬ								  КАК ПостатейныеПеременныеГраф_2,
	|	ЛОЖЬ								  КАК ПостатейныеПостоянныеГраф_1,
	|	ЛОЖЬ								  КАК ПостатейныеПеременныеГраф_1,
	|	ЛОЖЬ								  КАК РаботаДляДавальца,
	|	ЛОЖЬ								  КАК ПродукцияДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|		И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|		И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|		И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|		И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры   = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|		И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемник.Организация
	|		И УчетСебестоимости.КорПартия              	  	 = УзлыКорректировкиПриемник.Партия
	|		И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|		И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|		И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|	И УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	) КАК УчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник,
	|	УчетСебестоимости.ПередачаВЭксплуатацию
	|";
	
	ТекстЗапроса = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции


Функция УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса)
	
	// В запросах, выполняющих расчеты во временных таблицах, установим максимально возможную разрядность.
	
	СтараяРазрядность 			  = 28;
	СтараяРазрядностьДробнойЧасти = 10;
	НоваяРазрядность 			  = ПараметрыРасчета.РешениеСЛУ.РазрядностьДляРасчетов;
	НоваяРазрядностьДробнойЧасти  = СтараяРазрядностьДробнойЧасти;
	ОписаниеДенежногоПоля 		  = ОбщегоНазначенияУТ.РазрядностьДенежногоПоля();
	
	Если ОписаниеДенежногоПоля.Разрядность - ОписаниеДенежногоПоля.РазрядностьДробнойЧасти > 13 Тогда
		
		// Уменьшим разрядность дробной части при расчете.
		// Общую разрядность, установленную в настройках, изменять не будем - чтобы не вызвать ошибку переполнения поля.
		ИзмерениеРазрядности = ОписаниеДенежногоПоля.Разрядность - ОписаниеДенежногоПоля.РазрядностьДробнойЧасти - 13;
		НоваяРазрядностьДробнойЧасти = Макс(НоваяРазрядностьДробнойЧасти - ИзмерениеРазрядности, 0);
		
	КонецЕсли;
	
	Если СтараяРазрядность <> НоваяРазрядность ИЛИ СтараяРазрядностьДробнойЧасти <> НоваяРазрядностьДробнойЧасти Тогда
		
		ТекстРазрядность = "(" + СокрЛП(НоваяРазрядность) + "," + СокрЛП(НоваяРазрядностьДробнойЧасти) + ")";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(28,10)", ТекстРазрядность);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(28, 10)", ТекстРазрядность); // с пробелом
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(28,	10)", ТекстРазрядность); // с табуляцией
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ФормированиеДвижений

#Область ДвиженияНоменклатура

// Служебная, этап 2.1, 3.3, 3.14, 3.19
Процедура СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, ДанныеДвижения)
	
	ДанныеСумм = ПолучитьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеДвижения);
	
	Если ДанныеСумм.ЕстьНенулеваяПолнаяСумма Тогда
		
		// Формирование движений Номенклатура - Доходы\Расходы.
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакрытиеМесяца
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровУХранителя Тогда
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм);
			
		КонецЕсли;
		
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы Тогда
			
			Если ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка Тогда
				
				СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм);
				
			Иначе
				
				СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, -1, -1, -1, -1, 0);
				
				СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, СкорректированныеСуммы);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Формирование движений Номенклатура - Номенклатура.
		Если ((ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами)
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтПереработчика
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратПоКомиссииМеждуОрганизациями
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчика
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаОбособленногоУчета
			ИЛИ ((ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемПередачаРаботМеждуПодразделениями)
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВПроизводство
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПереработчику
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваров
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваров
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
				И ДанныеДвижения.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСПоступлениеИзТоваровВПути
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтХранителя Тогда
			
			СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
				?(ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности,
					Перечисления.ХозяйственныеОперации.ОтгрузкаБезПереходаПраваСобственности,
					Неопределено));
			
			Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами Тогда
				СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
					Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров);
			ИначеЕсли ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами Тогда
				СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
					Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеРабот);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих доходов\расходов при пересортице.
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой Тогда

		Если ДанныеСумм.ПолнаяСуммаПереоценки > 0 Тогда 
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 1, 1, 1, 1, 1);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		ИначеЕсли ДанныеСумм.ПолнаяСуммаПереоценки < 0 Тогда
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, -1, 1, -1, -1, 1);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Истина,
				Перечисления.ХозяйственныеОперации.ДоходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих расходов при порче.
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой Тогда
		
		Если ДанныеСумм.ПолнаяСуммаПереоценки <> 0 Тогда
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 1, 1, 1, 1, 1);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих доходов/расходов возникших от переоценки товаров.
	Если (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
			И ДанныеДвижения.КорСтоимость <> 0)
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары Тогда
		
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями Тогда
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 0, 0, 1, 1, 0);
		Иначе
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 1, 1, 1, 1, 0);
		КонецЕсли;
		
		Если СкорректированныеСуммы.ПолнаяСуммаСНДС > 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаРегл > 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаУпр > 0 Тогда 

			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		ИначеЕсли СкорректированныеСуммы.ПолнаяСуммаСНДС < 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаРегл < 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаУпр < 0 Тогда 
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(СкорректированныеСуммы, -1, -1, -1, -1, 0);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Истина,
				Перечисления.ХозяйственныеОперации.ДоходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.3, 3.14 (СформироватьДвиженияПоОборотнымРегистрамУпрУчета)
Процедура СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
			ЭтоДоход = Ложь, ХозяйственнаяОперация = Неопределено)

	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля =
	"Период, ХозяйственнаяОперация, Организация, Подразделение,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,
	|ИсточникГФУНоменклатуры, ДокументДвижения";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения.
	ЗаполнитьЗначенияСвойств(Запись, ДанныеСумм);
	
	Если ХозяйственнаяОперация <> Неопределено Тогда
		Запись.ХозяйственнаяОперация = ХозяйственнаяОперация;
	КонецЕсли;
	
	Если ЭтоДоход Тогда
		Запись.СтатьяДоходовРасходов = ДанныеДвижения.СтатьяДоходов;
		Запись.АналитикаДоходов 	 = ДанныеДвижения.АналитикаДоходов;
		Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.НаправлениеДеятельности;
		Запись.НаправлениеДеятельностиСтатьи = ДанныеДвижения.КорНаправлениеДеятельности;
	Иначе
		Запись.СтатьяДоходовРасходов = ДанныеДвижения.СтатьяРасходовСписания;
		Запись.АналитикаРасходов 	 = ДанныеДвижения.АналитикаРасходов;
		Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.НаправлениеДеятельности;
		Запись.НаправлениеДеятельностиСтатьи = ДанныеДвижения.КорНаправлениеДеятельности;
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			И ДанныеДвижения.КорТипЗапасов = Перечисления.ТипыЗапасов.КомиссионныйТовар Тогда
			Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.КорНаправлениеДеятельности;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.3, 3.14 (СформироватьДвиженияПоОборотнымРегистрамУпрУчета)
Процедура СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм, ХозяйственнаяОперация)
	
	Если НЕ ЗначениеЗаполнено(ДанныеДвижения.КорАналитикаУчетаНоменклатуры)
	 И (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров
	 	ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура.Имя;
	
	КопируемыеПоля =
	"Период, ХозяйственнаяОперация, Организация, Подразделение,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,НаправлениеДеятельности,
	|КорАналитикаУчетаНоменклатуры,КорСклад,КорТипЗапасов,КорВидЗапасов,КорНаправлениеДеятельности,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, ДокументДвижения, КорОрганизация";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения.
	ЗаполнитьЗначенияСвойств(Запись, ДанныеСумм);
	
	Если ХозяйственнаяОперация <> Неопределено Тогда
		Запись.ХозяйственнаяОперация = ХозяйственнаяОперация;
		Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров
			ИЛИ Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеРабот Тогда
			Запись.Организация    = ДанныеДвижения.КорОрганизация;
			Запись.КорОрганизация = ДанныеДвижения.Организация;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеДвижения.Склад) = Тип("СправочникСсылка.Партнеры") Тогда
		Запись.Количество = ДанныеДвижения.Количество;
	КонецЕсли;
	
	Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		Запись.КорНаправлениеДеятельности = ДанныеДвижения.НаправлениеДеятельности;
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.18
Процедура СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля = "Период, ХозяйственнаяОперация, Организация,
	|НаправлениеДеятельностиНоменклатуры, НаправлениеДеятельностиСтатьи, АналитикаУчетаНоменклатуры,
	|Склад, Подразделение, СтатьяДоходовРасходов, АналитикаРасходов, ВидЗапасов, ТипЗапасов,
	|ИсточникГФУНоменклатуры, ДокументДвижения, СтоимостьРегл, СтоимостьУпр";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период 														КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНДСНаРасходы) 	КАК ХозяйственнаяОперация,
	|	Партии.Организация 													КАК Организация,
	|	СпрНазначения.НаправлениеДеятельности 								КАК НаправлениеДеятельностиНоменклатуры,
	|	СпрНазначения.НаправлениеДеятельности 								КАК НаправлениеДеятельностиСтатьи,
	|	Партии.АналитикаУчетаНоменклатуры 									КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.МестоХранения									КАК Склад,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпрСклады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ 																КАК Подразделение,
	|	Партии.СтатьяСписанияНДС 											КАК СтатьяДоходовРасходов,
	|	Партии.АналитикаСписанияНДС 										КАК АналитикаРасходов,
	|	Партии.ВидЗапасов													КАК ВидЗапасов,
	|	ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(СпрВидыЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ 																КАК ТипЗапасов,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ 																КАК ИсточникГФУНоменклатуры,
	|	Партии.Регистратор 													КАК ДокументДвижения,
	|	СУММА(Партии.СписаниеНДС) 											КАК СтоимостьРегл,
	|	СУММА(Партии.СписаниеНДСУпр) 										КАК СтоимостьУпр
	|ИЗ
	|	ВтПартии КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО Партии.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
	|			ПО АналитикаНоменклатуры.СкладскаяТерритория = СпрСклады.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО АналитикаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ПО Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.МестоХранения,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпрСклады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	СпрНазначения.НаправлениеДеятельности,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.ВидЗапасов,
	|	ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(СпрВидыЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.СписаниеНДС) <> 0
	|	ИЛИ СУММА(Партии.СписаниеНДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,, ИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		// Добавим движение и заполним его свойства.
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, КопируемыеПоля);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеЗаполнения)
	
	ДанныеСумм = Новый Структура;
	ДанныеСумм.Вставить("Стоимость", 			  		0);
	ДанныеСумм.Вставить("СтоимостьБезНДС", 		  		0);
	ДанныеСумм.Вставить("ДопРасходы", 	  		  		0);
	ДанныеСумм.Вставить("ДопРасходыБезНДС", 	  		0);
	ДанныеСумм.Вставить("Трудозатраты", 		  		0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеСНДС", 	0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеБезНДС", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеСНДС", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеБезНДС", 	0);
	ДанныеСумм.Вставить("СтоимостьРегл", 		  		0);
	ДанныеСумм.Вставить("ДопРасходыРегл", 		  		0);
	ДанныеСумм.Вставить("ТрудозатратыРегл", 	  		0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеРегл", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеРегл", 	0);
	ДанныеСумм.Вставить("СтоимостьУпр", 		  		0);
	ДанныеСумм.Вставить("ДопРасходыУпр", 		  		0);
	ДанныеСумм.Вставить("ТрудозатратыУпр", 		  		0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеУпр", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеУпр", 	0);
	ДанныеСумм.Вставить("СтоимостьЗабалансовая", 		0);
	ДанныеСумм.Вставить("СтоимостьЗабалансоваяРегл", 	0);
	ДанныеСумм.Вставить("ПостояннаяРазница", 			0);
	ДанныеСумм.Вставить("ВременнаяРазница", 			0);
	ДанныеСумм.Вставить("НДСРегл", 			    		0);
	ДанныеСумм.Вставить("НДСУпр",	 			    	0);
	ДанныеСумм.Вставить("КорСтоимость", 			    0);
	
	ЗаполнитьЗначенияСвойств(ДанныеСумм, ДанныеЗаполнения);
	
	ЗаполнитьИтоговыеСуммовыеПоказателиДвижения(ДанныеСумм);
	
	ДанныеСумм.Вставить("ПолнаяСуммаПереоценки", ДанныеСумм.ПолнаяСуммаСНДС - ДанныеСумм.КорСтоимость);
		
	Возврат ДанныеСумм;
	
КонецФункции

Функция СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм,
			КоэффициентСуммыСНДС = 1, КоэффициентСуммыБезНДС = 1, КоэффициентСуммыРегл = 1, КоэффициентСуммыУпр = 1,
			КоэффициентКорСуммы = 0)
	
	ИменаПолейСНДС   = Новый Структура("Стоимость, ДопРасходы, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС");
	ИменаПолейБезНДС = Новый Структура("СтоимостьБезНДС, ДопРасходыБезНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС");
	ИменаПолейРегл   = Новый Структура("СтоимостьРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл");
	ИменаПолейУпр 	 = Новый Структура("СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	ИменаПолейУменьшаемойСтоимости = Новый Структура("Стоимость, СтоимостьБезНДС");
	
	СкорректированныеСуммы = Новый Структура;
	
	Для Каждого КлючИЗначение Из ДанныеСумм Цикл
		
		Если ИменаПолейСНДС.Свойство(КлючИЗначение.Ключ) Тогда
			
			Если ИменаПолейУменьшаемойСтоимости.Свойство(КлючИЗначение.Ключ) Тогда
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ,
					(КлючИЗначение.Значение - ДанныеСумм.КорСтоимость * КоэффициентКорСуммы) * КоэффициентСуммыСНДС);
			Иначе
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыСНДС);
			КонецЕсли;
			
		ИначеЕсли ИменаПолейБезНДС.Свойство(КлючИЗначение.Ключ) Тогда
			
			Если ИменаПолейУменьшаемойСтоимости.Свойство(КлючИЗначение.Ключ) Тогда
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ,
					(КлючИЗначение.Значение - ДанныеСумм.КорСтоимость * КоэффициентКорСуммы) * КоэффициентСуммыБезНДС);
			Иначе
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыБезНДС);
			КонецЕсли;
		
		ИначеЕсли ИменаПолейРегл.Свойство(КлючИЗначение.Ключ) Тогда
			
			СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыРегл);
		
		ИначеЕсли ИменаПолейУпр.Свойство(КлючИЗначение.Ключ) Тогда
			
			СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыУпр);
			
		Иначе
			
			СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьИтоговыеСуммовыеПоказателиДвижения(СкорректированныеСуммы);
	
	Возврат СкорректированныеСуммы;
	
КонецФункции

Процедура ЗаполнитьИтоговыеСуммовыеПоказателиДвижения(ДанныеСумм)
	
	ДанныеСумм.Вставить("ПолнаяСуммаСНДС",
		ДанныеСумм.Стоимость + ДанныеСумм.ДопРасходы + ДанныеСумм.Трудозатраты
		+ ДанныеСумм.ПостатейныеПостоянныеСНДС + ДанныеСумм.ПостатейныеПеременныеСНДС);
	ДанныеСумм.Вставить("ПолнаяСуммаБезНДС",
		ДанныеСумм.СтоимостьБезНДС + ДанныеСумм.ДопРасходыБезНДС + ДанныеСумм.Трудозатраты
		+ ДанныеСумм.ПостатейныеПостоянныеБезНДС + ДанныеСумм.ПостатейныеПеременныеБезНДС);
	ДанныеСумм.Вставить("ПолнаяСуммаРегл",
		ДанныеСумм.СтоимостьРегл + ДанныеСумм.ДопРасходыРегл + ДанныеСумм.ТрудозатратыРегл
		+ ДанныеСумм.ПостатейныеПостоянныеРегл + ДанныеСумм.ПостатейныеПеременныеРегл);
	ДанныеСумм.Вставить("ПолнаяСуммаУпр",
		ДанныеСумм.СтоимостьУпр + ДанныеСумм.ДопРасходыУпр + ДанныеСумм.ТрудозатратыУпр
		+ ДанныеСумм.ПостатейныеПостоянныеУпр + ДанныеСумм.ПостатейныеПеременныеУпр);
	
	ДанныеСумм.Вставить("ЕстьНенулеваяПолнаяСумма",
		ДанныеСумм.ПолнаяСуммаСНДС <> 0
		ИЛИ ДанныеСумм.ПолнаяСуммаБезНДС <> 0
		ИЛИ ДанныеСумм.ПолнаяСуммаРегл <> 0
		ИЛИ ДанныеСумм.ПолнаяСуммаУпр <> 0);
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияСебестоимостьТоваров

// Служебная, этап 2.1, 3.3, 3.14
Процедура СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ДанныеДвижения, ВидДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	
	// Кор. стоимость не включается в список полей.
	КопируемыеПоля = "
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
	|ХозяйственнаяОперация,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов,КорОрганизация,
	|АналитикаУчетаПоПартнерам, ЗаказКлиента,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|СтатьяАктивовПассивов, АналитикаАктивовПассивов,
	|ИдентификаторСтроки, КодСтроки, ДокументДвижения, ПериодПродажи, ГруппаПродукции,
	|КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, ДопРасходы, ДопРасходыБезНДС,
	|ПостояннаяРазница, ВременнаяРазница, СтоимостьРегл, СтоимостьЗабалансоваяРегл";
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
		|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
		|НДСРегл, СтатьяКалькуляции, ТипЗаписи, ДокументИсточник,
		|Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
		|ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
		|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
		|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр
		|";
	КонецЕсли;

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвижения;
	Запись.Количество  = 0;

КонецПроцедуры

// Служебная, этап 3.14
Процедура СформироватьДвиженияСебестоимостьТоваровСторноВУпрУчете(ПараметрыРасчета, ДанныеДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	
	КопируемыеПоля = "
	|Период, АналитикаУчетаНоменклатуры, Организация,
	|ХозяйственнаяОперация, ДокументДвижения,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания,
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС,
	|ПостояннаяРазница, ВременнаяРазница,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник,
	|Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения   = ВидДвиженияНакопления.Приход;
	Запись.Организация   = ДанныеДвижения.КорОрганизация;
	Запись.ВидЗапасов    = ДанныеДвижения.КорВидЗапасов;
	Запись.СтоимостьРегл = 0;
	Запись.СтоимостьУпр  = 0;
	Запись.Количество    = 0;
	
	Если ДанныеДвижения.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию Тогда
		Запись.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах;
	Иначе
		Запись.РазделУчета = ДанныеДвижения.РазделУчета;
	КонецЕсли;
	
	Если ПараметрыРасчета.УчетныеПолитики.ФИФОСкользящая.ИспользуютВТекущемПериоде.Найти(Справочники.Организации.УправленческаяОрганизация) <> Неопределено Тогда
		Запись.Партия                 	 = ДанныеДвижения.КорПартия;
		Запись.АналитикаУчетаПартий   	 = ДанныеДвижения.КорАналитикаУчетаПартий;
	КонецЕсли;
	
	Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
	Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.1, 3.14
Процедура СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ДанныеДвижения, ПромежуточнаяСебестоимость = Ложь)
	
	Если ПромежуточнаяСебестоимость Тогда
		ТаблицаПриемник = "ВТПромежуточнаяСебестоимостьТоваров";
	Иначе
		ТаблицаПриемник = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	КонецЕсли;
	
	КопируемыеПоля = "
	|Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки,
	|Подразделение, ГруппаПродукции,
	|Стоимость, СтоимостьЗабалансовая, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, ПостояннаяРазница, ВременнаяРазница";

	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник,
		|Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
		|ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
		|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
		|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр";
	КонецЕсли;
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения                = ВидДвиженияНакопления.Приход;
	Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
	Запись.РазделУчета                = ДанныеДвижения.КорРазделУчета;
	Запись.ВидЗапасов                 = ДанныеДвижения.КорВидЗапасов;
	Запись.Организация                = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
	Запись.Количество 				  = 0;
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		Запись.Партия                 	 = ДанныеДвижения.КорПартия;
		Запись.АналитикаУчетаПартий   	 = ДанныеДвижения.КорАналитикаУчетаПартий;
	КонецЕсли;
	Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
		Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
		Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции Тогда
			Если ТипЗнч(ДанныеДвижения.АналитикаФинансовогоУчета) = Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры") Тогда
				Запись.КорАналитикаФинансовогоУчета = ДанныеДвижения.АналитикаФинансовогоУчета;
			Иначе
				Запись.КорАналитикаФинансовогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка();
			КонецЕсли;
			Запись.ГруппаПродукции = ДанныеДвижения.АналитикаФинансовогоУчета;
		КонецЕсли;
	КонецЕсли;
	Если Запись.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение Тогда
		Запись.КорВидЗапасов             = ДанныеДвижения.КорВидЗапасов;
	КонецЕсли;

	Если ДанныеДвижения.ЭтоПередачаМеждуОрганизациями Тогда
		
		Запись.СтоимостьРегл = 0;
		Запись.СтоимостьЗабалансоваяРегл = 0;
		Запись.ПостояннаяРазница = 0;
		Запись.ВременнаяРазница = 0;
		
		Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
			
			Запись.ДопРасходыРегл = 0;
			Запись.ТрудозатратыРегл = 0;
			Запись.ПостатейныеПостоянныеРегл = 0;
			Запись.ПостатейныеПеременныеРегл = 0;
			
			Запись.СтоимостьУпр = 0;
			Запись.ДопРасходыУпр = 0;
			Запись.ТрудозатратыУпр = 0;
			Запись.ПостатейныеПостоянныеУпр = 0;
			Запись.ПостатейныеПеременныеУпр = 0;
			
		КонецЕсли;
		
	ИначеЕсли ДанныеДвижения.НДСРегл <> 0 ИЛИ ДанныеДвижения.НДСУпр <> 0 Тогда // это не передача
		
		КопируемыеПоля = " Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки, Подразделение, Организация";
		Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
			КопируемыеПоля = КопируемыеПоля + ", СтатьяКалькуляции, ТипЗаписи, ДокументИсточник";
		КонецЕсли;
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения 				  	 = ВидДвиженияНакопления.Приход;
		Запись.АналитикаУчетаНоменклатуры 	 = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
		Запись.РазделУчета 				  	 = ДанныеДвижения.КорРазделУчета;
		Запись.ВидЗапасов 				  	 = ДанныеДвижения.КорВидЗапасов;
		Запись.Организация                	 = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
		Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
			Запись.Партия                 	 = ДанныеДвижения.КорПартия;
			Запись.АналитикаУчетаПартий   	 = ДанныеДвижения.КорАналитикаУчетаПартий;
		КонецЕсли;
		Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
			Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
			Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
			Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции Тогда
				Если ТипЗнч(ДанныеДвижения.АналитикаФинансовогоУчета) = Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры") Тогда
					Запись.КорАналитикаФинансовогоУчета = ДанныеДвижения.АналитикаФинансовогоУчета;
				Иначе
					Запись.КорАналитикаФинансовогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка();
				КонецЕсли;
				Запись.ГруппаПродукции = ДанныеДвижения.АналитикаФинансовогоУчета;
			КонецЕсли;
		КонецЕсли;
		
		Запись.СтоимостьРегл 			  	 = ДанныеДвижения.НДСРегл;
		Запись.СтоимостьУпр 			  	 = ДанныеДвижения.НДСУпр;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДвиженияПрочиеРасходы

// Служебная, этап 2.1, 3.18
Процедура СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля =
		"Период, ВидДвижения, ХозяйственнаяОперация, Организация, АналитикаУчетаНоменклатуры, НаправлениеДеятельности,
		|Подразделение, СтатьяРасходов, АналитикаРасходов, ДокументДвижения, СуммаРегл, СуммаУпр";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период 														КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 								КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНДСНаРасходы) 	КАК ХозяйственнаяОперация,
	|	Партии.Организация 													КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры 									КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) 					КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(Склады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ 																КАК Подразделение,
	|	Партии.СтатьяСписанияНДС 											КАК СтатьяРасходов,
	|	Партии.АналитикаСписанияНДС 										КАК АналитикаРасходов,
	|	Партии.Регистратор 													КАК ДокументДвижения,
	|	СУММА(Партии.СписаниеНДС) 											КАК СуммаРегл,
	|	СУММА(Партии.СписаниеНДСУпр) 										КАК СуммаУпр
	|ИЗ
	|	ВтПартии КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО АналитикаНоменклатуры.СкладскаяТерритория = Склады.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(Склады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	СпрНазначения.НаправлениеДеятельности,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.Регистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.СписаниеНДС) <> 0
	|	ИЛИ СУММА(Партии.СписаниеНДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Выборка = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,, ИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		// Добавим движение и заполним его свойства.
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, КопируемыеПоля);
	КонецЦикла;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.1, 3.3, 3.14
Процедура СформироватьДвиженияПрочиеРасходы(ПараметрыРасчета, ДанныеДвижения,
			Сумма, СуммаБезНДС, СуммаРегл, СуммаУпр, ПостояннаяРазница, ВременнаяРазница)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, АналитикаРасходов, ХозяйственнаяОперация,
	|АналитикаУчетаНоменклатуры, ГруппаПродукции, ДокументДвижения";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
	 И НачалоМесяца(ДанныеДвижения.ПериодПродажи) < НачалоМесяца(ДанныеДвижения.Период) Тогда
		Знак = -1;
	Иначе
		Знак = 1;
	КонецЕсли;
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения       = ВидДвиженияНакопления.Приход;
	Запись.Сумма             = Знак * Сумма;
	Запись.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовСписания;
	Запись.НаправлениеДеятельности = ДанныеДвижения.КорНаправлениеДеятельности;
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда
		Запись.Организация = ДанныеДвижения.КорОрганизация;
	КонецЕсли;
	Если ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты Тогда
		Запись.СуммаБезНДС = Знак * СуммаБезНДС;
	КонецЕсли;
	
	Если НЕ ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы Тогда
		Если НЕ ПараметрыРасчета.УправленческийУчетОрганизаций
		 ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда
			Запись.СуммаУпр = 0;
		ИначеЕсли ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы
		 И НЕ ПараметрыРасчета.ИспользуетсяУправлениеВНА_2_4 Тогда
			Запись.СуммаУпр = 0;
		Иначе
			Запись.СуммаУпр = Знак * СуммаУпр;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл
	 ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
	 ИЛИ ДанныеДвижения.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы
	 ИЛИ (ДанныеДвижения.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы
	 	И НЕ ПараметрыРасчета.ИспользуетсяУправлениеВНА_2_4) Тогда
		Запись.СуммаРегл = 0;
		Запись.ПостояннаяРазница = 0;
		Запись.ВременнаяРазница = 0;
	Иначе
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда
			Запись.СуммаРегл = 0;
			Запись.ПостояннаяРазница = ?(ДанныеДвижения.СписаниеПриПередачеНУ,
				?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, СуммаРегл - ВременнаяРазница - ПостояннаяРазница, 0), 0);
			Запись.ВременнаяРазница = ?(ДанныеДвижения.СписаниеПриПередачеНУ,
				?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, -(СуммаРегл - ВременнаяРазница - ПостояннаяРазница),
					-(СуммаРегл - ВременнаяРазница - ПостояннаяРазница)), 0);
		ИначеЕсли ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ Тогда
			Запись.СуммаРегл = 0;
			Запись.ПостояннаяРазница = 0;
			Запись.ВременнаяРазница = 0;
		Иначе
			Запись.СуммаРегл = Знак * СуммаРегл;
			Запись.ПостояннаяРазница = ?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, Знак * СуммаРегл - Знак * ВременнаяРазница, Знак * ПостояннаяРазница);
			Запись.ВременнаяРазница  = Знак * ВременнаяРазница;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация)
	 И ДанныеДвижения.КорОрганизация <> ДанныеДвижения.Организация
	 И ДанныеДвижения.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда
	 
		ЗаписьУпр = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		ЗаписьУпр.СтатьяРасходов = ДанныеДвижения.СтатьяРасходовСписания;
		ЗаписьУпр.Сумма = -Запись.Сумма;
		ЗаписьУпр.СуммаУпр = -Запись.СуммаУпр;
		ЗаписьУпр.СуммаРегл = 0;
		ЗаписьУпр.ПостояннаяРазница = 0;
		ЗаписьУпр.ВременнаяРазница  = 0;
		ЗаписьУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторнированиеРасходовУУ;
		
		ЗаписьУпр = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		ЗаписьУпр.Организация = ДанныеДвижения.КорОрганизация;
		ЗаписьУпр.СтатьяРасходов = ДанныеДвижения.СтатьяРасходовСписания;
		ЗаписьУпр.Сумма = Запись.Сумма;
		ЗаписьУпр.СуммаУпр = Запись.СуммаУпр;
		ЗаписьУпр.СуммаРегл = 0;
		ЗаписьУпр.ПостояннаяРазница = 0;
		ЗаписьУпр.ВременнаяРазница  = 0;
		ЗаписьУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РегистрацияРасходовУУ;
		
		// Добавим движения по регистру "Активы и пассивы".
		ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	
		КопируемыеПоля = "
		|Период, Организация, Подразделение, НаправлениеДеятельности";
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.Статья      = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки;
		Запись.Аналитика   = ДанныеДвижения.Организация;
		Запись.Сумма 	   = Знак * Сумма;
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
		Запись.Организация = ДанныеДвижения.КорОрганизация;
		Запись.Статья      = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки;
		Запись.Аналитика   = ДанныеДвижения.КорОрганизация;
		Запись.Сумма 	   = Знак * Сумма;
	 
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 4.5
Процедура СформироватьДвиженияРаспределениеРБП(ПараметрыРасчета, ДанныеДвижения, Суммы)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "Период, Организация, Подразделение, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности";

	// Добавим движение расход и заполним его основные свойства
	ЗаписьРасход = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения расход
	ЗаписьРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
	ЗаполнитьЗначенияСвойств(ЗаписьРасход, Суммы, "Сумма, СуммаУпр, СуммаРегл, ПостояннаяРазница, ВременнаяРазница");
	
	// Добавим движение приход и заполним его основные свойства
	ЗаписьПриход = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения приход
	ЗаписьПриход.ВидДвижения 	   = ВидДвиженияНакопления.Приход;
	ЗаписьПриход.Подразделение 	   = ДанныеДвижения.ПодразделениеПолучатель;
	ЗаписьПриход.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовПолучатель;
	ЗаписьПриход.АналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
	
	ЗаполнитьЗначенияСвойств(ЗаписьПриход, Суммы, "Сумма, СуммаУпр, СуммаРегл, ПостояннаяРазница, ВременнаяРазница");
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияПрочиеДоходы

// Служебная, этап 2.1, 3.3, 3.14
Процедура СформироватьДвиженияПрочиеДоходы(ПараметрыРасчета, ДанныеДвижения,
			Сумма, СуммаРегл, СуммаУпр)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, СтатьяДоходов, АналитикаДоходов, ХозяйственнаяОперация";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.НаправлениеДеятельности = ДанныеДвижения.КорНаправлениеДеятельности;
	Запись.Сумма	   = Сумма;
	Запись.СуммаУпр	   = СуммаУпр;
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		Запись.СуммаРегл = СуммаРегл;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияВыручкаИСебестоимостьПродаж

// Служебная, этап 2.2, 3.17, 3.18
Процедура СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ДанныеДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, АналитикаУчетаНоменклатуры, Менеджер, РазделУчета,
	|АналитикаУчетаПоПартнерам, ТипЗапасов, ВидЗапасов, ЗаказКлиента, ХозяйственнаяОперация,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов, НаправлениеДеятельностиНоменклатуры,
	|НаправлениеДеятельностиКонтрагента, 
	|НалогообложениеНДС, ДокументДвижения";
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС";
	КонецЕсли;
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	ПоляРесурсов = "
		|Стоимость, СтоимостьБезНДС, ПостояннаяРазница, ВременнаяРазница,
		|СтоимостьРегл, ДопРасходы, ДопРасходыБезНДС";
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		ПоляРесурсов = ПоляРесурсов + ",
		|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
		|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
		|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
		|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр";
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Запись, ДанныеДвижения, ПоляРесурсов);
	
	Если ДанныеДвижения.НДСРегл <> 0 Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.СтоимостьРегл = ДанныеДвижения.НДСРегл;
		
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 И ДанныеДвижения.НДСУпр <> 0 Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.СтоимостьУпр = ДанныеДвижения.НДСУпр;
		
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 3.3
Процедура СформироватьДвиженияВыручкаИСебестоимостьПродажВозврат(ПараметрыРасчета, ДанныеДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, АналитикаУчетаПоПартнерам, ЗаказКлиента, ТипЗапасов, ВидЗапасов,
	|ХозяйственнаяОперация, Менеджер, Склад, Соглашение, Договор, ДокументДвижения,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);

	// Заполним дополнительные свойства движения
	Если ЗначениеЗаполнено(ДанныеДвижения.КорАналитикаУчетаНоменклатуры) Тогда
		Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
	Иначе
		Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.АналитикаУчетаНоменклатуры;
	КонецЕсли;

	ПоляРесурсов = "
		|Стоимость, СтоимостьБезНДС, ПостояннаяРазница, ВременнаяРазница,
		|СтоимостьРегл, ДопРасходы, ДопРасходыБезНДС,
		|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
		|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
		|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
		|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр";
	
	Для Каждого КлючИЗначение Из Новый Структура(ПоляРесурсов) Цикл
		Запись[КлючИЗначение.Ключ] = - ДанныеДвижения[КлючИЗначение.Ключ];
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияЗакупки

// Служебная, этап 2.2, 3.17
Процедура СформироватьДвиженияЗакупки(ПараметрыРасчета, ДанныеДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.Закупки.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, Менеджер, АналитикаУчетаНоменклатуры,
	|Склад, ТипЗапасов, ВидЗапасов, Партнер, Соглашение, Договор,
	|ВалютаДокумента, ВалютаВзаиморасчетов, ИсточникГФУНоменклатуры, ИсточникГФУРасчетов, ДокументДвижения,
	|Стоимость, СтоимостьБезНДС";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	Запись.Стоимость = Запись.Стоимость + ДанныеДвижения.ДопРасходы;
	Запись.СтоимостьБезНДС = Запись.СтоимостьБезНДС + ДанныеДвижения.ДопРасходыБезНДС;
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		Запись.Стоимость 	   = Запись.Стоимость + ДанныеДвижения.Трудозатраты
			+ ДанныеДвижения.ПостатейныеПостоянныеСНДС + ДанныеДвижения.ПостатейныеПеременныеСНДС;
		Запись.СтоимостьБезНДС = Запись.СтоимостьБезНДС + ДанныеДвижения.Трудозатраты
			+ ДанныеДвижения.ПостатейныеПостоянныеБезНДС + ДанныеДвижения.ПостатейныеПеременныеБезНДС;
	КонецЕсли;
	
	// Заполним дополнительные свойства движения
	Запись.Организация 			 = ДанныеДвижения.Контрагент;
	Запись.Контрагент 			 = ДанныеДвижения.Организация;
	Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУДругойОрганизации;
	
КонецПроцедуры

#КонецОбласти


#Область ДвиженияПрочиеАктивыПассивы

// Служебная, этап 2.1
Процедура СформироватьДвиженияПрочиеАктивыПассивы(ПараметрыРасчета, ДанныеДвижения, Сумма)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Сумма 	   = Сумма;
	Запись.Статья 	   = ДанныеДвижения.СтатьяАктивовПассивов;
	Запись.Аналитика   = ДанныеДвижения.АналитикаАктивовПассивов;
	Запись.НаправлениеДеятельности = ДанныеДвижения.КорНаправлениеДеятельности;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаспределениеСтоимости

// Служебная, этап 2.1, 2.2
// Формирует ВтПартии
//
Процедура ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета, ДляСтоимостиПродаж = Ложь)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ДляСтоимостиПродаж", ДляСтоимостиПродаж);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Организация КАК Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	ВЫБОР КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|		И Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Корректировка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорВидЗапасов
	|	ИНАЧЕ
	|		Партии.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаНоменклатуры
	|	КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	|		ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаНоменклатуры
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК КорАналитикаУчетаНоменклатуры,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.Количество
	|			ИНАЧЕ Партии.Количество
	|		КОНЕЦ
	|	)										КАК Количество,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.Стоимость
	|			ИНАЧЕ Партии.Стоимость
	|		КОНЕЦ
	|	)										КАК Стоимость,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.СтоимостьБезНДС
	|			ИНАЧЕ Партии.СтоимостьБезНДС
	|		КОНЕЦ
	|	)										КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.ПостояннаяРазница
	|			ИНАЧЕ Партии.ПостояннаяРазница
	|		КОНЕЦ
	|	)										КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.ВременнаяРазница
	|			ИНАЧЕ Партии.ВременнаяРазница
	|		КОНЕЦ
	|	)										КАК ВременнаяРазница,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА Партии.Количество < 0 
	|					ТОГДА 0 - Партии.СтоимостьРегл - Партии.НДСРегл 
	|					ИНАЧЕ Партии.СтоимостьРегл + Партии.НДСРегл 
	|				КОНЕЦ
	|			ИНАЧЕ
	|				ВЫБОР
	|					КОГДА Партии.Количество < 0 
	|					ТОГДА 0 - Партии.СтоимостьРегл 
	|					ИНАЧЕ Партии.СтоимостьРегл
	|				КОНЕЦ
	|		КОНЕЦ
	|	)										КАК СтоимостьРегл,
	|
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Количество < 0 ТОГДА
	|				0 - Партии.НДСРегл
	|			ИНАЧЕ
	|				Партии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Количество < 0 ТОГДА
	|				Партии.НДСРегл
	|			ИНАЧЕ
	|				- Партии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Партии.Количество < 0 ТОГДА -Партии.НДСРегл ИНАЧЕ Партии.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	
	|	Партии.Номенклатура						КАК Номенклатура,
	|	Партии.Характеристика					КАК Характеристика,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|
	|ПОМЕСТИТЬ ТаблицаПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
	|		ПО Потребление.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = Партии.ДокументИсточник
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|		И Партии.Количество < 0
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		(Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|			)
	|		) ИЛИ Партии.Регистратор Ссылка Документ.ВозвратТоваровМеждуОрганизациями
	|		)
	|	И НЕ (Партии.Регистратор Ссылка Документ.ВозвратТоваровОтКлиента И Партии.Первичное)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	ВЫБОР КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|		И Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Корректировка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорВидЗапасов
	|	ИНАЧЕ
	|		Партии.ВидЗапасов
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаНоменклатуры 
	|	КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	|		ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	Партии.Номенклатура,
	|	Партии.Характеристика,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска,
	|	Партии.Регистратор
	|ПОМЕСТИТЬ ЗатратыНаВыпуск
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода	
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|ИНДЕКСИРОВАТЬ ПО
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|
	|ПОМЕСТИТЬ СборкиТоваровВидыЗапасов
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	&УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров)
	|			)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	&УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	РегистрНакопления.ПартииПроизводственныхЗатрат КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	&УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация 						КАК Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	Партии.Регистратор 						КАК Регистратор,
	|	ВЫБОР
	|		КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|			И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ Партии.АналитикаУчетаПродукции
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|			ТОГДА Партии.КорВидЗапасов
	|		КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		 ИЛИ Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорВидЗапасов,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК КорАналитикаУчетаПродукции,
	|	0 КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.Стоимость
	|		ИНАЧЕ
	|			Партии.Стоимость
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.СтоимостьБезНДС
	|		ИНАЧЕ
	|			Партии.СтоимостьБезНДС
	|		КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.СтоимостьРегл - Партии.НДСРегл 
	|			ИНАЧЕ
	|				Партии.СтоимостьРегл + Партии.НДСРегл 
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.СтоимостьРегл 
	|			ИНАЧЕ
	|				Партии.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ
	|	)										КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.НДСРегл
	|			ИНАЧЕ
	|				Партии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				Партии.НДСРегл
	|			ИНАЧЕ
	|				- Партии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА -Партии.НДСРегл ИНАЧЕ Партии.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.ПостояннаяРазница
	|		ИНАЧЕ
	|			Партии.ПостояннаяРазница
	|		КОНЕЦ) КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.ВременнаяРазница
	|		ИНАЧЕ
	|			Партии.ВременнаяРазница
	|		КОНЕЦ) КАК ВременнаяРазница,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаПродукции 
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаПродукции
	|	КОНЕЦ КАК АналитикаУчетаПродукции,
	|	Партии.АналитикаУчетаПродукции КАК ИсходнаяАналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|ПОМЕСТИТЬ СборкиТоваровПартии
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
	|		ПО Потребление.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = Партии.ДокументИсточник
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|		И Партии.Знаменатель < 0
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И Не (Партии.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (Партии.Регистратор ССЫЛКА Документ.КорректировкаВидаДеятельностиНДС И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	Партии.Регистратор,
	|	ВЫБОР
	|		КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|			И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ Партии.АналитикаУчетаПродукции
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|			ТОГДА Партии.КорВидЗапасов
	|		КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		 ИЛИ Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаПродукции 
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаПродукции
	|	КОНЕЦ,
	|	Партии.АналитикаУчетаПродукции,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	Партии.ДокументВыпуска,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Партии.КорВидЗапасов <> НЕОПРЕДЕЛЕНО ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ТаблицаПартий.ВидЗапасов КОНЕЦ) КАК ВидЗапасов,
	|	Партии.Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ПериодПродажи,
	|	Партии.Количество,
	|	Партии.Стоимость,
	|	Партии.СтоимостьБезНДС,
	|	Партии.СтоимостьРегл,
	|	Партии.НДСРегл,
	|	Партии.СписаниеНДС,
	|	Партии.ПостояннаяРазница,
	|	Партии.ВременнаяРазница,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.КорАналитикаУчетаПродукции,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|ПОМЕСТИТЬ СборкиТоваров
	|ИЗ
	|	СборкиТоваровПартии КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ СборкиТоваровВидыЗапасов КАК ТаблицаПартий
	|		ПО ТаблицаПартий.Организация = Партии.Организация
	|		И ТаблицаПартий.АналитикаУчетаНоменклатуры = Партии.ИсходнаяАналитикаУчетаПродукции
	|		И ТаблицаПартий.ДокументПоступления = Партии.ДокументВыпуска
	|		И ТаблицаПартий.Регистратор = Партии.Регистратор
	|		И Партии.КорВидЗапасов = НЕОПРЕДЕЛЕНО
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Ссылка,
	|	Партии.Период КАК Дата,
	|	Партии.ДокументПоступления,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.КорВидЗапасов
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|		ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПартииРасходов.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	ПартииРасходов.Регистратор,
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ПартииРасходов.АналитикаУчетаНоменклатуры
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ПартииРасходов.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	
	|	(ВЫБОР
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.Стоимость
	|		ИНАЧЕ
	|			ПартииРасходов.Стоимость
	|		КОНЕЦ
	|	) КАК Стоимость,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.СтоимостьБезНДС
	|		ИНАЧЕ
	|			ПартииРасходов.СтоимостьБезНДС
	|		КОНЕЦ
	|	) КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.СтоимостьРегл - ПартииРасходов.НДСРегл 
	|			ИНАЧЕ
	|				ПартииРасходов.СтоимостьРегл + ПартииРасходов.НДСРегл 
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.СтоимостьРегл 
	|			ИНАЧЕ
	|				ПартииРасходов.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ
	|		) КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И ПартииРасходов.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.НДСРегл
	|			ИНАЧЕ
	|				ПартииРасходов.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И ПартииРасходов.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				ПартииРасходов.НДСРегл
	|			ИНАЧЕ
	|				- ПартииРасходов.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА -ПартииРасходов.НДСРегл ИНАЧЕ ПартииРасходов.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.ПостояннаяРазница
	|		ИНАЧЕ
	|			ПартииРасходов.ПостояннаяРазница
	|		КОНЕЦ
	|	) КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.ВременнаяРазница
	|		ИНАЧЕ
	|			ПартииРасходов.ВременнаяРазница
	|		КОНЕЦ
	|	) КАК ВременнаяРазница,
	|	ПартииРасходов.Период,
	|	ПартииРасходов.СтатьяСписанияНДС,
	|	ПартииРасходов.АналитикаСписанияНДС
	|ПОМЕСТИТЬ ПартииРасходов
	|ИЗ
	|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ПартииРасходов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Партии
	|		ПО Партии.Ссылка = ПартииРасходов.Регистратор
	|		И Партии.ДокументПоступления = ПартииРасходов.ДокументПоступления
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииРасходов.АналитикаУчетаНоменклатуры
	|		И Партии.КорАналитикаУчетаНоменклатуры = ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		И Партии.ВидЗапасов = ПартииРасходов.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = ПартииРасходов.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = ПартииРасходов.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = ПартииРасходов.ДокументИсточник
	|		И Реализация.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = ПартииРасходов.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
	|		ПО Потребление.Ссылка = ПартииРасходов.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = ПартииРасходов.ДокументИсточник
	|		И ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|		И ПартииРасходов.Количество < 0
	|ГДЕ
	|	ПартииРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииРасходов.Активность
	|	И ПартииРасходов.Организация В (&МассивОрганизаций)
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.КорректировкаПриобретения И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииРасходов.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	ПартииРасходов.Регистратор,
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ПартииРасходов.АналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ПартииРасходов.ВидЗапасов
	|	КОНЕЦ,
	|	(ВЫБОР
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	ПартииРасходов.Период,
	|	ПартииРасходов.СтатьяСписанияНДС,
	|	ПартииРасходов.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		ИНАЧЕ ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ КАК ТипЗапасов,
	|	Партии.Регистратор,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаПродукции
	|		КОГДА АналитикаПродукцииБезНазначения.КлючАналитики ЕСТЬ NULL ТОГДА Партии.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	(ВЫБОР
	|		КОГДА &ДляСтоимостиПродаж ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		ИНАЧЕ Партии.ПериодПродажи КОНЕЦ) КАК ПериодПродажи,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 ТОГДА 0 - Партии.Количество
	|			ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|	СУММА(Партии.Стоимость) КАК Стоимость,
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Партии.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(Партии.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.НДСРегл) КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	СУММА(Партии.СписаниеНДС) КАК СписаниеНДС,
	|	0 КАК СписаниеНДСУпр,
	|	СУММА(Партии.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Партии.ВременнаяРазница) КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Организация КАК Организация,
	|		Таблица.ВидЗапасов КАК ВидЗапасов,
	|		Таблица.Регистратор КАК Регистратор,
	|		Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Таблица.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаПродукции,
	|		Таблица.ПериодПродажи КАК ПериодПродажи,
	|		Таблица.Количество КАК Количество,
	|		Таблица.Стоимость КАК Стоимость,
	|		Таблица.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		Таблица.СтоимостьРегл КАК СтоимостьРегл,
	|		Таблица.НДСРегл КАК НДСРегл,
	|		Таблица.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Таблица.ВременнаяРазница КАК ВременнаяРазница,
	|		Таблица.СписаниеНДС КАК СписаниеНДС,
	|		Таблица.Период,
	|		Таблица.СтатьяСписанияНДС,
	|		Таблица.АналитикаСписанияНДС
	|	ИЗ
	|		ТаблицаПартий КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПартииРасходов.Организация КАК Организация,
	|		ПартииРасходов.ВидЗапасов КАК ВидЗапасов,
	|		ПартииРасходов.Регистратор КАК Регистратор,
	|		ПартииРасходов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ПартииРасходов.АналитикаУчетаПродукции,
	|		ПартииРасходов.ПериодПродажи КАК ПериодПродажи,
	|		0 КАК Количество,
	|		0 КАК Стоимость,
	|		0 КАК СтоимостьБезНДС,
	|		ПартииРасходов.Стоимость КАК ДопРасходы,
	|		ПартииРасходов.СтоимостьБезНДС КАК ДопРасходыБезНДС,
	|		ПартииРасходов.СтоимостьРегл КАК СтоимостьРегл,
	|		ПартииРасходов.НДСРегл КАК НДСРегл,
	|		ПартииРасходов.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ПартииРасходов.ВременнаяРазница КАК ВременнаяРазница,
	|		ПартииРасходов.СписаниеНДС КАК СписаниеНДС,
	|		ПартииРасходов.Период,
	|		ПартииРасходов.СтатьяСписанияНДС,
	|		ПартииРасходов.АналитикаСписанияНДС
	|	ИЗ
	|		ПартииРасходов КАК ПартииРасходов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Организация КАК Организация,
	|		Таблица.ВидЗапасов КАК ВидЗапасов,
	|		Таблица.Регистратор КАК Регистратор,
	|		Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Таблица.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		Таблица.ПериодПродажи КАК ПериодПродажи,
	|		Таблица.Количество КАК Количество,
	|		Таблица.Стоимость КАК Стоимость,
	|		Таблица.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		Таблица.СтоимостьРегл КАК СтоимостьРегл,
	|		Таблица.НДСРегл КАК НДСРегл,
	|		Таблица.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Таблица.ВременнаяРазница КАК ВременнаяРазница,
	|		Таблица.СписаниеНДС КАК СписаниеНДС,
	|		Таблица.Период,
	|		Таблица.СтатьяСписанияНДС,
	|		Таблица.АналитикаСписанияНДС
	|	ИЗ
	|		СборкиТоваров КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПартииНаКомиссии.Организация,
	|		ПартииНаКомиссии.ВидЗапасов,
	|		ПартииНаКомиссии.Регистратор,
	|		ПартииНаКомиссии.АналитикаУчетаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|		ДАТАВРЕМЯ(1,1,1) КАК ПериодПродажи,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.Количество
	|			ИНАЧЕ ПартииНаКомиссии.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.Стоимость
	|			ИНАЧЕ ПартииНаКомиссии.Стоимость
	|		КОНЕЦ КАК Стоимость,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.СтоимостьБезНДС
	|			ИНАЧЕ ПартииНаКомиссии.СтоимостьБезНДС
	|		КОНЕЦ КАК СтоимостьБезНДС,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА
	|					ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|						0 - (ПартииНаКомиссии.СтоимостьРегл + ПартииНаКомиссии.НДСРегл)
	|					ИНАЧЕ
	|						ПартииНаКомиссии.СтоимостьРегл + ПартииНаКомиссии.НДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ
	|				ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|					0 - ПартииНаКомиссии.СтоимостьРегл
	|				ИНАЧЕ
	|					ПартииНаКомиссии.СтоимостьРегл
	|				КОНЕЦ
	|		КОНЕЦ КАК СтоимостьРегл,
	|		ВЫБОР КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И ПартииНаКомиссии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|				0 - ПартииНаКомиссии.НДСРегл
	|			ИНАЧЕ
	|				ПартииНаКомиссии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И ПартииНаКомиссии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|				ПартииНаКомиссии.НДСРегл
	|			ИНАЧЕ
	|				- ПартииНаКомиссии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК НДСРегл,
	|
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.ПостояннаяРазница
	|			ИНАЧЕ ПартииНаКомиссии.ПостояннаяРазница
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.ВременнаяРазница
	|			ИНАЧЕ ПартииНаКомиссии.ВременнаяРазница
	|		КОНЕЦ КАК ВременнаяРазница,
	|		0 КАК СписаниеНДС,
	|		ПартииНаКомиссии.Период,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК ПартииНаКомиссии
	|	ГДЕ
	|		ПартииНаКомиссии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ПартииНаКомиссии.Активность
	|		И ПартииНаКомиссии.Организация В(&МассивОрганизаций)
	|		И ПартииНаКомиссии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И НЕ ПартииНаКомиссии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Затраты.Организация,
	|		Затраты.ВидЗапасов,
	|		Затраты.Регистратор,
	|		Затраты.АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА Затраты.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ КАК АналитикаУчетаПродукции,
	|		ЕСТЬNULL(НАЧАЛОПЕРИОДА(Корректировка.ДокументОснование.Дата, ДЕНЬ), ДАТАВРЕМЯ(1,1,1)) КАК ПериодПродажи,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.Количество
	|		ИНАЧЕ
	|			Затраты.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.Стоимость
	|		ИНАЧЕ
	|			Затраты.Стоимость
	|		КОНЕЦ КАК Стоимость,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.СтоимостьБезНДС
	|		ИНАЧЕ
	|			Затраты.СтоимостьБезНДС
	|		КОНЕЦ КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|				0 - (Затраты.СтоимостьРегл + Затраты.НДСРегл )
	|			ИНАЧЕ
	|				Затраты.СтоимостьРегл + Затраты.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|				0 - Затраты.СтоимостьРегл
	|			ИНАЧЕ
	|				Затраты.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ КАК СтоимостьРегл,
	|		0 КАК НДСРегл,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.ПостояннаяРазница
	|		ИНАЧЕ
	|			Затраты.ПостояннаяРазница
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.ВременнаяРазница
	|		ИНАЧЕ
	|			Затраты.ВременнаяРазница
	|		КОНЕЦ КАК ВременнаяРазница,
	|		ВЫБОР КОГДА Затраты.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА -Затраты.НДСРегл ИНАЧЕ Затраты.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СписаниеНДС,
	|		Затраты.Период,
	|		Затраты.СтатьяСписанияНДС,
	|		Затраты.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Затраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|			ПО Корректировка.Ссылка = Затраты.Регистратор
	|	ГДЕ
	|		Затраты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Затраты.Активность
	|		И Затраты.Организация В(&МассивОрганизаций)
	|		И (Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПрочееОприходованиеТоваров
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	|			)
	|
	|	) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Партии.АналитикаУчетаНоменклатуры
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	|		ПО АналитикаБезНазначения.Номенклатура = Аналитика.Номенклатура
	|		И АналитикаБезНазначения.Характеристика = Аналитика.Характеристика
	|		И АналитикаБезНазначения.Серия = Аналитика.Серия
	|		И АналитикаБезНазначения.МестоХранения = Аналитика.МестоХранения
	|		И АналитикаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО АналитикаПродукции.Ссылка = Партии.АналитикаУчетаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|		ПО АналитикаПродукцииБезНазначения.Номенклатура = АналитикаПродукции.Номенклатура
	|		И АналитикаПродукцииБезНазначения.Характеристика = АналитикаПродукции.Характеристика
	|		И АналитикаПродукцииБезНазначения.Серия = АналитикаПродукции.Серия
	|		И АналитикаПродукцииБезНазначения.МестоХранения = АналитикаПродукции.МестоХранения
	|		И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		ИНАЧЕ ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаПродукции
	|		КОГДА АналитикаПродукцииБезНазначения.КлючАналитики ЕСТЬ NULL ТОГДА Партии.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА &ДляСтоимостиПродаж ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		ИНАЧЕ Партии.ПериодПродажи КОНЕЦ),
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ТаблицаПартий, ЗатратыНаВыпуск, СборкиТоваровВидыЗапасов,
		|СборкиТоваровПартии, СборкиТоваров, Возвраты, ПартииРасходов");
	
КонецПроцедуры


// Служебная, этап 2.1, 2.2, 3.1, 3.18
Процедура РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Знач КоличествоКРаспределению)
	
	СуммыОстатка 	= ПолучитьСуммовыеПоказателиРаспределения(СтрокаОстатка);
	СуммыКСписанию 	= ПолучитьСуммовыеПоказателиРаспределения();
	
	Если КоличествоКРаспределению >= СтрокаОстатка.Количество Тогда
		
		ЗаполнитьЗначенияСвойств(СуммыКСписанию, СуммыОстатка);
		
		КоличествоКРаспределению = КоличествоКРаспределению - СтрокаОстатка.Количество;
		КоличествоКСписанию	     = СтрокаОстатка.Количество;
		

	ИначеЕсли КоличествоКРаспределению < СтрокаОстатка.Количество Тогда
		
		Для Каждого КлючИЗначение Из СуммыОстатка Цикл
			
			СуммыКСписанию[КлючИЗначение.Ключ] =
				Окр((КоличествоКРаспределению * СуммыОстатка[КлючИЗначение.Ключ] / СтрокаОстатка.Количество), 2);
				
			СуммыОстатка[КлючИЗначение.Ключ] = СуммыОстатка[КлючИЗначение.Ключ] - СуммыКСписанию[КлючИЗначение.Ключ];
				
		КонецЦикла;
		
		КоличествоКСписанию		 = КоличествоКРаспределению;
		КоличествоКРаспределению = 0;
		СтрокаОстатка.Количество = СтрокаОстатка.Количество - КоличествоКСписанию;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
	
	Если Выборка.ИсходноеКоличество < 0 Тогда
		
		Для Каждого КлючИЗначение Из СуммыКСписанию Цикл
			
			СуммыКСписанию[КлючИЗначение.Ключ] = -СуммыКСписанию[КлючИЗначение.Ключ];
				
		КонецЦикла;
		
		ЗаписьРаспределения.Количество = -КоличествоКСписанию;
		
	Иначе
		
		СуммыВыборки = ПолучитьСуммовыеПоказателиРаспределения(Выборка);
		
		Для Каждого КлючИЗначение Из СуммыКСписанию Цикл
			
			СуммыКСписанию[КлючИЗначение.Ключ] = СуммыКСписанию[КлючИЗначение.Ключ] - СуммыВыборки[КлючИЗначение.Ключ];
				
		КонецЦикла;
		
		ЗаписьРаспределения.Количество = КоличествоКСписанию;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, СуммыКСписанию);
	ЗаполнитьЗначенияСвойств(СтрокаОстатка, СуммыОстатка);
	
КонецПроцедуры

// Служебная, этап 2.1, 3.1
Процедура ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения)
	
	СуммыЗаписи 	= ПолучитьСуммовыеПоказателиРаспределения(ЗаписьРаспределения);
	СуммыДополнения = ПолучитьСуммовыеПоказателиРаспределения(СуммыРаспределения);
	
	Для Каждого КлючИЗначение Из СуммыЗаписи Цикл
		СуммыЗаписи[КлючИЗначение.Ключ] =
			СуммыЗаписи[КлючИЗначение.Ключ] + СуммыДополнения[КлючИЗначение.Ключ];
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, СуммыЗаписи);
	
КонецПроцедуры

Функция ПолучитьСуммовыеПоказателиРаспределения(ДанныеЗаполнения = Неопределено)
	
	ДанныеСумм = Новый Структура;
	ДанныеСумм.Вставить("Стоимость", 			  	0);
	ДанныеСумм.Вставить("СтоимостьБезНДС", 		  	0);
	ДанныеСумм.Вставить("СтоимостьЗабалансовая", 	0);
	ДанныеСумм.Вставить("ДопРасходы", 	  		  	0);
	ДанныеСумм.Вставить("ДопРасходыБезНДС", 	  	0);
	ДанныеСумм.Вставить("СтоимостьРегл", 		  	0);
	ДанныеСумм.Вставить("ДопРасходыРегл", 		  	0);
	ДанныеСумм.Вставить("СтоимостьЗабалансоваяРегл",0);
	ДанныеСумм.Вставить("НДСРегл", 			    	0);
	ДанныеСумм.Вставить("ПостояннаяРазница", 		0);
	ДанныеСумм.Вставить("ВременнаяРазница", 		0);
	ДанныеСумм.Вставить("СтоимостьУпр", 		  	0);
	ДанныеСумм.Вставить("ДопРасходыУпр",  		  	0);
	ДанныеСумм.Вставить("НДСУпр",	 			    0);
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСумм, ДанныеЗаполнения);
	КонецЕсли;
	
	Возврат ДанныеСумм;
	
КонецФункции

// Служебная, этап 3.2
// Формирует таблицу расходов, распределенных на себестоимость товаров
// по указанному в статьях расходов правилу распределения.
//
// Параметры:
//	Дата - Дата, на которую выполняется получение остатка расходов
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица распределения расходов на себестоимость
//
Функция ТаблицаРаспределенияРасходовНаСебестоимостьТоваров(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	0                               КАК НомерСтроки,
	|	ПрочиеРасходы.Организация       КАК Организация,
	|	ПрочиеРасходы.Подразделение     КАК Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов    КАК СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.СтатьяРасходов.ПравилоРаспределенияНаСебестоимость КАК ПравилоРаспределения,
	|	(ВЫБОР
	|		КОГДА ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ПрочиеРасходы.Стоимость
	|		ИНАЧЕ 0 КОНЕЦ) КАК Сумма,
	|	(ВЫБОР
	|		КОГДА ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ПрочиеРасходы.СтоимостьБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаБезНДС,
	|	(ВЫБОР
	|		КОГДА ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ПрочиеРасходы.СтоимостьРегл +
	|			(ВЫБОР
	|				КОГДА ПрочиеРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|						ТОГДА ПрочиеРасходы.НДСРегл
	|				ИНАЧЕ 0 КОНЕЦ)
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	(ВЫБОР
	|		КОГДА ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		 И ПрочиеРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|			ТОГДА ПрочиеРасходы.НДСУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	|	(ВЫБОР
	|		КОГДА ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ПрочиеРасходы.ПостояннаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостояннаяРазница,
	|	(ВЫБОР
	|		КОГДА ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ПрочиеРасходы.ВременнаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ВременнаяРазница
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПартииПрочихРасходов КАК ПрочиеРасходы
	|ГДЕ
	|	(ПрочиеРасходы.Стоимость > 0 ИЛИ ПрочиеРасходы.СтоимостьБезНДС > 0 ИЛИ ПрочиеРасходы.СтоимостьРегл > 0)
	|	И ПрочиеРасходы.СтатьяРасходов.ПравилоРаспределенияНаСебестоимость <> ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьТоваров.ПустаяСсылка)
	|	И (ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|			= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		ИЛИ ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|			= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|";
	
	РезультатЗапроса = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
	ТаблицаРасходов = РезультатЗапроса.Выгрузить();
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТаблицы Из ТаблицаРасходов Цикл
		СтрокаТаблицы.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаРасходов", ТаблицаРасходов);
	
	Запрос.Текст = ""
		+ ТекстЗапросаВтТаблицаРасходовПоОстаткам()
		+ ТекстЗапросаТаблицаСпособовРаспределения()
		+ ТекстЗапросаТаблицаДокументов()
		+ ТекстЗапросаТаблицаПоступленияТоваров()
		+ ТекстЗапросаТаблицаБазыРаспределения()
		+ ТекстЗапросаТаблицаРасходов();
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// МассивРезультатов[0] - временная таблица "ВтТаблицаРасходов"
	// МассивРезультатов[1] - временная таблица "ТаблицаСпособовРаспределения"
	// МассивРезультатов[2] - временная таблица "ТаблицаДокументов"
	// МассивРезультатов[3] - временная таблица "ВтПоступленияТоваров"
	// МассивРезультатов[4] - временная таблица "ТаблицаПоступленияТоваров"
	РезультатЗапросаПоБазе = МассивРезультатов[5];
	ТаблицаРасходов = МассивРезультатов[6].Выгрузить();
	
	// Сформируем таблицу распределения расходов.
	ТаблицаРаспределенияРасходов = Новый ТаблицаЗначений;
	Колонки = ТаблицаРаспределенияРасходов.Колонки;
	Колонки.Добавить("Организация",                Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Колонки.Добавить("Подразделение",              Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Колонки.Добавить("СтатьяРасходовСписания",     Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	Колонки.Добавить("АналитикаРасходов");
	Колонки.Добавить("АналитикаУчетаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	Колонки.Добавить("ВидЗапасов",                 Новый ОписаниеТипов("СправочникСсылка.ВидыЗапасов"));
	
	Колонки.Добавить("ДопРасходы",           ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	Колонки.Добавить("ДопРасходыБезНДС",     ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	Колонки.Добавить("ДопРасходыРегл",       ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	Колонки.Добавить("ДопРасходыУпр",        ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	Колонки.Добавить("ПостояннаяРазница",    ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	Колонки.Добавить("ВременнаяРазница",     ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	
	СтруктураОтбора = Новый Структура("ИндексБазы");

	// Выборка строк базы распределения по индексу аналитики.
	ВыборкаПоИндексу = РезультатЗапросаПоБазе.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоИндексу.Следующий() Цикл
		
		Если ВыборкаПоИндексу.База = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора.ИндексБазы = ВыборкаПоИндексу.ИндексБазы;

		// Получаем массив расходов, имеющих одинаковый индекс аналитики, соответствующий текущей выборки базы распределения.
		// Данные затраты будут распределены по одинаковой базе распределения.
		МассивРасходов = ТаблицаРасходов.НайтиСтроки(СтруктураОтбора);
		Если МассивРасходов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаПоИндексу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Для Каждого СтрокаРасходов Из МассивРасходов Цикл
		
			СуммаКРаспределению				= СтрокаРасходов.Сумма;
			СуммаБезНДСКРаспределению		= СтрокаРасходов.СуммаБезНДС;
			СуммаРеглКРаспределению			= СтрокаРасходов.СуммаРегл;
			СуммаУпрКРаспределению			= СтрокаРасходов.СуммаУпр;
			ПостояннаяРазницаКРаспределению	= СтрокаРасходов.ПостояннаяРазница;
			ВременнаяРазницаКРаспределению	= СтрокаРасходов.ВременнаяРазница;
			БазаВсего						= ВыборкаПоИндексу.База;
		
			// Выборка строк базы распределения по индексу базы распределения
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл

				Если БазаВсего <> 0 Тогда
					Стоимость			= Окр(СуммаКРаспределению * Выборка.База / БазаВсего, 2, 1); 
					СтоимостьБезНДС		= Окр(СуммаБезНДСКРаспределению * Выборка.База / БазаВсего, 2, 1);
					СтоимостьРегл		= Окр(СуммаРеглКРаспределению * Выборка.База / БазаВсего, 2, 1);
					СтоимостьУпр 		= Окр(СуммаУпрКРаспределению * Выборка.База / БазаВсего, 2, 1);
					ПостояннаяРазница	= Окр(ПостояннаяРазницаКРаспределению * Выборка.База / БазаВсего, 2, 1);
					ВременнаяРазница	= Окр(ВременнаяРазницаКРаспределению * Выборка.База / БазаВсего, 2, 1);
				Иначе
					Стоимость			= 0;
					СтоимостьБезНДС		= 0;
					СтоимостьРегл		= 0;
					СтоимостьУпр		= 0;
					ПостояннаяРазница	= 0;
					ВременнаяРазница	= 0;
				КонецЕсли;

				СуммаКРаспределению = СуммаКРаспределению - Стоимость;
				СуммаБезНДСКРаспределению = СуммаБезНДСКРаспределению - СтоимостьБезНДС;
				СуммаРеглКРаспределению = СуммаРеглКРаспределению - СтоимостьРегл;
				ПостояннаяРазницаКРаспределению = ПостояннаяРазницаКРаспределению - ПостояннаяРазница;
				ВременнаяРазницаКРаспределению = ВременнаяРазницаКРаспределению - ВременнаяРазница;
				БазаВсего = БазаВсего - Выборка.База;

				НоваяСтрока = ТаблицаРаспределенияРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасходов);
				НоваяСтрока.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры;
				НоваяСтрока.ВидЗапасов                 = Выборка.ВидЗапасов;
				НоваяСтрока.Организация                = Выборка.Организация;
				НоваяСтрока.ДопРасходы           	   = Стоимость;
				НоваяСтрока.ДопРасходыБезНДС     	   = СтоимостьБезНДС;
				НоваяСтрока.ДопРасходыРегл             = СтоимостьРегл;
				НоваяСтрока.ДопРасходыУпр              = СтоимостьУпр;
				НоваяСтрока.ПостояннаяРазница          = ПостояннаяРазница;
				НоваяСтрока.ВременнаяРазница           = ВременнаяРазница;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтТаблицаРасходов, ТаблицаСпособовРаспределения,
		|ТаблицаДокументов, ВтПоступленияТоваров, ТаблицаПоступленияТоваров");
	
	ПротоколРасчетаПартийИСебестоимости.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
		ПараметрыРасчета,
		ТаблицаРаспределенияРасходов.Количество());
	
	Возврат ТаблицаРаспределенияРасходов;
	
КонецФункции

#КонецОбласти

#Область ПодготовкаИРешениеСЛУ

// Служебная, этап 3.6
// Функция выполняет корректировку стоимости и количества внешних приходов в узлах при расчете стоимости по ФИФО (Скользящая оценка).
//
// Параметры:
// Запрос - запрос по формированию узлов корректировки.
//
// Возвращаемое значение
// Таблица значений - узлы корректировки стоимости.
//
Процедура ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета, Запрос)

	// Формирование таблицы узлов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	Себестоимость.КоличествоОстаток
	|ПОМЕСТИТЬ ВТНачальныеОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|				И (АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов) В
	|					(ВЫБРАТЬ
	|						Таблица.АналитикаУчетаНоменклатуры,
	|						Таблица.РазделУчета,
	|						Таблица.ВидЗапасов
	|					ИЗ
	|						ВтАналитикаНоменклатуры КАК Таблица)) КАК Себестоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	Себестоимость.Количество 			 		КАК КоличествоОстаток,
	|	Себестоимость.ДопРасходы 		 	 		КАК ДопРасходыОстаток,
	|	Себестоимость.ДопРасходыБезНДС 		 		КАК ДопРасходыБезНДСОстаток,
	|	Себестоимость.Трудозатраты 			 		КАК ТрудозатратыОстаток,
	|	Себестоимость.ПостатейныеПостоянныеСНДС 	КАК ПостатейныеПостоянныеСНДСОстаток,
	|	Себестоимость.ПостатейныеПостоянныеБезНДС 	КАК ПостатейныеПостоянныеБезНДСОстаток,
	|	Себестоимость.ПостатейныеПеременныеСНДС 	КАК ПостатейныеПеременныеСНДСОстаток,
	|	Себестоимость.ПостатейныеПеременныеБезНДС 	КАК ПостатейныеПеременныеБезНДСОстаток
	|ПОМЕСТИТЬ ВТКонечныеОстатки
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|		И Себестоимость.РазделУчета = Таблица.РазделУчета
	|		И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	СУММА(Себестоимость.Количество) КАК КоличествоПриход
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|			И Себестоимость.РазделУчета = Таблица.РазделУчета
	|			И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|	И (Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1) КАК Период,
	|	КонечныеОстатки.Организация,
	|	КонечныеОстатки.АналитикаУчетаНоменклатуры,
	|	КонечныеОстатки.РазделУчета,
	|	КонечныеОстатки.ВидЗапасов,
	|	КонечныеОстатки.Партия,
	|	КонечныеОстатки.АналитикаУчетаПартий,
	|	КонечныеОстатки.АналитикаФинансовогоУчета,
	|	КонечныеОстатки.ВидДеятельностиНДС,
	|
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстаток,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстатокНаКонецПериода,
	|	ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) КАК КоличествоПриход,
	|
	|	0 КАК СтоимостьОстаток,
	|	0 КАК СтоимостьБезНДСОстаток,
	|	0 КАК СтоимостьЗабалансоваяОстаток,
	|	0 КАК ПостояннаяРазницаОстаток,
	|	0 КАК ВременнаяРазницаОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыБезНДСОстаток,
	|
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеСНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеСНДСОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеБезНДСОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеСНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеСНДСОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеБезНДСОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ВТКонечныеОстатки КАК КонечныеОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК НачальныеОстатки
	|		ПО КонечныеОстатки.Организация = НачальныеОстатки.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = НачальныеОстатки.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = НачальныеОстатки.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = НачальныеОстатки.ВидЗапасов
	|		И КонечныеОстатки.Партия = НачальныеОстатки.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий = НачальныеОстатки.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета = НачальныеОстатки.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС = НачальныеОстатки.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК Приходы
	|		ПО КонечныеОстатки.Организация = Приходы.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = Приходы.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = Приходы.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = Приходы.ВидЗапасов
	|		И КонечныеОстатки.Партия = Приходы.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий = Приходы.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета = Приходы.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС = Приходы.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТНачальныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТКонечныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТПриходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	1 
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	Запрос.Текст =
	"
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация                           КАК Организация,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.РазделУчета                           КАК РазделУчета,
	|	СебестоимостьТоваров.ВидЗапасов                            КАК ВидЗапасов,
	|	СебестоимостьТоваров.Партия 							   КАК Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий 				   КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета 			   КАК АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС 				   КАК ВидДеятельностиНДС,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, День)) КАК Период
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|			ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|				И СебестоимостьТоваров.РазделУчета 				 = ТаблицаОстатков.РазделУчета
	|				И СебестоимостьТоваров.ВидЗапасов  				 = ТаблицаОстатков.ВидЗапасов
	|				И СебестоимостьТоваров.Организация 				 = ТаблицаОстатков.Организация
	|				И СебестоимостьТоваров.Партия 					 = ТаблицаОстатков.Партия
	|				И СебестоимостьТоваров.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|				И СебестоимостьТоваров.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|				И СебестоимостьТоваров.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|				И ТаблицаОстатков.КоличествоОстаток <> 0
	|ГДЕ
	|	СебестоимостьТоваров.СлужебноеВидДвиженияПриход
	|	И СебестоимостьТоваров.Стоимость <> 0
	|	И СебестоимостьТоваров.Период < ТаблицаОстатков.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Период                                КАК Период,
	|	Себестоимость.Организация                           КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                           КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                            КАК ВидЗапасов,
	|	Себестоимость.Партия 							    КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий 				    КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета 			КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС 				    КАК ВидДеятельностиНДС,
	|	СУММА(Себестоимость.Количество)        				КАК Количество,
	|	СУММА(Себестоимость.Стоимость)         				КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)   				КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)   		КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.ПостояннаяРазница) 				КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)  				КАК ВременнаяРазница
	|ПОМЕСТИТЬ ТаблицаВнешнихПоступлений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПериодыПартий.Период                                КАК Период,
	|		ПериодыПартий.Организация                           КАК Организация,
	|		ПериодыПартий.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|		ПериодыПартий.РазделУчета                           КАК РазделУчета,
	|		ПериодыПартий.ВидЗапасов                            КАК ВидЗапасов,
	|		ПериодыПартий.Партия 							    КАК Партия,
	|		ПериодыПартий.АналитикаУчетаПартий 				    КАК АналитикаУчетаПартий,
	|		ПериодыПартий.АналитикаФинансовогоУчета 			КАК АналитикаФинансовогоУчета,
	|		ПериодыПартий.ВидДеятельностиНДС 				    КАК ВидДеятельностиНДС,
	|		ЕСТЬNULL(Себестоимость.Количество, 0)        		КАК Количество,
	|		ЕСТЬNULL(Себестоимость.Стоимость, 0)         		КАК Стоимость,
	|		ЕСТЬNULL(Себестоимость.СтоимостьБезНДС, 0)   		КАК СтоимостьБезНДС,
	|		ЕСТЬNULL(Себестоимость.СтоимостьЗабалансовая, 0)   	КАК СтоимостьЗабалансовая,
	|		ЕСТЬNULL(Себестоимость.ПостояннаяРазница, 0) 		КАК ПостояннаяРазница,
	|		ЕСТЬNULL(Себестоимость.ВременнаяРазница, 0)  		КАК ВременнаяРазница
	|	ИЗ
	|		ТаблицаПериодыПартий КАК ПериодыПартий
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|			ПО ПериодыПартий.АналитикаУчетаНоменклатуры   = Себестоимость.АналитикаУчетаНоменклатуры
	|				И ПериодыПартий.РазделУчета               = Себестоимость.РазделУчета
	|				И ПериодыПартий.ВидЗапасов                = Себестоимость.ВидЗапасов
	|				И ПериодыПартий.Организация               = Себестоимость.Организация
	|				И ПериодыПартий.Партия 					  = Себестоимость.Партия
	|				И ПериодыПартий.АналитикаУчетаПартий 	  = Себестоимость.АналитикаУчетаПартий
	|				И ПериодыПартий.АналитикаФинансовогоУчета = Себестоимость.АналитикаФинансовогоУчета
	|				И ПериодыПартий.ВидДеятельностиНДС 		  = Себестоимость.ВидДеятельностиНДС
	|				И Себестоимость.СлужебноеВидДвиженияПриход
	|				И (Себестоимость.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|				И (Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступлениеВнешнее))
	|				И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	) КАК Себестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВнешнихПоступлений.Период КАК Период,
	|	ТаблицаОстатков.Организация,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.РазделУчета,
	|	ТаблицаОстатков.ВидЗапасов,
	|	ТаблицаОстатков.Партия,
	|	ТаблицаОстатков.АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаОстатков.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток > ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ТаблицаОстатков.КоличествоОстаток - ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|		ИНАЧЕ 0 КОНЕЦ) КАК НовыйКоличествоОстаток,
	|	ТаблицаОстатков.КоличествоОстатокНаКонецПериода,
	|	ТаблицаОстатков.КоличествоПриход,
	|
	|	ТаблицаОстатков.СтоимостьОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьОстаток,
	|
	|	ТаблицаОстатков.СтоимостьБезНДСОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьБезНДСОстаток,
	|
	|	ТаблицаОстатков.СтоимостьЗабалансоваяОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьЗабалансоваяОстаток,
	|
	|	ТаблицаОстатков.ПостояннаяРазницаОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.ПостояннаяРазница, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.ПостояннаяРазница, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяПостояннаяРазницаОстаток,
	|
	|	ТаблицаОстатков.ВременнаяРазницаОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.ВременнаяРазница, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.ВременнаяРазница, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяВременнаяРазницаОстаток,
	|
	|	ТаблицаОстатков.СтоимостьДопРасходыОстаток 		 	КАК НоваяСтоимостьДопРасходыОстаток,
	|	ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток 	КАК НоваяСтоимостьДопРасходыБезНДСОстаток,
	|	ТаблицаОстатков.ТрудозатратыОстаток 			 	КАК НоваяТрудозатратыОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеСНДСОстаток 	КАК НоваяПостатейныеПостоянныеСНДСОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеБезНДСОстаток 	КАК НоваяПостатейныеПостоянныеБезНДСОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеСНДСОстаток 	КАК НоваяПостатейныеПеременныеСНДСОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеБезНДСОстаток 	КАК НоваяПостатейныеПеременныеБезНДСОстаток
	|
	|ПОМЕСТИТЬ ТаблицаНовыхОстатков
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихПоступлений КАК ТаблицаВнешнихПоступлений
	|		ПО ТаблицаОстатков.АналитикаУчетаНоменклатуры 	= ТаблицаВнешнихПоступлений.АналитикаУчетаНоменклатуры
	|			И ТаблицаОстатков.Организация 				= ТаблицаВнешнихПоступлений.Организация
	|			И ТаблицаОстатков.РазделУчета 				= ТаблицаВнешнихПоступлений.РазделУчета
	|			И ТаблицаОстатков.ВидЗапасов  				= ТаблицаВнешнихПоступлений.ВидЗапасов
	|			И ТаблицаОстатков.Партия 					= ТаблицаВнешнихПоступлений.Партия
	|			И ТаблицаОстатков.АналитикаУчетаПартий 	  	= ТаблицаВнешнихПоступлений.АналитикаУчетаПартий
	|			И ТаблицаОстатков.АналитикаФинансовогоУчета = ТаблицаВнешнихПоступлений.АналитикаФинансовогоУчета
	|			И ТаблицаОстатков.ВидДеятельностиНДС 		= ТаблицаВнешнихПоступлений.ВидДеятельностиНДС
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаВнешнихПоступлений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхОстатков.Период,
	|	ТаблицаНовыхОстатков.Организация,
	|	ТаблицаНовыхОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаНовыхОстатков.РазделУчета,
	|	ТаблицаНовыхОстатков.ВидЗапасов,
	|	ТаблицаНовыхОстатков.Партия,
	|	ТаблицаНовыхОстатков.АналитикаУчетаПартий,
	|	ТаблицаНовыхОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаНовыхОстатков.ВидДеятельностиНДС,
	|
	|	ТаблицаНовыхОстатков.НовыйКоличествоОстаток КАК КоличествоОстаток,
	|	ТаблицаНовыхОстатков.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаНовыхОстатков.КоличествоПриход,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьОстаток КАК СтоимостьОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьБезНДСОстаток КАК СтоимостьБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяОстаток КАК СтоимостьЗабалансоваяОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостояннаяРазницаОстаток КАК ПостояннаяРазницаОстаток,
	|	ТаблицаНовыхОстатков.НоваяВременнаяРазницаОстаток КАК ВременнаяРазницаОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыОстаток КАК СтоимостьДопРасходыОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыБезНДСОстаток КАК СтоимостьДопРасходыБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыОстаток КАК ТрудозатратыОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеСНДСОстаток КАК ПостатейныеПостоянныеСНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеБезНДСОстаток КАК ПостатейныеПостоянныеБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеСНДСОстаток КАК ПостатейныеПеременныеСНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеБезНДСОстаток КАК ПостатейныеПеременныеБезНДСОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ТаблицаНовыхОстатков КАК ТаблицаНовыхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаНовыхОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ТаблицаПериодыПартий КАК ТаблицаПериодыПартий
	|";
	
	Пока Истина Цикл 
		
		// Максимальное количество выполнений запроса = максимальному количеству поступлений товара на склад.
		РезультатЗапроса = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		ПротоколРасчетаПартийИСебестоимости.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
			ПараметрыРасчета,
			УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ТаблицаОстатков"));
		
	КонецЦикла;

	// Выполняется корректировка количества и стоимости внешних приходов в узел.
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаУзлыКорректировки.Организация                КАК Организация,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаУзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	ТаблицаУзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаУзлыКорректировки.Партия 					КАК Партия,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаПартий 		КАК АналитикаУчетаПартий,
	|	ТаблицаУзлыКорректировки.КодСтрокиПродукция 		КАК КодСтрокиПродукция,
	|	ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета 	КАК АналитикаФинансовогоУчета,
	|	ТаблицаУзлыКорректировки.ВидДеятельностиНДС 		КАК ВидДеятельностиНДС,
	|	ТаблицаУзлыКорректировки.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ТаблицаУзлыКорректировки.СтатьяРасходов				КАК СтатьяРасходов,
	|	ТаблицаУзлыКорректировки.АналитикаРасходов			КАК АналитикаРасходов,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_1      	КАК СтоимостьЗнакГраф_1,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_2    	КАК СтоимостьЗнакГраф_2,
	|	ТаблицаУзлыКорректировки.ВесГраф_1
	|		 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_1,
	|	ТаблицаУзлыКорректировки.ВесГраф_2
	|		 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_2,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьГраф_1,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьГраф_2,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьЗабалансовая * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьЗабалансовая,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостояннаяРазница * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостояннаяРазницаОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК ПостояннаяРазница,
	|	ТаблицаУзлыКорректировки.ПостояннаяРазницаЗнак,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ВременнаяРазница * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ВременнаяРазницаОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК ВременнаяРазница,
	|	ТаблицаУзлыКорректировки.ВременнаяРазницаЗнак,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ДопРасходыГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ДопРасходыГраф_1,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ДопРасходыГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ДопРасходыГраф_2,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ТрудозатратыГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ТрудозатратыГраф_1,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ТрудозатратыГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ТрудозатратыГраф_2,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПостоянныеГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеСНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПостоянныеГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеБезНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПеременныеГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеСНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеГраф_1,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПеременныеГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеБезНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеГраф_2
	|ПОМЕСТИТЬ ВтУзлыКорректировкиВременная
	|ИЗ
	|	ВтУзлыКорректировки КАК ТаблицаУзлыКорректировки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И ТаблицаУзлыКорректировки.РазделУчета               = ТаблицаОстатков.РазделУчета
	|			И ТаблицаУзлыКорректировки.ВидЗапасов                = ТаблицаОстатков.ВидЗапасов
	|			И ТаблицаУзлыКорректировки.Организация               = ТаблицаОстатков.Организация
	|			И ТаблицаУзлыКорректировки.Партия 					 = ТаблицаОстатков.Партия
	|			И ТаблицаУзлыКорректировки.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|			И ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|			И ТаблицаУзлыКорректировки.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.КодСтрокиПродукция 		КАК КодСтрокиПродукция,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтоимостьЗнакГраф_1 КАК СтоимостьЗнакГраф_1,
	|	Т.СтоимостьЗнакГраф_2 КАК СтоимостьЗнакГраф_2,
	|	Т.ВесГраф_1 КАК ВесГраф_1,
	|	Т.ВесГраф_2 КАК ВесГраф_2,
	|	Т.СтоимостьГраф_1 КАК СтоимостьГраф_1,
	|	Т.СтоимостьГраф_2 КАК СтоимостьГраф_2,
	|	Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ПостояннаяРазницаЗнак КАК ПостояннаяРазницаЗнак,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	|	Т.ВременнаяРазницаЗнак КАК ВременнаяРазницаЗнак,
	|	Т.ДопРасходыГраф_1 КАК ДопРасходыГраф_1,
	|	Т.ДопРасходыГраф_2 КАК ДопРасходыГраф_2,
	|	Т.ТрудозатратыГраф_1 КАК ТрудозатратыГраф_1,
	|	Т.ТрудозатратыГраф_2 КАК ТрудозатратыГраф_2,
	|	Т.ПостатейныеПостоянныеГраф_1 КАК ПостатейныеПостоянныеГраф_1,
	|	Т.ПостатейныеПостоянныеГраф_2 КАК ПостатейныеПостоянныеГраф_2,
	|	Т.ПостатейныеПеременныеГраф_1 КАК ПостатейныеПеременныеГраф_1,
	|	Т.ПостатейныеПеременныеГраф_2 КАК ПостатейныеПеременныеГраф_2
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|	ВтУзлыКорректировкиВременная КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировкиВременная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Служебная, этап 3.10
Процедура ПодготовитьДанныеДляРасчетаСтоимостиРеглПоФИФО(ПараметрыРасчета, Запрос)

	// Формирование таблицы узлов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.КоличествоОстаток
	|ПОМЕСТИТЬ ВТНачальныеОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|		Организация В (&МассивОрганизаций)
	|		И (АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов) В (
	|			ВЫБРАТЬ
	|				Таблица.АналитикаУчетаНоменклатуры,
	|				Таблица.РазделУчета,
	|				Таблица.ВидЗапасов
	|			ИЗ ВтАналитикаНоменклатуры КАК Таблица)
	|	) КАК Себестоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.Количество КАК КоличествоОстаток,
	|	Себестоимость.ДопРасходыРегл КАК ДопРасходыРеглОстаток,
	|	Себестоимость.ТрудозатратыРегл КАК ТрудозатратыРеглОстаток,
	|	Себестоимость.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРеглОстаток,
	|	Себестоимость.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРеглОстаток,
	|	Себестоимость.ДопРасходыУпр КАК ДопРасходыУпрОстаток,
	|	Себестоимость.ТрудозатратыУпр КАК ТрудозатратыУпрОстаток,
	|	Себестоимость.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпрОстаток,
	|	Себестоимость.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпрОстаток
	|ПОМЕСТИТЬ ВТКонечныеОстатки
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|		И Себестоимость.РазделУчета = Таблица.РазделУчета
	|		И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	СУММА(Себестоимость.Количество) КАК КоличествоПриход,
	|	СУММА(ВЫБОР
	|		КОГДА Себестоимость.Количество = 0
	|		 И НЕ Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|		 И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
	|			ВЫБОР
	|				КОГДА &ПартионныйУчетВерсии22 ТОГДА Себестоимость.ДопРасходыРегл
	|				ИНАЧЕ Себестоимость.СтоимостьРегл КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьДопРасходы,
	|	СУММА(ВЫБОР
	|		КОГДА Себестоимость.Количество = 0
	|		 И НЕ Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|		 И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
	|			ВЫБОР
	|				КОГДА &ПартионныйУчетВерсии22 ТОГДА Себестоимость.ДопРасходыУпр
	|				ИНАЧЕ Себестоимость.СтоимостьУпр КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ДопРасходыУпр
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|			И Себестоимость.РазделУчета = Таблица.РазделУчета
	|			И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|	И (Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1) КАК Период,
	|	КонечныеОстатки.Организация,
	|	КонечныеОстатки.АналитикаУчетаНоменклатуры,
	|	КонечныеОстатки.РазделУчета,
	|	КонечныеОстатки.ВидЗапасов,
	|	КонечныеОстатки.Партия,
	|	КонечныеОстатки.АналитикаУчетаПартий,
	|	КонечныеОстатки.АналитикаФинансовогоУчета,
	|	КонечныеОстатки.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОстаток,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОстатокНаКонецПериода,
	|	ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) КАК КоличествоПриход,
	|
	|	0 КАК СтоимостьРеглОстаток,
	|	0 КАК СтоимостьУпрОстаток,
	|	0 КАК СтоимостьЗабалансоваяРеглОстаток,
	|	(ВЫБОР
	|		КОГДА &ПартионныйУчетВерсии22 
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		КОГДА НЕ &ПартионныйУчетВерсии22 
	|		 И ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * ЕСТЬNULL(Приходы.СтоимостьДопРасходы, 0) /
	|					(ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыУпрОстаток /
	|					(ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпрОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыУпрОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыУпрОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеУпрОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеУпрОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеУпрОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеУпрОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ВТКонечныеОстатки КАК КонечныеОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК НачальныеОстатки
	|		ПО КонечныеОстатки.Организация 				 = НачальныеОстатки.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = НачальныеОстатки.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета 				 = НачальныеОстатки.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов 				 = НачальныеОстатки.ВидЗапасов
	|		И КонечныеОстатки.Партия 					 = НачальныеОстатки.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий 		 = НачальныеОстатки.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета  = НачальныеОстатки.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС 		 = НачальныеОстатки.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК Приходы
	|		ПО КонечныеОстатки.Организация 				 = Приходы.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = Приходы.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета 				 = Приходы.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов 				 = Приходы.ВидЗапасов
	|		И КонечныеОстатки.Партия 					 = Приходы.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий 		 = Приходы.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета  = Приходы.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС 		 = Приходы.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТНачальныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТКонечныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТПриходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	1 
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	Запрос.Текст =
	"
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация                           КАК Организация,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.РазделУчета                           КАК РазделУчета,
	|	СебестоимостьТоваров.ВидЗапасов                            КАК ВидЗапасов,
	|	СебестоимостьТоваров.Партия                          	   КАК Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий                  КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета             КАК АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС                    КАК ВидДеятельностиНДС,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, День)) КАК Период
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры 		= ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И СебестоимостьТоваров.РазделУчета 					= ТаблицаОстатков.РазделУчета
	|			И СебестоимостьТоваров.ВидЗапасов  					= ТаблицаОстатков.ВидЗапасов
	|			И СебестоимостьТоваров.Организация 					= ТаблицаОстатков.Организация
	|			И СебестоимостьТоваров.Партия 						= ТаблицаОстатков.Партия
	|			И СебестоимостьТоваров.АналитикаУчетаПартий 		= ТаблицаОстатков.АналитикаУчетаПартий
	|			И СебестоимостьТоваров.АналитикаФинансовогоУчета 	= ТаблицаОстатков.АналитикаФинансовогоУчета
	|			И СебестоимостьТоваров.ВидДеятельностиНДС 			= ТаблицаОстатков.ВидДеятельностиНДС
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|ГДЕ
	|	СебестоимостьТоваров.СлужебноеВидДвиженияПриход
	|	И НЕ СебестоимостьТоваров.РасчетСебестоимости
	|	И (СебестоимостьТоваров.СтоимостьРегл <> 0 ИЛИ СебестоимостьТоваров.СтоимостьУпр <> 0)
	|	И СебестоимостьТоваров.Период < ТаблицаОстатков.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПериодыПартий.Организация                         			 КАК Организация,
	|	ПериодыПартий.АналитикаУчетаНоменклатуры          			 КАК АналитикаУчетаНоменклатуры,
	|	ПериодыПартий.РазделУчета                         			 КАК РазделУчета,
	|	ПериодыПартий.ВидЗапасов                          			 КАК ВидЗапасов,
	|	ПериодыПартий.Партия                          	  			 КАК Партия,
	|	ПериодыПартий.АналитикаУчетаПартий                			 КАК АналитикаУчетаПартий,
	|	ПериодыПартий.АналитикаФинансовогоУчета           			 КАК АналитикаФинансовогоУчета,
	|	ПериодыПартий.ВидДеятельностиНДС                  			 КАК ВидДеятельностиНДС,
	|	ПериодыПартий.Период                              			 КАК Период,
	|
	|	СУММА(ЕСТЬNULL(Себестоимость.Количество, 0))             	 КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА ЕСТЬNULL(Себестоимость.Количество, 0) <> 0 ТОГДА ЕСТЬNULL(Себестоимость.СтоимостьРегл, 0)
	|		ИНАЧЕ 0 КОНЕЦ
	|	) КАК СтоимостьРегл,
	|	СУММА(ЕСТЬNULL(Себестоимость.СтоимостьЗабалансоваяРегл, 0))  КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(
	|		ВЫБОР КОГДА ЕСТЬNULL(Себестоимость.Количество, 0) <> 0 ТОГДА ЕСТЬNULL(Себестоимость.СтоимостьУпр, 0)
	|		ИНАЧЕ 0 КОНЕЦ
	|	) КАК СтоимостьУпр
	|
	|ПОМЕСТИТЬ ТаблицаВнешнихПоступлений
	|
	|ИЗ
	|	ТаблицаПериодыПартий КАК ПериодыПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|		ПО ПериодыПартий.АналитикаУчетаНоменклатуры 	= Себестоимость.АналитикаУчетаНоменклатуры
	|			И ПериодыПартий.РазделУчета             	= Себестоимость.РазделУчета
	|			И ПериодыПартий.ВидЗапасов              	= Себестоимость.ВидЗапасов
	|			И ПериодыПартий.Организация             	= Себестоимость.Организация
	|			И ПериодыПартий.Партия 						= Себестоимость.Партия
	|			И ПериодыПартий.АналитикаУчетаПартий 		= Себестоимость.АналитикаУчетаПартий
	|			И ПериодыПартий.АналитикаФинансовогоУчета 	= Себестоимость.АналитикаФинансовогоУчета
	|			И ПериодыПартий.ВидДеятельностиНДС 			= Себестоимость.ВидДеятельностиНДС
	|			И Себестоимость.СлужебноеВидДвиженияПриход
	|			И (Себестоимость.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|			И (Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступлениеВнешнее))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыПартий.АналитикаУчетаНоменклатуры,
	|	ПериодыПартий.РазделУчета,
	|	ПериодыПартий.ВидЗапасов,
	|	ПериодыПартий.Организация,
	|	ПериодыПартий.Партия,
	|	ПериодыПартий.АналитикаУчетаПартий,
	|	ПериодыПартий.АналитикаФинансовогоУчета,
	|	ПериодыПартий.ВидДеятельностиНДС,
	|	ПериодыПартий.Период
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВнешнихПоступлений.Период КАК Период,
	|	ТаблицаОстатков.Организация,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.РазделУчета,
	|	ТаблицаОстатков.ВидЗапасов,
	|	ТаблицаОстатков.Партия,
	|	ТаблицаОстатков.АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаОстатков.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток > ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ТаблицаОстатков.КоличествоОстаток - ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|		ИНАЧЕ 0 КОНЕЦ) КАК НовыйКоличествоОстаток,
	|	ТаблицаОстатков.КоличествоОстатокНаКонецПериода,
	|	ТаблицаОстатков.КоличествоПриход,
	|
	|	ТаблицаОстатков.СтоимостьРеглОстаток +
	|	ВЫБОР КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0) ТОГДА
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ КАК НоваяСтоимостьРеглОстаток,
	|	ТаблицаОстатков.СтоимостьУпрОстаток +
	|	ВЫБОР КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0) ТОГДА
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьУпр, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьУпр, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ КАК НоваяСтоимостьУпрОстаток,
	|	ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток +
	|	ВЫБОР КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0) ТОГДА
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ КАК НоваяСтоимостьЗабалансоваяРеглОстаток,
	|
	|	ТаблицаОстатков.СтоимостьДопРасходыОстаток КАК НоваяСтоимостьДопРасходыОстаток,
	|	ТаблицаОстатков.ТрудозатратыРеглОстаток    КАК НоваяТрудозатратыРеглОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеРеглОстаток КАК НоваяПостатейныеПостоянныеРеглОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеРеглОстаток КАК НоваяПостатейныеПеременныеРеглОстаток,
	|
	|	ТаблицаОстатков.ДопРасходыУпрОстаток КАК НоваяДопРасходыУпрОстаток,
	|	ТаблицаОстатков.ТрудозатратыУпрОстаток    КАК НоваяТрудозатратыУпрОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеУпрОстаток КАК НоваяПостатейныеПостоянныеУпрОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеУпрОстаток КАК НоваяПостатейныеПеременныеУпрОстаток
	|
	|ПОМЕСТИТЬ ТаблицаНовыхОстатков
	|
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихПоступлений КАК ТаблицаВнешнихПоступлений
	|		ПО ТаблицаОстатков.АналитикаУчетаНоменклатуры 	= ТаблицаВнешнихПоступлений.АналитикаУчетаНоменклатуры
	|			И ТаблицаОстатков.Организация 				= ТаблицаВнешнихПоступлений.Организация
	|			И ТаблицаОстатков.РазделУчета 				= ТаблицаВнешнихПоступлений.РазделУчета
	|			И ТаблицаОстатков.ВидЗапасов  				= ТаблицаВнешнихПоступлений.ВидЗапасов
	|			И ТаблицаОстатков.Партия 					= ТаблицаВнешнихПоступлений.Партия
	|			И ТаблицаОстатков.АналитикаУчетаПартий 		= ТаблицаВнешнихПоступлений.АналитикаУчетаПартий
	|			И ТаблицаОстатков.АналитикаФинансовогоУчета = ТаблицаВнешнихПоступлений.АналитикаФинансовогоУчета
	|			И ТаблицаОстатков.ВидДеятельностиНДС 		= ТаблицаВнешнихПоступлений.ВидДеятельностиНДС
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаВнешнихПоступлений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхОстатков.Период,
	|	ТаблицаНовыхОстатков.Организация,
	|	ТаблицаНовыхОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаНовыхОстатков.РазделУчета,
	|	ТаблицаНовыхОстатков.ВидЗапасов,
	|	ТаблицаНовыхОстатков.Партия,
	|	ТаблицаНовыхОстатков.АналитикаУчетаПартий,
	|	ТаблицаНовыхОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаНовыхОстатков.ВидДеятельностиНДС,
	|	ТаблицаНовыхОстатков.НовыйКоличествоОстаток          		КАК КоличествоОстаток,
	|	ТаблицаНовыхОстатков.КоличествоОстатокНаКонецПериода 		КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаНовыхОстатков.КоличествоПриход				 		КАК КоличествоПриход,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьРеглОстаток       		КАК СтоимостьРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьУпрОстаток       		КАК СтоимостьУпрОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяРеглОстаток 	КАК СтоимостьЗабалансоваяРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыОстаток 		КАК СтоимостьДопРасходыОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыРеглОстаток 	 		КАК ТрудозатратыРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеРеглОстаток  КАК ПостатейныеПостоянныеРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеРеглОстаток  КАК ПостатейныеПеременныеРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяДопРасходыУпрОстаток 				КАК ДопРасходыУпрОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыУпрОстаток 	 		КАК ТрудозатратыУпрОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеУпрОстаток   КАК ПостатейныеПостоянныеУпрОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеУпрОстаток   КАК ПостатейныеПеременныеУпрОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|
	|ИЗ
	|	ТаблицаНовыхОстатков КАК ТаблицаНовыхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаНовыхОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ТаблицаПериодыПартий КАК ТаблицаПериодыПартий
	|";
	
	Пока Истина Цикл 
		
		// Максимальное количество выполнений запроса = максимальному количеству поступлений товара на склад.
		РезультатЗапроса = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		ПротоколРасчетаПартийИСебестоимости.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
			ПараметрыРасчета,
			УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ТаблицаОстатков"));
		
	КонецЦикла;

	// Выполняется корректировка количества и стоимости внешних приходов в узел.
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаУзлыКорректировки.Организация                КАК Организация,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаУзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	ТаблицаУзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаУзлыКорректировки.Партия 					КАК Партия,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаПартий 		КАК АналитикаУчетаПартий,
	|	ТаблицаУзлыКорректировки.КодСтрокиПродукция 		КАК КодСтрокиПродукция,
	|	ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	ТаблицаУзлыКорректировки.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|	ТаблицаУзлыКорректировки.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ТаблицаУзлыКорректировки.СтатьяРасходов				КАК СтатьяРасходов,
	|	ТаблицаУзлыКорректировки.АналитикаРасходов			КАК АналитикаРасходов,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_1       	КАК СтоимостьЗнакГраф_1,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_2    	КАК СтоимостьЗнакГраф_2,
	|	ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_1,
	|	ТаблицаУзлыКорректировки.ВесГраф_2
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_2,
	|
	|	(ВЫБОР КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|	ТОГДА
	|		0
	|	КОГДА (ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0))
	|		/(ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ)
	|	+ (
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА 0
	|	КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|	ТОГДА
	|		0
	|	КОГДА (ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.ДопРасходыГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0))
	|		/(ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ) КАК СтоимостьГраф_1,
	|
	|	(ВЫБОР КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|	ТОГДА
	|		0
	|	КОГДА (ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0)) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|		- ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0))
	|		/(ТаблицаУзлыКорректировки.ВесГраф_2
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ)
	|	+ (
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА 0
	|	КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|	ТОГДА
	|		0
	|	КОГДА (ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0)) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.ДопРасходыГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|		- ЕСТЬNULL(ТаблицаОстатков.ДопРасходыУпрОстаток, 0))
	|		/(ТаблицаУзлыКорректировки.ВесГраф_2
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ) КАК СтоимостьГраф_2,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьЗабалансовая * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьЗабалансовая,
	|	
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22 ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ДопРасходыГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                              КАК ДопРасходыГраф_1,
	
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22 ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ДопРасходыГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.ДопРасходыУпрОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                              КАК ДопРасходыГраф_2,
	|
	|	ТаблицаУзлыКорректировки.ПостояннаяРазница         КАК ПостояннаяРазница,
	|	ТаблицаУзлыКорректировки.ПостояннаяРазницаЗнак,
	|	ТаблицаУзлыКорректировки.ВременнаяРазница          КАК ВременнаяРазница,
	|	ТаблицаУзлыКорректировки.ВременнаяРазницаЗнак,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ТрудозатратыГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыРеглОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ТрудозатратыГраф_1,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПостоянныеГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеРеглОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеГраф_1,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПеременныеГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеРеглОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеГраф_1,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ТрудозатратыГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыУпрОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ТрудозатратыГраф_2,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПостоянныеГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеУпрОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеГраф_2,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеПеременныеГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеУпрОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеГраф_2
	|ПОМЕСТИТЬ ВтУзлыКорректировкиВременная
	|ИЗ
	|	ВтУзлыКорректировки КАК ТаблицаУзлыКорректировки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры 	 = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И ТаблицаУзлыКорректировки.РазделУчета             	 = ТаблицаОстатков.РазделУчета
	|			И ТаблицаУзлыКорректировки.ВидЗапасов              	 = ТаблицаОстатков.ВидЗапасов
	|			И ТаблицаУзлыКорректировки.Организация           	 = ТаблицаОстатков.Организация
	|			И ТаблицаУзлыКорректировки.Партия 					 = ТаблицаОстатков.Партия
	|			И ТаблицаУзлыКорректировки.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|			И ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|			И ТаблицаУзлыКорректировки.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтоимостьЗнакГраф_1 КАК СтоимостьЗнакГраф_1,
	|	Т.СтоимостьЗнакГраф_2 КАК СтоимостьЗнакГраф_2,
	|	Т.ВесГраф_1 КАК ВесГраф_1,
	|	Т.ВесГраф_2 КАК ВесГраф_2,
	|	Т.СтоимостьГраф_1 КАК СтоимостьГраф_1,
	|	Т.СтоимостьГраф_2 КАК СтоимостьГраф_2,
	|	Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	Т.ДопРасходыГраф_1 КАК ДопРасходыГраф_1,
	|	Т.ДопРасходыГраф_2 КАК ДопРасходыГраф_2,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ПостояннаяРазницаЗнак КАК ПостояннаяРазницаЗнак,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	|	Т.ВременнаяРазницаЗнак КАК ВременнаяРазницаЗнак,
	|	Т.ТрудозатратыГраф_1 КАК ТрудозатратыГраф_1,
	|	Т.ПостатейныеПостоянныеГраф_1 КАК ПостатейныеПостоянныеГраф_1,
	|	Т.ПостатейныеПеременныеГраф_1 КАК ПостатейныеПеременныеГраф_1,
	|	Т.ТрудозатратыГраф_2 КАК ТрудозатратыГраф_2,
	|	Т.ПостатейныеПостоянныеГраф_2 КАК ПостатейныеПостоянныеГраф_2,
	|	Т.ПостатейныеПеременныеГраф_2 КАК ПостатейныеПеременныеГраф_2
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|	ВтУзлыКорректировкиВременная КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировкиВременная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляРаспределенияРезервов(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	ТекстРезервыПоУзлам = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	0 КАК НомерУзла,
		|	0 КАК РезервГраф_1,
		|	0 КАК РезервГраф_2
		|ПОМЕСТИТЬ РезервыПоУзлам";
	
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстРезервыПоУзлам);
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, Символы.ПС + ";" + Символы.ПС);
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ПриемникиРезервов");
	
КонецПроцедуры

// Служебная, этап 3.7, 3.11
// Процедура выполняет расчет себестоимости аналитики номенклатуры в узлах корректировки стоимости списания.
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешений", содержащая себестоимость
// в каждом узле корректировки.
//
Процедура РешитьСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	СчетчикИтераций   = 1;
	ТекущееОтклонение = 1;
	
	РазмерТаблицыРешений = УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтТаблицаРешений");
	
	Запрос.Текст = 
	"
	// 0 Расчет коэффициентов (количество перехода из состояния в состояние) уравнения.
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                      КАК НомерУзла,
	
		// Показатели графа 1. Стоимость, Стоимость регл.
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА 0
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0)
	|				* ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0)
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0)
	|				* ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))
	|			КОНЕЦ) КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_1,
	|
	|	ВЫРАЗИТЬ(СУММА(
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА 0
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))
	|			КОНЕЦ) КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_1,
	|
	|	ВЫРАЗИТЬ(СУММА(
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА 0
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))
	|			КОНЕЦ) КАК ЧИСЛО(28,10)) КАК ТрудозатратыГраф_1,
	|
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА
	|				ВЫБОР
	|					КОГДА ЕСТЬNULL(Резервы.РезервГраф_1, 0) = 0 ИЛИ (ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10)) 
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_1, 0) > 0) ТОГДА

	|							ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10)) 
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_1, 0)

	|					ИНАЧЕ
	|					 	0
	|				КОНЕЦ
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ 
	|				ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))) КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_1,
	|
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА
	|				ВЫБОР
	|					КОГДА ЕСТЬNULL(Резервы.РезервГраф_1, 0) = 0 ИЛИ (ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10)) 
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_1, 0) > 0) ТОГДА

	|							ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10)) 
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_1, 0)

	|					ИНАЧЕ
	|					 	0
	|				КОНЕЦ
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_1, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ 
	|				ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))) КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_1,
	|
	|	ВЫРАЗИТЬ(СУММА(
	|       (ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(НЕ ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ)
	|				ТОГДА
	|					ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0)
	|						* ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10))	
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) КАК ЧИСЛО(28,10))
	|					- ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазница, 0)
	|						* ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазницаЗнак, 0) КАК ЧИСЛО(28,10))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазница, 0)
	|				* ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазницаЗнак, 0) КАК ЧИСЛО(28,10))
	|		КОНЕЦ) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))) КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница,
	|	
	|	ВЫРАЗИТЬ(СУММА(
	|       (ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ)
	| 				И НЕ ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) ТОГДА	
	|				 	ВЫРАЗИТЬ(ЕСТЬNULL(-ВтТаблицаРешений.СтоимостьГраф_1, 0) 
	|						* ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(-ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(-ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(-ВтТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(-ВтТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазница, 0)
	|						* ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазницаЗнак, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазница, 0)
	|						* ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазницаЗнак, 0) КАК ЧИСЛО(28,10))
	|			ИНАЧЕ 0 КОНЕЦ
	|       + ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ИСТИНА)
	|				ТОГДА 
	|					ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_1, 0)
	|						* ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) КАК ЧИСЛО(28,10))
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) КАК ЧИСЛО(28,10))
	|					- ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазница, 0)
	|						* ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазницаЗнак, 0) КАК ЧИСЛО(28,10))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазница, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазницаЗнак, 0) КАК ЧИСЛО(1,0))
	|			КОНЕЦ)
	|		* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))) КАК ЧИСЛО(28,10)) КАК ВременнаяРазница,
	|
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.РаботаДляДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗабалансовая, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10))
	|		КОНЕЦ) КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансовая,
	|
		// Показатели графа 2. Стоимость без НДС, Стоимость упр.
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА 0
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_2, 0)
	|				* ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_2, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_2, 0)
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_2, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_2, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) КАК ЧИСЛО(28,10))
	|			КОНЕЦ) КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_2,
	|
	|	ВЫРАЗИТЬ(СУММА(
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА 0
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_2, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_2, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) КАК ЧИСЛО(28,10))
	|			КОНЕЦ) КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_2,
	|			
	|	ВЫРАЗИТЬ(СУММА(
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА 0
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_2, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_2, 0) КАК ЧИСЛО(28,10))
	|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) КАК ЧИСЛО(28,10))
	|			КОНЕЦ) КАК ЧИСЛО(28,10)) КАК ТрудозатратыГраф_2,
	|			
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА
	|				ВЫБОР
	|					КОГДА ЕСТЬNULL(Резервы.РезервГраф_2, 0) = 0 
	|						ИЛИ (ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_2, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_2, 0) КАК ЧИСЛО(28,10)) 
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_2, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_2, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_2, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_2, 0) > 0) ТОГДА

	|							ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_2, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_2, 0) КАК ЧИСЛО(28,10)) 
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_2, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_2, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_2, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_2, 0)

	|					ИНАЧЕ
	|					 	0
	|				КОНЕЦ
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_2, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ 
	|				ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПостоянныеГраф_2, 0) КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) КАК ЧИСЛО(28,10))) КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_2,
	|		
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА
	|				ВЫБОР
	|					КОГДА ЕСТЬNULL(Резервы.РезервГраф_2, 0) = 0 
	|						ИЛИ (ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_2, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_2, 0) КАК ЧИСЛО(28,10)) 
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_2, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_2, 0) КАК ЧИСЛО(28,10))
	|						+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_2, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_2, 0) > 0) ТОГДА

	|							ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьГраф_2, 0) * ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗнакГраф_2, 0) КАК ЧИСЛО(28,10)) 
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ТрудозатратыГраф_2, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ДопРасходыГраф_2, 0) КАК ЧИСЛО(28,10))
	|							+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_2, 0) КАК ЧИСЛО(28,10)) - ЕСТЬNULL(Резервы.РезервГраф_2, 0)

	|					ИНАЧЕ
	|					 	0
	|				КОНЕЦ
	|			КОГДА &ЗащитаОтПереполненияПоля > 0 И ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_2, 0)
	|				* ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) > &ЗащитаОтПереполненияПоля 
	|				ТОГДА &ЗащитаОтПереполненияПоля
	|			ИНАЧЕ 
	|				ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеПеременныеГраф_2, 0) КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0) КАК ЧИСЛО(28,10))) КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_2
	|
	|ПОМЕСТИТЬ ВременнаяТаблицаРешений
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
	|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений КАК ВтТаблицаРешений
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешений.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ РезервыПоУзлам КАК Резервы
	|		ПО ВтТаблицаРешений.НомерУзла = Резервы.НомерУзла
	|	
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// 1 Расчет ошибки расчета.
	|ВЫБРАТЬ
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_1 * ТаблицаРешений.СтоимостьЗнакГраф_1, 0)
	|			 			- УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.СтоимостьЗнакГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_1 * ТаблицаРешений.СтоимостьЗнакГраф_1, 0)
	|						- УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.СтоимостьЗнакГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|						ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_1 * ТаблицаРешений.СтоимостьЗнакГраф_1, 0)
	|							- УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.СтоимостьЗнакГраф_1
	|							- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|					 )
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеСтоимостьГраф_1,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_1, 0) - УзлыКорректировки.ДопРасходыГраф_1
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_1, 0) - УзлыКорректировки.ДопРасходыГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_1, 0) - УзлыКорректировки.ДопРасходыГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеДопРасходыГраф_1,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ТрудозатратыГраф_1, 0) - УзлыКорректировки.ТрудозатратыГраф_1
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ТрудозатратыГраф_1, 0) - УзлыКорректировки.ТрудозатратыГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ТрудозатратыГраф_1, 0) - УзлыКорректировки.ТрудозатратыГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеТрудозатратыГраф_1,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) - УзлыКорректировки.ПостатейныеПостоянныеГраф_1
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) - УзлыКорректировки.ПостатейныеПостоянныеГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) - УзлыКорректировки.ПостатейныеПостоянныеГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеПостатейныеПостоянныеГраф_1,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) - УзлыКорректировки.ПостатейныеПеременныеГраф_1
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) - УзлыКорректировки.ПостатейныеПеременныеГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) - УзлыКорректировки.ПостатейныеПеременныеГраф_1
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеПостатейныеПеременныеГраф_1,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ПостояннаяРазница * ТаблицаРешений.ПостояннаяРазницаЗнак, 0)
	|			 			- УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ПостояннаяРазницаЗнак
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостояннаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ПостояннаяРазница * ТаблицаРешений.ПостояннаяРазницаЗнак, 0)
	|						- УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ПостояннаяРазницаЗнак
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостояннаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|						ЕСТЬNULL(ТаблицаРешений.ПостояннаяРазница * ТаблицаРешений.ПостояннаяРазницаЗнак, 0)
	|							- УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ПостояннаяРазницаЗнак
	|							- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостояннаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|					 )
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеПостояннаяРазница,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ВременнаяРазница * ТаблицаРешений.ВременнаяРазницаЗнак, 0)
	|			 			- УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВременнаяРазницаЗнак
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ВременнаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ВременнаяРазница * ТаблицаРешений.ВременнаяРазницаЗнак, 0)
	|						- УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВременнаяРазницаЗнак
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ВременнаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|						ЕСТЬNULL(ТаблицаРешений.ВременнаяРазница * ТаблицаРешений.ВременнаяРазницаЗнак, 0)
	|							- УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВременнаяРазницаЗнак
	|							- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ВременнаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|					 )
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеВременнаяРазница,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая, 0) - УзлыКорректировки.СтоимостьЗабалансовая
	|					- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьЗабалансовая / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая, 0) - УзлыКорректировки.СтоимостьЗабалансовая
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьЗабалансовая / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|						ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая, 0) - УзлыКорректировки.СтоимостьЗабалансовая
	|							- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьЗабалансовая / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
	|					 )
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеЗабалансовая,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_2 * ТаблицаРешений.СтоимостьЗнакГраф_2, 0)
	|			 			- УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.СтоимостьЗнакГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_2 * ТаблицаРешений.СтоимостьЗнакГраф_2, 0)
	|						- УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.СтоимостьЗнакГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|						ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_2 * ТаблицаРешений.СтоимостьЗнакГраф_2, 0)
	|							- УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.СтоимостьЗнакГраф_2
	|							- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|					 )
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеСтоимостьГраф_2,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_2, 0) - УзлыКорректировки.ДопРасходыГраф_2
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_2, 0) - УзлыКорректировки.ДопРасходыГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_2, 0) - УзлыКорректировки.ДопРасходыГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеДопРасходыГраф_2,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ТрудозатратыГраф_2, 0) - УзлыКорректировки.ТрудозатратыГраф_2
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ТрудозатратыГраф_2, 0) - УзлыКорректировки.ТрудозатратыГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ТрудозатратыГраф_2, 0) - УзлыКорректировки.ТрудозатратыГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеТрудозатратыГраф_2,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ПостатейныеПостоянныеГраф_2, 0) - УзлыКорректировки.ПостатейныеПостоянныеГраф_2
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПостоянныеГраф_2, 0) - УзлыКорректировки.ПостатейныеПостоянныеГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПостоянныеГраф_2, 0) - УзлыКорректировки.ПостатейныеПостоянныеГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеПостатейныеПостоянныеГраф_2,
	
	|	ЕСТЬNULL(
	|		МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|					0
	|				КОГДА ЕСТЬNULL(ТаблицаРешений.ПостатейныеПеременныеГраф_2, 0) - УзлыКорректировки.ПостатейныеПеременныеГраф_2
	|					 - ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) > 0 ТОГДА
	|
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПеременныеГраф_2, 0) - УзлыКорректировки.ПостатейныеПеременныеГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|
	|				ИНАЧЕ
	|					-(
	|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеПеременныеГраф_2, 0) - УзлыКорректировки.ПостатейныеПеременныеГраф_2
	|						- ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
	|				 	)
	|			КОНЕЦ
	|			)
	|		,0) КАК ОтклонениеПостатейныеПеременныеГраф_2
	|ИЗ
	|	ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений КАК ТаблицаРешений
	|		ПО ВременнаяТаблицаРешений.НомерУзла = ТаблицаРешений.НомерУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировки
	|		ПО ВременнаяТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// 2 Удаление таблиц.
	|УНИЧТОЖИТЬ ВтТаблицаРешений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// 3 Суммирование коэффициентов.
	|ВЫБРАТЬ
	|	ВременнаяТаблицаРешений.НомерУзла  КАК НомерУзла,
	|	ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|			0
	|		КОГДА УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВременнаяРазницаЗнак + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ВременнаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -1
	|		ИНАЧЕ 1
    |	КОНЕЦ КАК ВременнаяРазницаЗнак,
	|	ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|			0
	|		КОГДА УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ПостояннаяРазницаЗнак + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостояннаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -1
	|			ИНАЧЕ 1
    |	КОНЕЦ КАК ПостояннаяРазницаЗнак,
	
	|	ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|			0
	|	 	КОГДА УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.СтоимостьЗнакГраф_1 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -1
	|			ИНАЧЕ 1
    |	КОНЕЦ КАК СтоимостьЗнакГраф_1,
	
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|			0
	|	 	КОГДА УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.СтоимостьЗнакГраф_1 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -(УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.СтоимостьЗнакГраф_1 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)))
	|			ИНАЧЕ УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.СтоимостьЗнакГраф_1 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
    |	КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_1,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ДопРасходыГраф_1
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ДопРасходыГраф_1,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ТрудозатратыГраф_1
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ТрудозатратыГраф_1,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ПостатейныеПостоянныеГраф_1
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ПостатейныеПостоянныеГраф_1,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ПостатейныеПеременныеГраф_1
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ПостатейныеПеременныеГраф_1,
	
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|			0
	|	 	КОГДА УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВременнаяРазницаЗнак + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ВременнаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -(УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВременнаяРазницаЗнак + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ВременнаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)))
	|			ИНАЧЕ УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВременнаяРазницаЗнак + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ВременнаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
    |	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|			0
	|	 	КОГДА УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ПостояннаяРазницаЗнак	+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостояннаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -(УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ПостояннаяРазницаЗнак	+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостояннаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)))
	|			ИНАЧЕ УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ПостояннаяРазницаЗнак	+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостояннаяРазница / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))
    |	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.СтоимостьЗабалансовая
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьЗабалансовая / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК СтоимостьЗабалансовая,
	
	|	ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|			0
	|	 	КОГДА УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.СтоимостьЗнакГраф_2 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -1
	|			ИНАЧЕ 1
    |	КОНЕЦ КАК СтоимостьЗнакГраф_2,
	
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|			0
	|	 	КОГДА УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.СтоимостьЗнакГраф_2 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) < 0
	|			ТОГДА -(УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.СтоимостьЗнакГраф_2 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)))
	|			ИНАЧЕ УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.СтоимостьЗнакГраф_2 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))
    |	КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_2,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ДопРасходыГраф_2
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ДопРасходыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ДопРасходыГраф_2,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ТрудозатратыГраф_2
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ТрудозатратыГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ТрудозатратыГраф_2,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ПостатейныеПостоянныеГраф_2
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПостоянныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ПостатейныеПостоянныеГраф_2,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				УзлыКорректировки.ПостатейныеПеременныеГраф_2
	|					+ ВЫРАЗИТЬ(ВременнаяТаблицаРешений.ПостатейныеПеременныеГраф_2 / УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) 
	|		КОНЕЦ КАК ЧИСЛО(28,10))              КАК ПостатейныеПеременныеГраф_2
	|
	|ПОМЕСТИТЬ ВтТаблицаРешений
	|
	|ИЗ
	|	ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировки
	|		ПО ВременнаяТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|ГДЕ
	|	&ЗащитаОтПереполненияПоля = 0
	|	ИЛИ	ВЫБОР 
	|			КОГДА УзлыКорректировки.ВесГраф_1 <> 0 
	|				ТОГДА
	|					(УзлыКорректировки.СтоимостьГраф_1 + ВЫРАЗИТЬ(ВременнаяТаблицаРешений.СтоимостьГраф_1 / УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
	|				ИНАЧЕ
	|					ИСТИНА
	|		КОНЕЦ
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаРешений";
	
	Запрос.Текст = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	
	Пока ТекущееОтклонение > ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность
	 И СчетчикИтераций <= ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций Цикл
		
		ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтТаблицаРешений");
		РезультатЗапроса = Запрос.ВыполнитьПакет()[1];
		ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета, Истина);
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ТекущееОтклонение =	Макс(
				Выборка.ОтклонениеСтоимостьГраф_1,
				Выборка.ОтклонениеДопРасходыГраф_1,
				Выборка.ОтклонениеЗабалансовая,
				Выборка.ОтклонениеТрудозатратыГраф_1,
				Выборка.ОтклонениеПостатейныеПостоянныеГраф_1,
				Выборка.ОтклонениеПостатейныеПеременныеГраф_1,
				Выборка.ОтклонениеВременнаяРазница,
				Выборка.ОтклонениеПостояннаяРазница,
				Выборка.ОтклонениеСтоимостьГраф_2,
				Выборка.ОтклонениеДопРасходыГраф_2,
				Выборка.ОтклонениеТрудозатратыГраф_2,
				Выборка.ОтклонениеПостатейныеПостоянныеГраф_2,
				Выборка.ОтклонениеПостатейныеПеременныеГраф_2);
			
		Иначе
			
			ТекущееОтклонение = 0;
			
		КонецЕсли;
		
		// Добавим запись в протокол расчета
		СтрокаПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Отклонение на текущей итерации: %1'"),
			ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ТекущееОтклонение));
			
		ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
		
		СчетчикИтераций = СчетчикИтераций + 1;
		
	КонецЦикла;
	
	// Добавим запись в протокол расчета
	СтрокаПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполнено решение СЛУ (итерации / итоговое отклонение): %1 / %2'"),
		ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(СчетчикИтераций - 1),
		ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ТекущееОтклонение));
		
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	// Для целей отладки сохраним СЛУ
	СохранитьДанныеСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл);
	
КонецПроцедуры

#КонецОбласти


#Область РешениеСЛУПлатформой

// Служебная, этап 3.7, 3.11
// Процедура выполняет расчет себестоимости аналитики номенклатуры в узлах корректировки стоимости списания.
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешений", содержащая себестоимость
// в каждом узле корректировки.
//
Процедура РешитьСЛУПлатформой(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	// Система линейных уравнений в простейшем виде выглядит так:
	//	a11*X1 + a12*X2 = b1*Y1
	//	a21*X1 + a22*X2 = b2*Y2
	//
	// Где:
	//	X1, X2		- переменные
	//	a11, a22	- веса переменных главной диагонали
	//  a12, a21	- веса обычных переменных
	//	Y1, Y2		- свободные коэффициенты
	//	b1, b2		- веса свободных коэффициентов
	//
	// В таблице ВтУзлыКорректировки расположены "Свободные коэффициенты" и их веса, 
	// которые равны "весам переменных главной диагонали" (a11=b1, a22=b2)
	//
	// В таблице ВтПеремещенияСписания находятся "веса обычных переменных"
	//
	// В результате решения СЛУ получается таблица ВтТаблицаРешений, содержащая значения X1, X2
	//
	// Подробное описание механизма см. https://its.1c.ru/db/v8314doc#bookmark:dev:TI000002121
	//
	
	// Решаются независимые системы уравнений графа 1
	РешитьСЛУПлатформойБазовыеЗначенияГраф_1(ПараметрыРасчета);
	
	// Решаются независимые системы уравнений графа 2
	РешитьСЛУПлатформойБазовыеЗначенияГраф_2(ПараметрыРасчета);
	
	// Решаются системы уравнений постатейных показателей графа 1.
	// Зависят от результата РешитьСЛУПлатформойБазовыеЗначенияГраф_1
	РешитьСЛУПлатформойПостатейныеГраф_1(ПараметрыРасчета);
	
	// Решаются системы уравнений постатейных показателей графа 2.
	// Зависят от результата РешитьСЛУПлатформойБазовыеЗначенияГраф_2
	РешитьСЛУПлатформойПостатейныеГраф_2(ПараметрыРасчета);
	
	// Объединяет постатейные расходы двух графов в одну таблицу
	РешитьСЛУПлатформойОбъединитьПостатейные(ПараметрыРасчета);
	
	
	// Решаются системы уравнений для временных и постоянных разниц.
	// Зависят от результатов РешитьСЛУПлатформойБазовыеЗначенияГраф_1 и РешитьСЛУПлатформойПостатейные
	РешитьСЛУПлатформойРазницы(ПараметрыРасчета, РасчетСтоимостиРегл);
	
	// Объединение решений всех систем в ВтТаблицаРешений
	РешитьСЛУПлатформойОбъединитьРешения(ПараметрыРасчета, РасчетСтоимостиРегл);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		СтоимостьГраф_1, ДопРасходыГраф_1, ТрудозатратыГраф_1, СтоимостьЗабалансовая
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаБазовыхРешенийГраф_1"
//
Процедура РешитьСЛУПлатформойБазовыеЗначенияГраф_1(ПараметрыРасчета)
	
	ПояснениеДляЗамера = НСтр("ru='Решение для базовых значений (граф 1)'");
	
	ЗапросУзлы = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла																			КАК НомерУзла,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.ВесГраф_1 
	|				* УзлыКорректировки.СтоимостьЗнакГраф_1 КАК ЧИСЛО(28,10))								КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_1 * УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))			КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ТрудозатратыГраф_1 * УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))		КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая * УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))	КАК СтоимостьЗабалансовая
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	                                          
	ЗапросСвязи = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьГраф_1,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиДопРасходыГраф_1,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыГраф_1,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.РаботаДляДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансовая
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансовая
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	// источники данных
	МатрицаУзлов  = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='узлы'"));
	МатрицаСвязей = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='связи'"));
	
	ПротоколРасчетаПартийИСебестоимости.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ();
	
	РасчетСистемЛинейныхУравнений.КоличествоИтераций = ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций;
	РасчетСистемЛинейныхУравнений.ТребуемаяТочность = ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность;
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьГраф_1";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьГраф_1";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ДопРасходыГраф_1";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиДопРасходыГраф_1";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ТрудозатратыГраф_1";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиТрудозатратыГраф_1";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьЗабалансовая";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьЗабалансовая";
	
	// решение
	ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	Запрос = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ТаблицаРешений", ТаблицаРешений);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаРешений.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение1 КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение2 КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение3 КАК ЧИСЛО(28,10)) КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение4 КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансовая,
	|	1 КАК СтоимостьЗнакГраф_1
	|
	|ПОМЕСТИТЬ ТаблицаРешений
	|
	|ИЗ
	|	&ТаблицаРешений КАК ТаблицаРешений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ТрудозатратыГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансовая,
	|	1 КАК СтоимостьЗнакГраф_1
	|
	|ПОМЕСТИТЬ ВтТаблицаБазовыхРешенийГраф_1
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаРешений 
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		СтоимостьГраф_2, ДопРасходыГраф_2, ТрудозатратыГраф_2
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаБазовыхРешенийГраф_2"
//
Процедура РешитьСЛУПлатформойБазовыеЗначенияГраф_2(ПараметрыРасчета)
	
	ПояснениеДляЗамера = НСтр("ru='Решение для базовых значений (граф 2)'");
	
	ЗапросУзлы = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла																			КАК НомерУзла,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.ВесГраф_2 
	|			* УзлыКорректировки.СтоимостьЗнакГраф_2 КАК ЧИСЛО(28,10))									КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_2 * УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))			КАК ДопРасходыГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ТрудозатратыГраф_2 * УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))		КАК ТрудозатратыГраф_2
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	                                          
	ЗапросСвязи = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_2, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьГраф_2,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_2, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиДопРасходыГраф_2,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_2, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыГраф_2
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) КАК ВесДугиДопРасходыГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыГраф_2
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	// источники данных
	МатрицаУзлов  = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='узлы'"));
	МатрицаСвязей = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='связи'"));
	
	ПротоколРасчетаПартийИСебестоимости.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ();
	
	РасчетСистемЛинейныхУравнений.КоличествоИтераций = ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций;
	РасчетСистемЛинейныхУравнений.ТребуемаяТочность = ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность;
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьГраф_2";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьГраф_2";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ДопРасходыГраф_2";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиДопРасходыГраф_2";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ТрудозатратыГраф_2";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиТрудозатратыГраф_2";
	
	// решение для базовых значений
	ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	Запрос = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ТаблицаРешений", ТаблицаРешений);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаРешений.НомерУзла КАК НомерУзла,
    |	ВЫРАЗИТЬ(ТаблицаРешений.Решение1 КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение2 КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_2,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение3 КАК ЧИСЛО(28,10)) КАК ТрудозатратыГраф_2,
    |	1 КАК СтоимостьЗнакГраф_2
	|
	|ПОМЕСТИТЬ ВтТаблицаБазовыхРешенийГраф_2
	|
	|ИЗ
	|	&ТаблицаРешений КАК ТаблицаРешений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		ПостатейныеПостоянныеГраф_1, ПостатейныеПеременныеГраф_1
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешенийПостатейныеГраф_1"
//
Процедура РешитьСЛУПлатформойПостатейныеГраф_1(ПараметрыРасчета)
	
	// Для постатейных затрат необходимо изменить свободные коэффициенты на величину
	// Стоимость+Трудозатраты+ДопРасходы (СТД), которая перетекает из базовых значений
	//
	// Изначально, уравнение для постатейных затрат выглядит:
	//  A11*X1 + A12*X2 + ... + A1n*Xn = B1*Y1
	//
	// Если для связи из таблицы ВтПеремещенияСписания указан признак Постатейные... = Истина,
	// то к переменной необходимо добавить СТД, например:
	//   A11*X1 + A12*(X2+СТД)+ ... + A1n*Xn = B1*Y1
	//
	// Чтобы такая система давала правильные решения, необходимо увеличить свободный коэффициент на эту же величину:
	//   A11*X1 + A12*(X2+СТД) +  ... A1n*Xn = B1*Y1 + A12*СТД
	//
	
	ПояснениеДляЗамера = НСтр("ru='Решение для постатейных (граф 1)'");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК НомерУзла,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_1
	|
	|ПОМЕСТИТЬ ВтТаблицаРешенийПостатейныеГраф_1
	|";
	
	Запрос.Выполнить();
	
	// Для предварительного расчета показатели не считаются
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПостатейныеГраф_1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                      КАК НомерУзла,
	
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_1, ЛОЖЬ) ТОГДА
	|				(
	|				ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьГраф_1, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ТрудозатратыГраф_1, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ДопРасходыГраф_1, 0)
	|				) * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|		) 
	|	КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_1_Отклонение,
	
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_1, ЛОЖЬ) ТОГДА
	|				(
	|				ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьГраф_1, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ТрудозатратыГраф_1, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ДопРасходыГраф_1, 0)
	|				) * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|		) 
	|	КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_1_Отклонение
	
	|
	|ПОМЕСТИТЬ ОтклоненияСвободныхКоэффициентовПостатейныеГраф_1
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
	|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_1 КАК ВтТаблицаБазовыхРешенийГраф_1
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаБазовыхРешенийГраф_1.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ЗапросУзлы = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|
	|	УзлыКорректировки.ПостатейныеПостоянныеГраф_1 * УзлыКорректировки.ВесГраф_1
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовПостатейныеГраф_1.ПостатейныеПостоянныеГраф_1_Отклонение, 0) КАК ПостатейныеПостоянныеГраф_1,
	|
	|	УзлыКорректировки.ПостатейныеПеременныеГраф_1 * УзлыКорректировки.ВесГраф_1
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовПостатейныеГраф_1.ПостатейныеПеременныеГраф_1_Отклонение, 0) КАК ПостатейныеПеременныеГраф_1
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОтклоненияСвободныхКоэффициентовПостатейныеГраф_1 КАК ОтклоненияСвободныхКоэффициентовПостатейныеГраф_1
	|		ПО УзлыКорректировки.НомерУзла = ОтклоненияСвободныхКоэффициентовПостатейныеГраф_1.НомерУзла
	|";
	
	ЗапросСвязи = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиПостатейные_1
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиПостатейные_1
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	// источники данных
	МатрицаУзлов  = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='узлы'"));
	МатрицаСвязей = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='связи'"));
	
	ПротоколРасчетаПартийИСебестоимости.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ();
	
	РасчетСистемЛинейныхУравнений.КоличествоИтераций = ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций;
	РасчетСистемЛинейныхУравнений.ТребуемаяТочность = ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность;
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ПостатейныеПостоянныеГраф_1";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиПостатейные_1";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ПостатейныеПеременныеГраф_1";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиПостатейные_1";
	
	// решение для постатейных
	ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ТаблицаРешений", ТаблицаРешений);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаРешений.НомерУзла,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение1 КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение2 КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_1
	|	
	|ПОМЕСТИТЬ
	|	ТаблицаРешений
	|	
	|ИЗ
	|	&ТаблицаРешений КАК ТаблицаРешений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ПостатейныеПостоянныеГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ПостатейныеПеременныеГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_1
	|
	|ПОМЕСТИТЬ ВтТаблицаРешенийПостатейныеГраф_1
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаРешений 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтклоненияСвободныхКоэффициентовПостатейныеГраф_1
	|";	
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		ПостатейныеПостоянныеГраф_2, ПостатейныеПеременныеГраф_2
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешенийПостатейныеГраф_2"
//
Процедура РешитьСЛУПлатформойПостатейныеГраф_2(ПараметрыРасчета)
	
	// См. описание в РешитьСЛУПлатформойПостатейныеГраф_1
	
	ПояснениеДляЗамера = НСтр("ru='Решение для постатейных (граф 2)'");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК НомерУзла,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_2
	|
	|ПОМЕСТИТЬ ВтТаблицаРешенийПостатейныеГраф_2
	|";
	
	Запрос.Выполнить();
	
	// Для предварительного расчета показатели не считаются
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
		
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПостатейныеГраф_2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                      КАК НомерУзла,
	
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПостоянныеГраф_2, ЛОЖЬ) ТОГДА
	|				(
	|				ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.СтоимостьГраф_2, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.ТрудозатратыГраф_2, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.ДопРасходыГраф_2, 0)
	|				) * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|		) 
	|	КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_2_Отклонение,
	
	|	ВЫРАЗИТЬ(СУММА(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПостатейныеПеременныеГраф_2, ЛОЖЬ) ТОГДА
	|				(
	|				ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.СтоимостьГраф_2, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.ТрудозатратыГраф_2, 0)
	|				+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.ДопРасходыГраф_2, 0)
	|				) * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_2, 0)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|		) 
	|	КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_2_Отклонение
	
	|
	|ПОМЕСТИТЬ ОтклоненияСвободныхКоэффициентовПостатейныеГраф_2
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
	|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_2 КАК ВтТаблицаБазовыхРешенийГраф_2
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаБазовыхРешенийГраф_2.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ЗапросУзлы = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|
	|	УзлыКорректировки.ПостатейныеПостоянныеГраф_2 * УзлыКорректировки.ВесГраф_2
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовПостатейныеГраф_2.ПостатейныеПостоянныеГраф_2_Отклонение, 0) КАК ПостатейныеПостоянныеГраф_2,
	|
	|	УзлыКорректировки.ПостатейныеПеременныеГраф_2 * УзлыКорректировки.ВесГраф_2
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовПостатейныеГраф_2.ПостатейныеПеременныеГраф_2_Отклонение, 0) КАК ПостатейныеПеременныеГраф_2
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОтклоненияСвободныхКоэффициентовПостатейныеГраф_2 КАК ОтклоненияСвободныхКоэффициентовПостатейныеГраф_2
	|		ПО УзлыКорректировки.НомерУзла = ОтклоненияСвободныхКоэффициентовПостатейныеГраф_2.НомерУзла
	|";
	
	ЗапросСвязи = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_2, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиПостатейные_2
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) КАК ВесДугиПостатейные_2
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	// источники данных
	МатрицаУзлов  = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='узлы'"));
	МатрицаСвязей = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='связи'"));
	
	ПротоколРасчетаПартийИСебестоимости.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ();
	
	РасчетСистемЛинейныхУравнений.КоличествоИтераций = ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций;
	РасчетСистемЛинейныхУравнений.ТребуемаяТочность = ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность;
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ПостатейныеПостоянныеГраф_2";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиПостатейные_2";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ПостатейныеПеременныеГраф_2";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиПостатейные_2";
	
	// решение для постатейных
	ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ТаблицаРешений", ТаблицаРешений);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаРешений.НомерУзла,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение1 КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение2 КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_2
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешенийПостатейныеГраф_2
	|	
	|ИЗ
	|	&ТаблицаРешений КАК ТаблицаРешений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтклоненияСвободныхКоэффициентовПостатейныеГраф_2
	|";	
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Объединяет постатейные расходы двух графов в одну таблицу
Процедура РешитьСЛУПлатформойОбъединитьПостатейные(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	// Единая таблица постатейных расходов
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийПостатейныеГраф_1.ПостатейныеПостоянныеГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийПостатейныеГраф_1.ПостатейныеПеременныеГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийПостатейныеГраф_2.ПостатейныеПостоянныеГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийПостатейныеГраф_2.ПостатейныеПеременныеГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_2
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешенийПостатейные
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПостатейныеГраф_1 КАК ВтТаблицаРешенийПостатейныеГраф_1
	|		ПО ВтТаблицаРешенийПостатейныеГраф_1.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПостатейныеГраф_2 КАК ВтТаблицаРешенийПостатейныеГраф_2
	|		ПО ВтТаблицаРешенийПостатейныеГраф_2.НомерУзла = УзлыКорректировки.НомерУзла
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПостатейныеГраф_1
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПостатейныеГраф_2
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры


// Выполняет шаг расчета систем уравнений для показателей:
//		ВременнаяРазница, ПостояннаяРазница
// Результатом работы данной процедуры будут временные таблицы "ВтТаблицаРешенийВР" И "ВтТаблицаРешенийПР"
//
Процедура РешитьСЛУПлатформойРазницыШаг(ПараметрыРасчета, РасчетСтоимостиРегл, НомерШага)
	
	ШаблонПояснениеДляЗамера = НСтр("ru='Решение для %1 (шаг %2)'");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	// Необходимо посчитать отклонения свободных коэффициентов. Описание см. в РешитьСЛУПлатформойБазовыеЗначенияГраф_1
	
	// Сначала считается постоянная разница, а затем временная
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                      КАК НомерУзла,
	
	|	ВЫРАЗИТЬ(СУММА
	|		(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(НЕ ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ) ТОГДА
	|					%1 - ЕСТЬNULL(ВтТаблицаРешенийВР.ВременнаяРазница, 0)
	|			ИНАЧЕ 
	|				0
	|		КОНЕЦ * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		) 
	|	КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница_Отклонение
	
	|
	|ПОМЕСТИТЬ ОтклоненияСвободныхКоэффициентовПР
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
	|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_1 КАК ВтТаблицаБазовыхРешенийГраф_1
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаБазовыхРешенийГраф_1.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПостатейные КАК ВтТаблицаРешенийПостатейные
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешенийПостатейные.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийВР КАК ВтТаблицаРешенийВР
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешенийВР.НомерУзла
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	
	ТекстБУ = "
	|					ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьГраф_1, 0) 
	|					+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ДопРасходыГраф_1, 0)
	|					+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ТрудозатратыГраф_1, 0)
	|					+ ЕСТЬNULL(ВтТаблицаРешенийПостатейные.ПостатейныеПостоянныеГраф_1, 0)
	|					+ ЕСТЬNULL(ВтТаблицаРешенийПостатейные.ПостатейныеПеременныеГраф_1, 0)
	|";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, ТекстБУ);
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ЗапросУзлы = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|
	|	УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ВесГраф_1 * УзлыКорректировки.ПостояннаяРазницаЗнак
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовПР.ПостояннаяРазница_Отклонение, 0) КАК ПостояннаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОтклоненияСвободныхКоэффициентовПР КАК ОтклоненияСвободныхКоэффициентовПР
	|		ПО УзлыКорректировки.НомерУзла = ОтклоненияСвободныхКоэффициентовПР.НомерУзла
	|";
	
	ЗапросСвязи = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(НЕ ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиПостояннаяРазница
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиПостояннаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	ПояснениеДляЗамера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПояснениеДляЗамера, НСтр("ru='ПР'"), НомерШага);
	
	// источники данных
	МатрицаУзлов  = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='узлы'"));
	МатрицаСвязей = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='связи'"));
	
	ПротоколРасчетаПартийИСебестоимости.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ();
	
	РасчетСистемЛинейныхУравнений.КоличествоИтераций = ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций;
	РасчетСистемЛинейныхУравнений.ТребуемаяТочность = ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность;
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ПостояннаяРазница";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиПостояннаяРазница";
	
	// решение
	ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("ТаблицаРешений", ТаблицаРешений);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаРешений.НомерУзла,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение1 КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница
	|	
	|ПОМЕСТИТЬ
	|	ТаблицаРешений
	|	
	|ИЗ
	|	&ТаблицаРешений КАК ТаблицаРешений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ПостояннаяРазница, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница
	|
	|ПОМЕСТИТЬ ВтТаблицаРешенийПР
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаРешений 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтклоненияСвободныхКоэффициентовПР
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	// Временная разница
	
	Запрос.Текст = " 
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                      КАК НомерУзла,
	|
	|	ВЫРАЗИТЬ(СУММА
	|       (
	|		(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) И НЕ ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) ТОГДА	
	|				 -1 * (%1) + ЕСТЬNULL(ВтТаблицаРешенийПР.ПостояннаяРазница, 0)
	|			ИНАЧЕ
	|				0 
	|		КОНЕЦ +
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ИСТИНА) ТОГДА 
	|				%1 - ЕСТЬNULL(ВтТаблицаРешенийПР.ПостояннаяРазница, 0)
	|			ИНАЧЕ 
	|				0
	|		КОНЕЦ) * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		)
	|	КАК ЧИСЛО(28,10)) КАК ВременнаяРазница_Отклонение
	|
	|
	|ПОМЕСТИТЬ ОтклоненияСвободныхКоэффициентовВР
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
	|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_1 КАК ВтТаблицаБазовыхРешенийГраф_1
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаБазовыхРешенийГраф_1.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПостатейные КАК ВтТаблицаРешенийПостатейные
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешенийПостатейные.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПР КАК ВтТаблицаРешенийПР
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешенийПР.НомерУзла
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|
	|";	
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, ТекстБУ);
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|
	|	УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВесГраф_1 * УзлыКорректировки.ВременнаяРазницаЗнак
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовВР.ВременнаяРазница_Отклонение, 0) КАК ВременнаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОтклоненияСвободныхКоэффициентовВР КАК ОтклоненияСвободныхКоэффициентовВР
	|		ПО УзлыКорректировки.НомерУзла = ОтклоненияСвободныхКоэффициентовВР.НомерУзла
	|";
	
	ЗапросСвязи = Новый Запрос();
	ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) И НЕ ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) ТОГДА	
	|					ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|			ИНАЧЕ 0 
	|		КОНЕЦ
	|       + ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ИСТИНА) ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		КОНЕЦ
	|			
	|	КАК ЧИСЛО(28,10)) КАК ВесДугиВременнаяРазница
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиВременнаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	ПояснениеДляЗамера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПояснениеДляЗамера, НСтр("ru='ВР'"), НомерШага);
	
	// источники данных
	МатрицаУзлов  = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='узлы'"));
	МатрицаСвязей = УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru='связи'"));
	
	ПротоколРасчетаПартийИСебестоимости.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ();
	
	РасчетСистемЛинейныхУравнений.КоличествоИтераций = ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций;
	РасчетСистемЛинейныхУравнений.ТребуемаяТочность = ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность;
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ВременнаяРазница";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиВременнаяРазница";
	
	// решение
	ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("ТаблицаРешений", ТаблицаРешений);
	
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ВтТаблицаРешенийВР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРешений.НомерУзла,
	|	ВЫРАЗИТЬ(ТаблицаРешений.Решение1 КАК ЧИСЛО(28,10)) КАК ВременнаяРазница,
	|	1 КАК ВременнаяРазницаЗнак
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешенийВР
	|	
	|ИЗ
	|	&ТаблицаРешений КАК ТаблицаРешений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтклоненияСвободныхКоэффициентовВР";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		ВременнаяРазница, ПостояннаяРазница
// Результатом работы данной процедуры будут временные таблицы "ВтТаблицаРешенийВР" И "ВтТаблицаРешенийПР"
//
Процедура РешитьСЛУПлатформойРазницы(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК НомерУзла,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(1)) КАК ПостояннаяРазницаЗнак
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешенийПР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК НомерУзла,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(1)) КАК ВременнаяРазницаЗнак
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешенийВР
	|";
	
	Запрос.Выполнить();
		
	// Показатели имеют смысл только для регламентированного учета в окончательном расчете
	Если НЕ РасчетСтоимостиРегл ИЛИ ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
	
	// Выполняется два шага расчета разниц, т.к. для одних случаев надо сначала посчитать ПР, а от нее ВР
	// для других - наоборот
	РешитьСЛУПлатформойРазницыШаг(ПараметрыРасчета, РасчетСтоимостиРегл, 1);
	РешитьСЛУПлатформойРазницыШаг(ПараметрыРасчета, РасчетСтоимостиРегл, 2)
	
КонецПроцедуры

// Объединяет все этапы решений в таблицу ВтТаблицаРешений
//
Процедура РешитьСЛУПлатформойОбъединитьРешения(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	ПояснениеДляЗамера = НСтр("ru='Объединить решения СЛАУ'");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|
	|УНИЧТОЖИТЬ ВтТаблицаРешений
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьГраф_1, 0) КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ТрудозатратыГраф_1, 0) КАК ЧИСЛО(28,10)) КАК ТрудозатратыГраф_1,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_1,
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК СтоимостьЗнакГраф_1,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансовая,
	
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.СтоимостьГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.ТрудозатратыГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ТрудозатратыГраф_2,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.ДопРасходыГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_2,
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ  КАК СтоимостьЗнакГраф_2,
	
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешенийПостатейные.ПостатейныеПостоянныеГраф_1, 0) КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_1,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешенийПостатейные.ПостатейныеПеременныеГраф_1, 0) КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийПостатейные.ПостатейныеПостоянныеГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеГраф_2,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийПостатейные.ПостатейныеПеременныеГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеГраф_2,
	
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК ВременнаяРазницаЗнак,
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК ПостояннаяРазницаЗнак,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешенийПР.ПостояннаяРазница, 0) КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийВР.ВременнаяРазница, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВременнаяРазница
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешений
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_1 КАК ВтТаблицаБазовыхРешенийГраф_1
	|		ПО ВтТаблицаБазовыхРешенийГраф_1.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_2 КАК ВтТаблицаБазовыхРешенийГраф_2
	|		ПО ВтТаблицаБазовыхРешенийГраф_2.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПостатейные КАК ВтТаблицаРешенийПостатейные
	|		ПО ВтТаблицаРешенийПостатейные.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПР КАК ВтТаблицаРешенийПР
	|		ПО ВтТаблицаРешенийПР.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийВР КАК ВтТаблицаРешенийВР
	|		ПО ВтТаблицаРешенийВР.НомерУзла = УзлыКорректировки.НомерУзла
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаБазовыхРешенийГраф_1
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаБазовыхРешенийГраф_2
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПостатейные
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПР
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийВР
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Для совместимости с платформой ниже 8.3.14
//
Функция ПолучитьКомпонентуДляРешенияСЛУ()
	Возврат ОбщегоНазначения.ВычислитьВБезопасномРежиме("Новый РасчетСистемЛинейныхУравнений");
КонецФункции

#КонецОбласти

#Область Отладка

// Сохраняет временные таблицы, используемые для решения СЛУ, в файлы на диск.
//
Процедура СохранитьДанныеСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	ИмяКаталога = СокрЛП(ПараметрыРасчета.ВыгрузкаДанныхРасчета.КаталогДляСохраненияДанныхСЛУ);
	
	Если НЕ ЗначениеЗаполнено(ИмяКаталога) Тогда
		Возврат; // выгрузка СЛУ не требуется
	КонецЕсли;
	
	Попытка
		ТекстОшибки = "";
		СоздатьКаталог(ИмяКаталога);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ИмяКаталога = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяКаталога);
	Каталог     = Новый Файл(ИмяКаталога);
	
	Если НЕ Каталог.Существует() ИЛИ НЕ Каталог.ЭтоКаталог() Тогда
		
		ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не найден каталог для сохранения данных СЛУ: ""%1""
				|%2'"),
			ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ИмяКаталога),
			ТекстОшибки);
		
		ПротоколРасчетаПартийИСебестоимости.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
			ТекстДляПротокола);
		
		Возврат; // каталог для выгрузки не найден
		
	КонецЕсли;
	
	ФорматВыгрузки = СокрЛП(НРег(ПараметрыРасчета.ВыгрузкаДанныхРасчета.ФорматСохраненияДанныхСЛУ));
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если ФорматВыгрузки = "mxl" Тогда
		
		// ВтУзлыКорректировки и ВтТаблицаРешений выгружаем в один файл "...Узлы".
		//	- одноименным колонкам этих таблиц присвоим префиксы "Узел" и "Решение" соответственно
		// ВтПеремещенияСписания выгружаем в файл "...Дуги".
		
		ШаблонИмениФайла =
			Формат(ТекущаяДатаСеанса() - Дата(1,1,1), "ЧЦ=12; ЧВН=; ЧГ=")      // дата-время выгрузки
			+ "_" + ?(ПараметрыРасчета.ПредварительныйРасчет, "Предв", "Факт") // какой вид расчета
			+ "_" + ?(РасчетСтоимостиРегл, "Регл", "Упр")					   // какую себестоимость рассчитываем
			+ "_%1.mxl";													   // какую временную таблицу выгружаем
		
		// Получим данные из временных таблиц
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УзлыКорректировки.НомерУзла					 	КАК НомерУзла,
		|	УзлыКорректировки.Организация                	КАК Организация,
		|	УзлыКорректировки.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
		|	УзлыКорректировки.РазделУчета                	КАК РазделУчета,
		|	УзлыКорректировки.ВидЗапасов                 	КАК ВидЗапасов,
		|	УзлыКорректировки.Партия					 	КАК Партия,
		|	УзлыКорректировки.АналитикаУчетаПартий		 	КАК АналитикаУчетаПартий,
		|	УзлыКорректировки.АналитикаФинансовогоУчета	 	КАК АналитикаФинансовогоУчета,
		|	УзлыКорректировки.ВидДеятельностиНДС		 	КАК ВидДеятельностиНДС,
		|
		|	УзлыКорректировки.ВесГраф_1          		 	КАК ВесГраф_1,
		|	УзлыКорректировки.СтоимостьГраф_1
		|		* УзлыКорректировки.СтоимостьЗнакГраф_1 	КАК УзелСтоимостьГраф_1,
		|	УзлыКорректировки.ДопРасходыГраф_1 				КАК УзелДопРасходыГраф_1,
		|	УзлыКорректировки.ТрудозатратыГраф_1			КАК ТрудозатратыГраф_1,
		|	УзлыКорректировки.ПостатейныеПостоянныеГраф_1 	КАК УзелПостатейныеПостоянныеГраф_1,
		|	УзлыКорректировки.ПостатейныеПеременныеГраф_1 	КАК УзелПостатейныеПеременныеГраф_1,
		|	УзлыКорректировки.ПостояннаяРазница
		|		* УзлыКорректировки.ПостояннаяРазницаЗнак 	КАК УзелПостояннаяРазница,
		|	УзлыКорректировки.ВременнаяРазница
		|		* УзлыКорректировки.ВременнаяРазницаЗнак 	КАК УзелВременнаяРазница,
		|	УзлыКорректировки.СтоимостьЗабалансовая 		КАК УзелСтоимостьЗабалансовая,
		
		|	УзлыКорректировки.ВесГраф_2          		 	КАК ВесГраф_2,
		|	УзлыКорректировки.СтоимостьГраф_2
		|		* УзлыКорректировки.СтоимостьЗнакГраф_2 	КАК УзелСтоимостьГраф_2,
		|	УзлыКорректировки.ДопРасходыГраф_2 				КАК УзелДопРасходыГраф_2,
		|	УзлыКорректировки.ТрудозатратыГраф_2 			КАК ТрудозатратыГраф_2,
		|	УзлыКорректировки.ПостатейныеПостоянныеГраф_2 	КАК УзелПостатейныеПостоянныеГраф_2,
		|	УзлыКорректировки.ПостатейныеПеременныеГраф_2 	КАК УзелПостатейныеПеременныеГраф_2,
		|
		|	ТаблицаРешений.СтоимостьГраф_1
		|		* ТаблицаРешений.СтоимостьЗнакГраф_1 		КАК РешениеСтоимостьГраф_1,
		|	ТаблицаРешений.ДопРасходыГраф_1 				КАК РешениеДопРасходыГраф_1,
		|	ТаблицаРешений.ТрудозатратыГраф_1 				КАК РешениеТрудозатратыГраф_1,
		|	ТаблицаРешений.ПостатейныеПостоянныеГраф_1 		КАК РешениеПостатейныеПостоянныеГраф_1,
		|	ТаблицаРешений.ПостатейныеПеременныеГраф_1 		КАК РешениеПостатейныеПеременныеГраф_1,
		|	ТаблицаРешений.ПостояннаяРазница
		|		* ТаблицаРешений.ПостояннаяРазницаЗнак 		КАК РешениеПостояннаяРазница,
		|	ТаблицаРешений.ВременнаяРазница
		|		* ТаблицаРешений.ВременнаяРазницаЗнак 		КАК РешениеВременнаяРазница,
		|	ТаблицаРешений.СтоимостьЗабалансовая 			КАК РешениеСтоимостьЗабалансовая,
		
		|	ТаблицаРешений.СтоимостьГраф_2
		|		* ТаблицаРешений.СтоимостьЗнакГраф_2 		КАК РешениеСтоимостьГраф_2,
		|	ТаблицаРешений.ДопРасходыГраф_2 				КАК РешениеДопРасходыГраф_2,
		|	ТаблицаРешений.ТрудозатратыГраф_2 				КАК РешениеТрудозатратыГраф_2,
		|	ТаблицаРешений.ПостатейныеПостоянныеГраф_2 		КАК РешениеПостатейныеПостоянныеГраф_2,
		|	ТаблицаРешений.ПостатейныеПеременныеГраф_2 		КАК РешениеПостатейныеПеременныеГраф_2
		|ИЗ
		|	ВТУзлыКорректировки КАК УзлыКорректировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаРешений КАК ТаблицаРешений
		|		ПО УзлыКорректировки.НомерУзла = ТаблицаРешений.НомерУзла
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерУзла
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ПеремещенияСписания.НомерУзлаИсточник 		КАК НомерУзлаИсточник,
		|	ПеремещенияСписания.НомерУзлаПриемник 		КАК НомерУзлаПриемник,
		|	ПеремещенияСписания.ВесДугиГраф_1 			КАК ВесДугиГраф_1,
		|	ПеремещенияСписания.ВесДугиГраф_2 			КАК ВесДугиГраф_2,
		|	ПеремещенияСписания.ПередачаВЭксплуатацию	КАК ПередачаВЭксплуатацию,
		|	ПеремещенияСписания.ПринимаемыеВНУ			КАК ПринимаемыеВНУ,
		|	ПеремещенияСписания.КосвенныеЗатратыНУ		КАК КосвенныеЗатратыНУ
		|ИЗ
		|	ВТПеремещенияСписания КАК ПеремещенияСписания
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерУзлаПриемник,
		|	НомерУзлаИсточник
		|";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		// Сохраним первый файл
		ТекстДляПротокола = ОбщегоНазначенияУТ.СохранитьТаблицуЗначенийВФайл(
			РезультатЗапроса[0].Выгрузить(),
			ИмяКаталога + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла, "Узлы"));
		
		Если ЗначениеЗаполнено(ТекстДляПротокола) Тогда  // ошибка записи файла
			
			ПротоколРасчетаПартийИСебестоимости.ЗафиксироватьОшибкуРасчета(
				ПараметрыРасчета,
				Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
				ТекстДляПротокола);
			
		КонецЕсли;
		
		// Сохраним второй файл
		ТекстДляПротокола = ОбщегоНазначенияУТ.СохранитьТаблицуЗначенийВФайл(
			РезультатЗапроса[1].Выгрузить(),
			ИмяКаталога + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла, "Дуги"));
		
		Если ЗначениеЗаполнено(ТекстДляПротокола) Тогда
			
			ПротоколРасчетаПартийИСебестоимости.ЗафиксироватьОшибкуРасчета(
				ПараметрыРасчета,
				Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
				ТекстДляПротокола);
			
		КонецЕсли;
		
	ИначеЕсли ФорматВыгрузки = "csv" Тогда
		// ВтУзлыКорректировки - свободные члены
		// ВтПеремещенияСписания - коэффициенты; НомерУзлаИсточник - № уравнения, НомерУзлаПриемник - № элемента
		//
		// СЛУ из n неизвестных:
		// А(1,1)*Х1 + А(1,2)*Х2 + ... А(1,n)*Xn = B1
		// А(2,1)*Х1 + А(2,2)*Х2 + ... А(2,n)*Xn = B2
		// ...
		// А(n,1)*Х1 + А(n,2)*Х2 + ... А(n,n)*Xn = Bn
		//
		// Формат строки файла CSV:
		// <Свободный коэффициент В>[,(<Номер неизвестного X>, <Коэффициент А>)]
		// Для каждого уравнения обязательно есть строка, при этом порядковый номер строки = номеру уравнения
		
		ФайлСЛУ = Новый ТекстовыйДокумент;
		
		ШаблонИмениФайла =
			Формат(ТекущаяДатаСеанса() - Дата(1,1,1), "ЧЦ=12; ЧВН=; ЧГ=")      // дата-время выгрузки
			+ "_" + ?(ПараметрыРасчета.ПредварительныйРасчет, "Предв", "Факт") // какой вид расчета
			+ "_" + ?(РасчетСтоимостиРегл, "Регл", "Упр")					   // какую себестоимость рассчитываем
			+ "_СЛУ.csv";													   // какую временную таблицу выгружаем
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НомераУравнения.НомерУзла КАК НомерУравнения,
		|	ЕСТЬNULL(Коэффициенты.НомерУзлаПриемник, 0) КАК НомерНеизвестного,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.ВесДугиГраф_1, 0) КАК ЧИСЛО(28,10)) КАК КоэффициентНеизвестного,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА НомераУравнения.ВесГраф_1 = 0
		|				ТОГДА 0
		|			КОГДА ЕСТЬNULL(Коэффициенты.ПродукцияДавальца, ЛОЖЬ)
		|				ТОГДА 0
		|			КОГДА ЕСТЬNULL(Коэффициенты.ПередачаВЭксплуатацию, ЛОЖЬ)
		|				ТОГДА 0
		|			КОГДА ЕСТЬNULL(Коэффициенты.ПостатейныеПостоянныеГраф_1, ЛОЖЬ)
		|				ТОГДА 0
		|			КОГДА ЕСТЬNULL(Коэффициенты.ПостатейныеПеременныеГраф_1, ЛОЖЬ)
		|				ТОГДА 0
		|			ИНАЧЕ НомераУравнения.СтоимостьГраф_1 / НомераУравнения.ВесГраф_1
		|		КОНЕЦ КАК ЧИСЛО(28,10)) КАК СвободныйКоэффициент
		|ИЗ
		|	ВтУзлыКорректировки КАК НомераУравнения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК Коэффициенты
		|		ПО НомераУравнения.НомерУзла = Коэффициенты.НомерУзлаИсточник
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерУравнения,
		|	НомерНеизвестного
		|ИТОГИ
		|	МИНИМУМ(СвободныйКоэффициент)
		|ПО
		|	НомерУравнения";
		
		Запрос.Текст = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
		
		ВыборкаУравнений = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУравнений.Следующий() Цикл
			
			СтрокаФайла = СокрЛП(Формат(ВыборкаУравнений.СвободныйКоэффициент, "ЧРД=.; ЧН=0; ЧГ=0"));
			
			ВыборкаНеизвестных = ВыборкаУравнений.Выбрать();
			
			Пока ВыборкаНеизвестных.Следующий() Цикл
				
				Если ВыборкаНеизвестных.НомерНеизвестного = NULL Тогда
					Прервать; // в этом уравнении нет ненулевых коэффициентов
				КонецЕсли;
				
				// <Свободный коэффициент В>[,(<Номер неизвестного X>, <Коэффициент А>)]
				СтрокаФайла = СтрокаФайла
					+ ",("
					+ СокрЛП(Формат(ВыборкаНеизвестных.НомерНеизвестного, "ЧДЦ=; ЧН=0; ЧГ=0"))
					+ ","
					+ СокрЛП(Формат(ВыборкаНеизвестных.КоэффициентНеизвестного, "ЧРД=.; ЧН=0; ЧГ=0"))
					+ ")";
				
			КонецЦикла;
			
			ФайлСЛУ.ДобавитьСтроку(СтрокаФайла);
			
		КонецЦикла;
		
		Попытка
			ФайлСЛУ.Записать(ИмяКаталога + ШаблонИмениФайла);
		Исключение
			
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось записать файл ""%1""
					|%2'"),
				ИмяКаталога + ШаблонИмениФайла,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ПротоколРасчетаПартийИСебестоимости.ЗафиксироватьОшибкуРасчета(
				ПараметрыРасчета,
				Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
				ТекстДляПротокола);
			
		КонецПопытки;
		
	Иначе
		
		ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Неверный формат выгрузки СЛУ: %1'"),
			ФорматВыгрузки);
		
		ПротоколРасчетаПартийИСебестоимости.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
			ТекстДляПротокола);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область УниверсальныеПроцедурыРаботыСЗапросами

// Устанавливает общие параметры запроса из параметров расчета.
// Следует использовать для идентичности имен и значений параметров во всех запросах.
//
Процедура ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета, ИспользоватьОбщийМенеджерВТ = Истина)
	
	// Общие параметры.
	УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьСвойстваЗапроса(
		Запрос,
		ПараметрыРасчета,
		ИспользоватьОбщийМенеджерВТ);
		
	СредняяЗаМесяц = (ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.СредняяЗаМесяц);
	
	// Параметры, относящиеся только к расчету себестоимости.
	Запрос.УстановитьПараметр("ПредварительныйРасчет", 	  	   		  	ПараметрыРасчета.ПредварительныйРасчет);
	Запрос.УстановитьПараметр("УчитыватьКорректировкиСтоимости", 	  	ПараметрыРасчета.УчитыватьКорректировкиСтоимости);
	Запрос.УстановитьПараметр("СредняяЗаМесяц", 						СредняяЗаМесяц);
	
	Запрос.УстановитьПараметр("ЗначениеПогрешностиСебестоимостьРегл", 	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьРегл);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиСебестоимостьУпр",  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьУпр);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиРасходыРегл",  	  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыРегл);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиРасходыУпр",  	  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыУпр);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиКоличество", 		  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиКоличество);
	
	Запрос.УстановитьПараметр("ЗащитаОтПереполненияПоля", 	   		  	Pow(10, ПараметрыРасчета.РешениеСЛУ.ЗащитаОтПереполненияПоля) - 1);
	
	// Отборы по хозяйственным операциям.
	Запрос.УстановитьПараметр("МассивОперацийРеализации",				МассивОперацийРеализации());
	Запрос.УстановитьПараметр("МассивОперацийВозвратыПрошлыхПериодов",  МассивОперацийВозвратыПрошлыхПериодов());
	Запрос.УстановитьПараметр("МассивОперацийПередачи",                 МассивОперацийПередачиТоваров());
	Запрос.УстановитьПараметр("МассивОперацийПоступление",              МассивОперацийВнешнееПоступление());
	Запрос.УстановитьПараметр("МассивОперацийПоступлениеВнешнее",       МассивОперацийДляОценкиОстаткаТоваровПоФИФО());
	
КонецПроцедуры

#Область ОтборыПоХозяйственнымОперациям

Функция МассивОперацийРеализации()
	
	МассивОпераций = Новый Массив;
	
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияВРозницу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.СторноРеализации);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомиссионера);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями);;
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДавальцу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВыкупТоваровХранителем);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция МассивОперацийПередачиТоваров()

	Массив = Новый Массив;
	
	Массив.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями);
	
	Возврат Массив;
	
КонецФункции

Функция МассивОперацийВозвратыПрошлыхПериодов()

	МассивОпераций = Новый Массив;
	
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция МассивОперацийВнешнееПоступление()

	// Формируется список всех хоз. операций, которые являются внешним поступлением (известна их стоимость).
	ХозОперации = Новый Массив;
	
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеТоваров);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоВозврату);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет); // сторнирование реализации регл. учета по управленческой организации
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаВПроизводство);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
	
	// Таможенная декларация (старые и новые хоз. операции).
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыБезПартии);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыСПартией);
	
	// Возврат прошлого периода используется только для операций расчета по среднему,
	// т.к. оценивать остатки для ФИФО не корректно.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.КорректировкаПриобретенияПрошлогоПериода);
	
	// Операции по комиссионным и давальческим товарам.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию);
	
	// Операции по товарам на ответственном хранении.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров);
	
	Возврат ХозОперации;

КонецФункции

Функция МассивОперацийДляОценкиОстаткаТоваровПоФИФО()

	ХозОперации = Новый Массив;
	
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеТоваров);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоВозврату);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет); // сторнирование реализации регл. учета по управленческой организации
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаВПроизводство);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
	
	// Таможенная декларация (старые и новые хоз. операции).
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыБезПартии);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыСПартией);
	
	// Операции по комиссионным и давальческим товарам.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию);
	
	// Операции по товарам на ответственном хранении.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров);
	
	Возврат ХозОперации;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область УниверсальныеПроцедурыРаботыСДвижениями

// Добавляет новую строку в таблицу движений указанного регистра и заполняет служебные поля.
// Сделана экспортной для вызова из модуля универсальных механизмов расчетов.
//
Функция ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения,
			КопируемыеПоля = Неопределено, СлужебныеПоля = Неопределено) Экспорт
			
	Если ПараметрыРасчета.Движения.Свойство(ТаблицаПриемник) Тогда
		ОписаниеПриемника = ПараметрыРасчета.Движения[ТаблицаПриемник];
	Иначе
		ОписаниеПриемника = ПараметрыРасчета.ВспомогательныеВременныеТаблицы[ТаблицаПриемник];
	КонецЕсли;
	
	// Добавим запись универсальной процедурой, а потом дозаполним поля, относящиеся только к расчету себестоимости
	Запись = УниверсальныеМеханизмыПартийИСебестоимости.ДобавитьЗаписьВТаблицуДвижений(
		ПараметрыРасчета,
		ОписаниеПриемника,
		ДанныеДвижения,
		КопируемыеПоля);
	
	// Заполним поле Регистратор из обязательного свойства ДокументДвижения источника ДанныеДвижения.
	Запись.Регистратор = ДанныеДвижения.ДокументДвижения;
	
	// Заполним пустой регистратор соответствующим документом расчета себестоимости
	Если ОписаниеПриемника.ЭтоОписаниеРегистра
	 И ПараметрыРасчета.Отладка.ИсправлятьПустойРегистратор И НЕ ЗначениеЗаполнено(Запись.Регистратор) Тогда
		
		Если ОписаниеПриемника.ЕстьОрганизация Тогда
			Запись.Регистратор = ПараметрыРасчета.ДокументыРасчетаПоОрганизациям.Получить(ДанныеДвижения.Организация);
		ИначеЕсли ОписаниеПриемника.ЕстьАналитикаПартнеров Тогда
			Запись.Регистратор = ПараметрыРасчета.ДокументыРасчетаПоОрганизациям.Получить(
				ПараметрыРасчета.ОрганизацияПоАналитикеПартнеров.Получить(ДанныеДвижения.АналитикаУчетаПоПартнерам));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.Регистратор) Тогда
			ТекстОшибки = НСтр("ru='Документ %1 установлен регистратором движения регистра %2 вместо %3,
				|который не может иметь движений по данному регистру.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				Запись.Регистратор,
				ТаблицаПриемник,
				ДанныеДвижения.ДокументДвижения);
			ЗаписьЖурналаРегистрации(
				УниверсальныеМеханизмыПартийИСебестоимости.ИмяСобытияОшибкиДляЖурналаРегистрации(ПараметрыРасчета),
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	// Если регистратор не заполнен, то запомним информацию об ошибке
	Если ОписаниеПриемника.ЭтоОписаниеРегистра И НЕ ЗначениеЗаполнено(Запись.Регистратор) Тогда
		
		Если НЕ ЗначениеЗаполнено(ДанныеДвижения.ДокументДвижения) Тогда
			// Ошибка в запросах - не заполнено обязательное поле ДокументДвижения.
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнено свойство ДокументДвижения для движения по регистру ""%1""'"),
				ТаблицаПриемник);
		Иначе
			// Ошибка в метаданных - документ не является регистратором для данного регистра.
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ ""%1"" не может иметь движений по регистру ""%2""'"),
				СокрЛП(ДанныеДвижения.ДокументДвижения),
				ТаблицаПриемник);
		КонецЕсли;
		
		ПротоколРасчетаПартийИСебестоимости.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаФормированияДвиженийПоРегистрам,
			ТекстДляПротокола);
		
		Если ОписаниеПриемника.ЕстьОрганизация Тогда
			ОрганизацияСПроблемой = ДанныеДвижения.Организация;
		ИначеЕсли ОписаниеПриемника.ЕстьАналитикаПартнеров Тогда
			ОрганизацияСПроблемой = ПараметрыРасчета.ОрганизацияПоАналитикеПартнеров.Получить(ДанныеДвижения.АналитикаУчетаПоПартнерам);
		Иначе
			ОрганизацияСПроблемой = Неопределено;
		КонецЕсли;
			
		УниверсальныеМеханизмыПартийИСебестоимости.ЗарегистрироватьПроблемуВыполненияРасчета(
			ПараметрыРасчета,
			ОрганизацияСПроблемой,
			НСтр("ru='При формировании движений диагностированы ошибки'"),
			ТекстДляПротокола,
			ДанныеДвижения.ДокументДвижения);
		
		Для Каждого КлючИЗначение Из ПараметрыРасчета.ДокументыРасчетаПоОрганизациям Цикл
			// Заполним регистратор произвольным "первым" документом расчета себестоимости - чтобы движения можно было записать.
			// Расчет все равно в итоге будет завершен с ошибкой, но т.о. можно получить информацию о всех ошибочных регистраторах.
			Запись.Регистратор = КлючИЗначение.Ключ;
			Прервать;
		КонецЦикла;

	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции

#КонецОбласти

#Область УниверсальныеПроцедурыОписанияДанныхМеханизма

// Возвращает перечень объектов метаданных, на основании данных которых выполняется расчет себестоимости.
// В перечень не включаются объекты, которые являются одновременно и исходящими данными механизмов расчета партий и себестоимости.
//
// Параметры:
//	ВходящиеДанные - Соответствие - уже инициализированное хранилище для описания входящих данных
//	ТолькоТребующиеПерерасчета - Булево - если установлен, то будет возвращен перечень только тех данных,
//		изменение которых влечет за собой необходимость перерасчета партий и себестоимости
//		При изменении этих данных должна создаваться запись в регистре сведений ЗаданияКРасчетуСебестоимости.
//
// Возвращаемое значение:
//	Соответствие - Ключ - ОбъектМетаданных
//
Функция ВходящиеДанныеМеханизма(ВходящиеДанные = Неопределено, ТолькоТребующиеПерерасчета = Ложь) Экспорт
	
	Если ВходящиеДанные = Неопределено Тогда
		ВходящиеДанные = Новый Соответствие;
	КонецЕсли;
	
	Если ТолькоТребующиеПерерасчета Тогда
		Значение = Истина; // чтобы можно было проверить вхождение объекта метаданных в это соответствие
	Иначе
		Значение = Неопределено;
	КонецЕсли;
	
	Если НЕ ТолькоТребующиеПерерасчета Тогда 
		
		ВходящиеДанные.Вставить(Метаданные.Документы.ВнутреннееПотреблениеТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ВозвратТоваровОтКлиента, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.КорректировкаРеализации, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ОтчетОРозничныхПродажах, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациями, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПеремещениеТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПриобретениеТоваровУслуг, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.РасчетСебестоимостиТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаНоменклатуры, Значение);
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаПоПартнерам, Значение);
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.Справочники.КатегорииЭксплуатации, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.КлючиАналитикиУчетаНоменклатуры, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.Назначения, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.ПартииТМЦВЭксплуатации, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.СпособыРаспределенияПоНаправлениямДеятельности, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.ПланыВидовХарактеристик.СтатьиРасходов, Значение);
		
	КонецЕсли;

	
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, Значение);
	
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизаций, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизацийКПередаче, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РезервыТоваровОрганизаций, Значение);
	
	// Добавим регистры партионного учета версии 2.1
	ПартионныйУчет22.НеиспользуемыеДанныеМеханизмаВерсии21(ВходящиеДанные, Значение);
	
	Возврат ВходящиеДанные;
	
КонецФункции

// Возвращает перечень регистров, обслуживаемых механизмом расчета себестоимости.
//
// Возвращаемое значение:
//	Соответствие - Ключ - ОбъектМетаданных
//
Функция ИсходящиеДанныеМеханизма(ИсходящиеДанные = Неопределено) Экспорт
	
	// Перечень метаданных регистров, по которым формируются движения при расчете себестоимости.
	Если ИсходящиеДанные = Неопределено Тогда
		ИсходящиеДанные = Новый Соответствие;
	КонецЕсли;
	
	ИсходящиеДанные.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, 							Истина);
	
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, 			Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, 					Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.Закупки, 								Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы, 		Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура, 		Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, 							Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, 							Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, 					Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ФинансовыеРезультаты, 					Истина);
	
	Возврат ИсходящиеДанные;
	
КонецФункции

// Возвращает перечень регистров, рассчитываемых механизмом партионного учета версии 2.2, и используемых при расчете себестоимости.
//
Функция ИспользуемыеКэшиРегистровПартионногоУчета() Экспорт
	
	// Здесь перечислены регистры, которые (по И)
	// - рассчитываются механизмом партионного учета версии 2.2
	// - не рассчитываются механизмом расчета себестоимости
	// - являются входящими данными для механизма расчета себестоимости (используются кэши данных регистров)
	//
	// В случае, если выполняется отдельный запуск расчета себестоимости (не из партионного учета версии 2.2),
	// эти регистры не будут инициализированы - к их кэшам обращаться нельзя.
	//
	// Для этого делается следующее:
	// - перед началом расчета себестоимости "принудительно" инициализируются эти регистры (для того, чтобы сформировались их расчетные кэши)
	// - перед записью движений эти регистры удаляются из параметров расчета (записывать их не надо - движения по ним не формировались)
	
	ВходящиеДанные = Новый Соответствие;
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, 	  Истина);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4,  Истина);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, 			  	  Истина);
	
	Возврат ВходящиеДанные;
	
КонецФункции

// Возвращает название данного механизма и его номер версии.
//
Функция ТекущаяВерсияМеханизма() Экспорт
	Возврат НСтр("ru='Расчет себестоимости, версия 2.2'");
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти
