&НаСервере
Функция ПроверитьСтатусЗаявки(Заявка)

	Если Заявка.СтатусЗаявки = Перечисления.СтатусыЗаявки.Закрыта Тогда
		Закрыта = Истина;
	Иначе
		Закрыта = Ложь;
	КонецЕсли;
	
	Возврат Закрыта;
		
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПроверитьСтатусЗаявки(ПараметрКоманды[0]) Тогда 
		
		//{{_КОНСТРУКТОР_ПЕЧАТИ(АктВыполненныхРабот)
		ТабДок = Новый ТабличныйДокумент;
		АктВыполненныхРабот(ТабДок, ПараметрКоманды);
		
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать();
		//}}
		
	Иначе
		Сообщить("Заявка не закрыта!");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура АктВыполненныхРабот(ТабДок, ПараметрКоманды)
	
	Документы.ЗаявкаНаРемонт.АктВыполненныхРабот(ТабДок, ПараметрКоманды);
	
КонецПроцедуры
