
&НаКлиенте
Процедура МесяцНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2"); 
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(Месяц)
	Макет = Отчеты.ОтчетПоДоговорам.ПолучитьМакет("Макет");
	ОбластьПараметры = Макет.ПолучитьОбласть("Параметры");	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПараметры.Параметры.Месяц = Формат(Месяц, "ДФ=""ММ.гггг""");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Вывести(ОбластьПараметры);
	ТабДок.Вывести(ОбластьШапка);
	
	ЗапросДоговоров = Новый Запрос;
	ЗапросДоговоров.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТКонтрагенты
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Клиенты.Контрагент = Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговораОбслуживанияСрезПоследних.Контрагент КАК Контрагент,
		|	ДоговораОбслуживанияСрезПоследних.Период КАК Дата,
		|	ДоговораОбслуживанияСрезПоследних.Период КАК Период,
		|	ДоговораОбслуживанияСрезПоследних.Регистратор КАК Регистратор,
		|	ДоговораОбслуживанияСрезПоследних.АбонентскаяПлата КАК АбонентскаяПлата,
		|	ДоговораОбслуживанияСрезПоследних.Тариф КАК Тариф,
		|	ДоговораОбслуживанияСрезПоследних.ТарифСверхурочный КАК ТарифСверхурочный
		|ПОМЕСТИТЬ ВТДаты
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(
		|			&Дата,
		|			(СрокДействия > &Дата
		|				ИЛИ СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|				И НЕ ЧерныйСписок) КАК ДоговораОбслуживанияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговораОбслуживания.СрезПоследних(&Дата, ) КАК ДоговораОбслуживанияСрезПоследних1
		|		ПО ДоговораОбслуживанияСрезПоследних.Регистратор = ДоговораОбслуживанияСрезПоследних1.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ВТДаты.АбонентскаяПлата, ЛОЖЬ) КАК АбонентскаяПлата,
		|	ЕСТЬNULL(ВТДаты.Тариф, 0) КАК Тариф,
		|	ЕСТЬNULL(ВТДаты.ТарифСверхурочный, 0) КАК ТарифСверхурочный,
		|	ЕСТЬNULL(ВТДаты.Период, ""Без договора"") КАК Дата,
		|	ВТКонтрагенты.Ссылка КАК Контрагент,
		|	ЕСТЬNULL(ВТДаты.Регистратор.Ссылка, ""Договор отсутствует"") КАК РегистраторСсылка
		|ИЗ
		|	ВТКонтрагенты КАК ВТКонтрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДаты КАК ВТДаты
		|		ПО ВТКонтрагенты.Ссылка = ВТДаты.Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	АбонентскаяПлата,
		|	ВТКонтрагенты.Ссылка.Наименование";
	
	ЗапросДоговоров.Параметры.Вставить("Дата", КонецДня(Месяц));
	
	РезультатЗапросаДоговоров = ЗапросДоговоров.Выполнить();
	
	ВыборкаДоговоров = РезультатЗапросаДоговоров.Выбрать();
	
	СДоговором = 0;
	БезДоговора = 0;
	
	Пока ВыборкаДоговоров.Следующий() Цикл
		ОбластьСтрока.Параметры.Дата = Формат(ВыборкаДоговоров.Дата, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.Контрагент = ВыборкаДоговоров.Контрагент;
		ОбластьСтрока.Параметры.Абонент = ВыборкаДоговоров.АбонентскаяПлата;
		ОбластьСтрока.Параметры.Тариф = ВыборкаДоговоров.Тариф;
		ОбластьСтрока.Параметры.ТарифСверхурочный = ВыборкаДоговоров.ТарифСверхурочный;
		ОбластьСтрока.Параметры.Договор = ВыборкаДоговоров.РегистраторСсылка;
		
		//Если ВыборкаДоговоров.Тариф = 0 Тогда
		//	ОбластьСтрока.Параметры.НаличиеДоговора = Ложь;
		//	БезДоговора = БезДоговора + 1;
		//Иначе 
		//	ОбластьСтрока.Параметры.НаличиеДоговора = Истина;
		//	СДоговором = СДоговором + 1;
		//КонецЕсли;
		//
		//СУКА БЛЯДЬ НИКИТА!!!
		//Наличие договора нужно проверять по наличию ДОГОВОРА, а не сумме ТАРИФА
		Если ТипЗнч(ВыборкаДоговоров.РегистраторСсылка) = Тип("Строка") Тогда
			ОбластьСтрока.Параметры.НаличиеДоговора = Ложь;
			БезДоговора = БезДоговора + 1;
		Иначе 
			ОбластьСтрока.Параметры.НаличиеДоговора = Истина;
			СДоговором = СДоговором + 1;
		КонецЕсли;
		
		
		ТабДок.Вывести(ОбластьСтрока);
		Если ВыборкаДоговоров.Тариф = 0 Тогда
			Область= ТабДок.Область("R" + Строка(БезДоговора + СДоговором +4) + "C2:R" + Строка(БезДоговора + СДоговором + 4) + "C9");
			Область.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
		КонецЕсли;
	КонецЦикла;
		
	ОбластьПодвал.Параметры.С = СДоговором;
	ОбластьПодвал.Параметры.Без = БезДоговора;
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ЭтаФорма.Месяц);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
КонецПроцедуры
