
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОчередьЗаявок") Тогда
		Для Каждого Заявка Из Параметры.ОчередьЗаявок Цикл
			СтрокаОчереди = ОчередьЗаявок.Добавить();
			СтрокаОчереди.Заявка = Заявка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьРаботу(Команда)
	Если ЗначениеЗаполнено(Причина) Тогда
		Закрыть(Новый Структура("Причина",Причина));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите причину игнорирования заявок!",,"Причина");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЗаявокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Заявка);
КонецПроцедуры



#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

#КонецОбласти