
Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверка на дубли строк
	Для Каждого СтрокаТЗ Из Товары Цикл
		Для Индекс = Товары.Индекс(СтрокаТЗ) + 1 ПО Товары.Количество() - 1 Цикл
			Строка = Товары.Получить(Индекс);
			Если СтрокаТЗ.Номенклатура = Строка.Номенклатура
			   И СтрокаТЗ.КодАктивации = Строка.КодАктивации
			   И СтрокаТЗ.РегистрационныйНомер = Строка.РегистрационныйНомер
			   И СтрокаТЗ.Серия = Строка.Серия Тогда
			   Сообщить("Обнаружены повторяющиеся строки (" + СтрокаТЗ.НомерСтроки + ", " + Строка.НомерСтроки + "). Документ не может быть проведен.");
			   Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Проверка лицензии на остатках
	ЕстьОстатки = Ложь;
	СтрогийУчетЛицензий = Константы.СтрогийУчетЛицензий.Получить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Остатки = РегистрыНакопления.Лицензии.Остатки(ЭтотОбъект.МоментВремени(),Новый Структура(
																				"Номенклатура,Серия,,Номер,КодАктивации",
																				ТекСтрокаТовары.Номенклатура,
																				ТекСтрокаТовары.Серия,
																				ТекСтрокаТовары.РегистрационныйНомер,
																				ТекСтрокаТовары.КодАктивации
																				));
		Если Остатки.Количество() = 1 Тогда
			Если Остатки[0].Количество > 0 Тогда
				//Сообщить("Лицензия с указанными параметрами в строке " + ТекСтрокаТовары.НомерСтроки + " уже есть на остатках!");
				ЕстьОстатки = Истина;
				Отказ = СтрогийУчетЛицензий;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Если Не Отказ Тогда
		// регистр Лицензии Приход
		Движения.Лицензии.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.Лицензии.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Серия = ТекСтрокаТовары.Серия;
			Движение.Номер = ТекСтрокаТовары.РегистрационныйНомер;
			Движение.КодАктивации = ТекСтрокаТовары.КодАктивации;
			Движение.Количество = 1;
		КонецЦикла;
	Иначе
		Если ЕстьОстатки Тогда
			Сообщить("Есть позиции с лицензиями на остатках");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли; 
	
	Для Каждого Товар Из Товары Цикл
		Товар.КодАктивации = СокрЛП(Товар.КодАктивации);
		Товар.Серия = СокрЛП(Товар.Серия);
		Товар.РегистрационныйНомер = СокрЛП(Товар.РегистрационныйНомер);
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	//Фиксация в истории изменений
	АутсорсФункцииДокументовСервер.УстановитьИзменениеДокумента(ЭтотОбъект.Ссылка);
КонецПроцедуры
