
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дежурный") Тогда
		Дежурный = Параметры.Дежурный;
	Иначе
        Дежурный = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	Если Параметры.Свойство("Дата") Тогда
		Дата = Параметры.Дата;
	Иначе
        Дата = ТекущаяДата();
	КонецЕсли;
	Если Параметры.Свойство("Сверхурочка") Тогда
		Сверхурочка = Параметры.Сверхурочка;
	Иначе
        Сверхурочка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Если ЗначениеЗаполнено(Дата) Тогда
		ЭтаФорма.Закрыть(ЗаписатьВГрафик(Дата,Дежурный,Сверхурочка));
	Иначе
		Предупреждение("Не заполнена дата!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьВГрафик(Дата,Дежурный,Сверхурочка)
	Если Не ЗначениеЗаполнено(Дежурный) Тогда
		НовыйДежурныйНаборЗаписей = РегистрыСведений.ГрафикДежурств.СоздатьНаборЗаписей();
		НовыйДежурныйНаборЗаписей.Отбор.Дата.Установить(Дата);
		НовыйДежурныйНаборЗаписей.Записать();
		Возврат Новый Структура("Дата,Сотрудник,Сверхурочка",Дата,Справочники.ФизическиеЛица.ПустаяСсылка(),Ложь);
	Иначе
		НовыйДежурныйМенеджер = РегистрыСведений.ГрафикДежурств.СоздатьМенеджерЗаписи();
		НовыйДежурныйМенеджер.Дата = Дата;
		НовыйДежурныйМенеджер.Сотрудник = Дежурный;
		НовыйДежурныйМенеджер.Сверхурочка = Сверхурочка;
		НовыйДежурныйМенеджер.Записать();
		Возврат Новый Структура("Дата,Сотрудник,Сверхурочка",Дата,Дежурный,Сверхурочка);
	КонецЕсли;
КонецФункции