
&НаСервере
Функция  КлючевойНосительПриИзмененииНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	ЗапросДат = Новый Запрос;
	ЗапросДат.Текст = 
		"ВЫБРАТЬ
		|	ДатыКлючевыеНосителиСрезПоследних.RSAС КАК RSAС,
		|	ДатыКлючевыеНосителиСрезПоследних.RSAДо КАК RSAДо,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТС КАК ГОСТС,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТДо КАК ГОСТДо,
		|	ДатыКлючевыеНосителиСрезПоследних.Регистратор.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ДатыКлючевыеНосители.СрезПоследних(, ) КАК ДатыКлючевыеНосителиСрезПоследних
		|ГДЕ
		|	ДатыКлючевыеНосителиСрезПоследних.КлючевойНоситель = &КлючевойНоситель";
	
	ЗапросДат.УстановитьПараметр("КлючевойНоситель", Об.КлючевойНоситель);
	РезультатЗапросаДат = ЗапросДат.Выполнить();
	
	ВыборкаДат = РезультатЗапросаДат.Выбрать();
	ВыборкаДат.Следующий();
	
	Если Не ВыборкаДат.Количество() = 0 Тогда 
		Об.ГОСТДо = ВыборкаДат.ГОСТДо;
		Об.RSAДо = ВыборкаДат.RSAДо;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецФункции

&НаКлиенте
Процедура КлючевойНосительПриИзменении(Элемент)
	КлючевойНосительПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда 
		Объект.ГОСТС = ТекущаяДата();
		Объект.RSAС = ТекущаяДата();
	КонецЕсли;
	Если НаОсновании Тогда
		КлючевойНосительПриИзмененииНаСервере();	
	КонецЕсли;
КонецПроцедуры
