

Процедура ПриЗаписи(Отказ)
	Движения.СтатусыЗаявок.Записывать = Истина;
	Движение = Движения.СтатусыЗаявок.Добавить();
	Движение.ТемаЗаявки = ТемаЗаявки;
	Движение.ДатаИзменения = Дата;
	Движение.Статус = Статус;
	Движение.Решение = Решение;

	ВзаимодействиеСTelegramСервер.РазослатьЗаявку(ЭтотОбъект.Ссылка,ЭтотОбъект.ДополнительныеСвойства.Новый);
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Новый", ЭтоНовый());
КонецПроцедуры

