Процедура ПриЗаписи(Отказ)
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Отказ = Истина;
		СтрокаСообщения = "Не указан клиент!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, , "Объект.Клиент", , Отказ);
		Возврат;
	КонецЕсли;
	
	//Фиксация в истории изменений
	АутсорсФункцииДокументовСервер.УстановитьИзменениеДокумента(ЭтотОбъект.Ссылка,Дата);
	
	Движения.СтатусыЗаявок.Записывать = Истина;
	Движение = Движения.СтатусыЗаявок.Добавить();
	Движение.ТемаЗаявки = ТемаЗаявки;
	Движение.ДатаИзменения = Дата;
	Движение.Статус = Статус;
	Движение.Решение = Решение;

	ВзаимодействиеСTelegramСервер.РазослатьЗаявку(Ссылка,ДополнительныеСвойства);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДополнительныеСвойства.Вставить("Новый", ЭтоНовый());
	Если Не ЭтоНовый() Тогда
		Если ОтветственноеЛицо <> Ссылка.ОтветственноеЛицо Тогда
			ДополнительныеСвойства.Вставить("СтарыйИсполнитель",Ссылка.ОтветственноеЛицо);
			ДополнительныеСвойства.Вставить("СменаИсполнителя",Истина);
		Иначе
			ДополнительныеСвойства.Вставить("СменаИсполнителя",Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыЗаявок.Закрыта И НЕ ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		ДатаЗакрытия = Дата;
	КонецЕсли;
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(ПлановаяДатаРешения) Тогда
		Если Приоритет = Перечисления.ПриоритетыЗаявок.Срочно Тогда
			ПлановаяДатаРешения = АутсорсРаботы.СрокРеагирования(Дата,1);
		Иначе
			ПлановаяДатаРешения = АутсорсРаботы.СрокРеагирования(Дата);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Исполнитель",ОтветственноеЛицо);
КонецПроцедуры

Процедура ОбработкаЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Автор = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДатаЗакрытия = '00010101';
	ДатаОткрытия = '00010101';
    Дата = '00010101';
    ПлановаяДатаРешения = '00010101'; 
    ОтветственноеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
    Автор = Пользователи.АвторизованныйПользователь();    	 
КонецПроцедуры
