Процедура ПриЗаписи(Отказ)
	//Фиксация в истории изменений
	АутсорсФункцииДокументовСервер.УстановитьИзменениеДокумента(ЭтотОбъект.Ссылка);
	
	Движения.СтатусыЗаявок.Записывать = Истина;
	Движение = Движения.СтатусыЗаявок.Добавить();
	Движение.ТемаЗаявки = ТемаЗаявки;
	Движение.ДатаИзменения = Дата;
	Движение.Статус = Статус;
	Движение.Решение = Решение;

	ВзаимодействиеСTelegramСервер.РазослатьЗаявку(Ссылка,ДополнительныеСвойства);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДополнительныеСвойства.Вставить("Новый", ЭтоНовый());
	Если Не ЭтоНовый() Тогда
		Если ОтветственноеЛицо <> Ссылка.ОтветственноеЛицо Тогда
			ДополнительныеСвойства.Вставить("СтарыйИсполнитель",Ссылка.ОтветственноеЛицо);
			ДополнительныеСвойства.Вставить("СменаИсполнителя",Истина);
		Иначе
			ДополнительныеСвойства.Вставить("СменаИсполнителя",Ложь);
		КонецЕсли;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("Исполнитель",ОтветственноеЛицо);
КонецПроцедуры

Процедура ОбработкаЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Автор = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

