// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Доверенность");
    Если НужноПечататьМакет Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "Доверенность",
        НСтр("ru = 'Доверенность'"),
        ПечатьДоверенности(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.РегстрацияККТ.Доверенность");
    КонецЕсли;
КонецПроцедуры

Функция ПечатьДоверенности(МассивОбъектов, ОбъектыПечати)
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Доверенность";
    Представитель = Пользователи.ТекущийПользователь().ФизическоеЛицо;
    АдресПредставителя = ПолучитьАдресПредставителя(Представитель);
    
    // Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	РегистрацияККТ.Ссылка КАК Ссылка,
    |	РегистрацияККТ.Дата КАК Дата,
    |	РегистрацияККТ.Клиент КАК Клиент,
    |	РегистрацияККТ.Клиент.ПолноеНаименование КАК КлиентПредставление,
    |	РегистрацияККТ.Клиент.ИНН КАК ИННКлиента,
    |	РегистрацияККТ.Клиент.ОГРН КАК ОГРНКлиента
    |ИЗ
    |	Документ.РегистрацияККТ КАК РегистрацияККТ";
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Шапка = Запрос.Выполнить().Выбрать();
    
    ПервыйДокумент = Истина;
    Пока Шапка.Следующий() Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        ПредставительПредставление = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Представитель);
        Паспорт = ФизическиеЛицаУТ.ПолучитьДокументФизическогоЛицаПоУмолчанию(Представитель, , );
                
        ПараметрыМакета = Новый Структура();
        ПараметрыМакета.Вставить("Дата",Формат(ТекущаяДата(),"ДФ='dd MMMM yyyy ""г.""';"));
        
        Макет = ПолучитьМакет("Доверенность");
        
        ОбластьШапка = Макет.ПолучитьОбласть("Шапка");    	
        
        ЗаполнитьЗначенияСвойств(ОбластьШапка, Шапка);       
    	
    	ТабличныйДокумент.Вывести(ОбластьШапка);
    	
    	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
    КонецЦикла;
    
    Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьАдресПредставителя(ФизическоеЛицо);
	Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизическоеЛицо, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
	Возврат Адрес;
КонецФункции

#Область ПрограммныйИнтерфейс
// Заполняет список команд печати.
// Параметры:
// КомандыПечати - ТаблицаЗначений - состав полей см. в функции управлениеПечатью.СоздатьКоллекциюКомандПечати.

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РегистрацияККТ";  
	КомандаПечати.Идентификатор = "Доверенность";
	КомандаПечати.Представление = НСтр("ru = 'Доверенность'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 
КонецПроцедуры
#КонецОбласти