&НаСервере
Процедура ПриОткрытииНаСервере(перем_ТабЗнач)
	ЗапросЛицензий = Новый Запрос;
	ЗапросЛицензий.Текст = 
		//"ВЫБРАТЬ
		//|	удалить_Лицензии.Номенклатура КАК Номенклатура,
		//|	удалить_Лицензии.СерийныйНомер КАК СерийныйНомер,
		//|	удалить_Лицензии.КодАктивации КАК КодАктивации,
		//|	удалить_Лицензии.РегистрационныйНомер КАК РегистрационныйНомер,
		//|	удалить_Лицензии.Ссылка КАК Ссылка
		//|ИЗ
		//|	Справочник.удалить_Лицензии КАК удалить_Лицензии
		//|ГДЕ
		//|	НЕ удалить_Лицензии.Продан";
		"ВЫБРАТЬ
		|	ЛицензииОстатки.Номенклатура КАК Номенклатура,
		|	ЛицензииОстатки.Серия КАК Серия,
		|	ЛицензииОстатки.КодАктивации КАК КодАктивации,
		|	ЛицензииОстатки.Номер КАК Номер
		|ИЗ
		|	РегистрНакопления.Лицензии.Остатки(&Дата, ) КАК ЛицензииОстатки
		|ГДЕ
		|	ЛицензииОстатки.КоличествоОстаток = 1";
	ЗапросЛицензий.УстановитьПараметр("Дата",ТекущаяДата());
	РезультатЗапросаЛицезний = ЗапросЛицензий.Выполнить();
	
	ВыборкаЛицензий = РезультатЗапросаЛицезний.Выбрать();
	
	Пока ВыборкаЛицензий.Следующий() Цикл
		ИсключениеЛицензии = Новый Структура();
		ИсключениеЛицензии.Вставить("Номенклатура",ВыборкаЛицензий.Номенклатура);
		ИсключениеЛицензии.Вставить("Серия",ВыборкаЛицензий.Серия);
		ИсключениеЛицензии.Вставить("РегистрационныйНомер",ВыборкаЛицензий.Номер);
		ИсключениеЛицензии.Вставить("КодАктивации",ВыборкаЛицензий.КодАктивации);
		Если ИсключениеЛицензий.НайтиСтроки(ИсключениеЛицензии).Количество() = 0 Тогда
			Стр = перем_ТабЗнач.Добавить();
			Стр.Номенклатура = ВыборкаЛицензий.Номенклатура;
			Стр.СерийныйНомер = ВыборкаЛицензий.Серия;
			Стр.КодАктивации = ВыборкаЛицензий.КодАктивации;
			Стр.РегистрационныйНомер = ВыборкаЛицензий.Номер;
		КонецЕсли;
	КонецЦикла;	
	КопироватьДанныеФормы(перем_ТабЗнач, ТабЗнач);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	перем_ТабЗнач = ТабЗнач;
	ПриОткрытииНаСервере(перем_ТабЗнач);
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СтрокаТЗ = ТабЗнач.Получить(ВыбраннаяСтрока);
	СтрокаТЗ = ТабЗнач.НайтиПоИдентификатору(ВыбраннаяСтрока);

	Строка = Объект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(Строка,СтрокаТЗ);
	//Строка.Номенклатура = СтрокаТЗ.Номенклатура;
	//Строка.РегистрационныйНомер = СтрокаТЗ.РегистрационныйНомер;
	//Строка.КодАктивации = СтрокаТЗ.КодАктивации;
	//Строка.Серия = СтрокаТЗ.СерийныйНомер;
	
	//ТабЗнач.Удалить(ВыбраннаяСтрока);
	ТабЗнач.Удалить(ТабЗнач.Индекс(СтрокаТЗ));
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ЭтаФорма.Закрыть(Объект.Товары);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИсключениеЛицензий") Тогда
		мИсключениеЛицензий = Параметры.ИсключениеЛицензий;
		Для Каждого Строка Из мИсключениеЛицензий Цикл
			СтрокаИсключения = ИсключениеЛицензий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИсключения,Строка);
		КонецЦикла;
    КонецЕсли;
КонецПроцедуры
