
#Область СлужебныйПрограммныйИнтерфейс

Функция НеобходимВызовСервера(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Перем ПараметрыДействия;
	
	//++ Локализация
	
	Если СтруктураДействий.Свойство("ЗаполнитьПартиюТМЦВЭксплуатации", ПараметрыДействия)
		И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
		И ЗначениеЗаполнено(ТекущаяСтрока.ФизическоеЛицо) Тогда
		
		Если ЗначениеЗаполнено(ПараметрыДействия.Дата)
			И ЗначениеЗаполнено(ПараметрыДействия.Организация)
			И ЗначениеЗаполнено(ПараметрыДействия.Подразделение)
			И (Не ПараметрыДействия.Свойство("ХозяйственнаяОперация")
				Или (ЗначениеЗаполнено(ПараметрыДействия.ХозяйственнаяОперация)
					И ПараметрыДействия.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратИзЭксплуатации"))) Тогда
			
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	//-- Локализация

	Возврат Ложь;
	
КонецФункции

Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	//++ Локализация
	
	ОбработкаТабличнойЧастиКлиентСерверЛокализация.ЗаполнитьПризнакиКатегорииЭксплуатации(
		ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	
	//-- Локализация
	
КонецПроцедуры

Процедура ПолучитьТекущуюСтрокуСтруктурой(СтруктураДействий, СтруктураПолейТЧ) Экспорт

	//++ Локализация
	
	Если СтруктураДействий.Свойство("ЗаполнитьПартиюТМЦВЭксплуатации") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("ФизическоеЛицо");
		СтруктураПолейТЧ.Вставить("ПартияТМЦВЭксплуатации");
		СтруктураПолейТЧ.Вставить("ИнвентарныйУчет");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("Количество");
	КонецЕсли;
	
	
	//-- Локализация
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
