&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("РегистрСведений.ПочасовыеРаботы.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Исполнитель", ПараметрыВыполненияКоманды.Источник.Параметры.Ключ));
    ОткрытьФорму("РегистрСведений.ПочасовыеРаботы.ФормаСписка", 
                ПараметрыФормы, 
                ПараметрыВыполненияКоманды.Источник, 
                ПараметрыВыполненияКоманды.Уникальность, 
                ПараметрыВыполненияКоманды.Окно, 
                ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
