// Возвращает зарегистрированное в Telegram физ.лицо по соответствию UserID
// 
// Параметры:
//  UserID - Число - UserID аккаунта Telegram
// 
// Возвращаемое значение:
//  СправочникСсылка.ФизическиеЛица - Физ.лицо
Функция ФизЛицоПоUserID(UserID) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПользователиБотаTelegram.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ПользователиБотаTelegram КАК ПользователиБотаTelegram
		|ГДЕ
		|	ПользователиБотаTelegram.UserID = &UserID";
	
	Запрос.УстановитьПараметр("UserID", UserID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФизЛицо = ВыборкаДетальныеЗаписи.ФизическоеЛицо;	
	КонецЕсли;
	
	Возврат ФизЛицо;
КонецФункции