
Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверка на дубли строк
	Для Каждого СтрокаТЗ Из Товары Цикл
		Для Индекс = Товары.Индекс(СтрокаТЗ) + 1 ПО Товары.Количество() - 1 Цикл
			Строка = Товары.Получить(Индекс);
			Если СтрокаТЗ.Номенклатура = Строка.Номенклатура
			   И СтрокаТЗ.КодАктивации = Строка.КодАктивации
			   И СтрокаТЗ.РегистрационныйНомер = Строка.РегистрационныйНомер
			   И СтрокаТЗ.Серия = Строка.Серия Тогда
			   Сообщить("Обнаружены повторяющиеся строки (" + СтрокаТЗ.НомерСтроки + ", " + Строка.НомерСтроки + "). Документ не может быть проведен.");
			   Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Проверка лицензии на остатках
	ЕстьОстатки = Истина;
	СтрогийУчетЛицензий = Константы.СтрогийУчетЛицензий.Получить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Остатки = РегистрыНакопления.Лицензии.Остатки(ЭтотОбъект.МоментВремени(),Новый Структура(
																			"Номенклатура,Серия,,Номер,КодАктивации",
																			ТекСтрокаТовары.Номенклатура,
																			ТекСтрокаТовары.Серия,
																			ТекСтрокаТовары.РегистрационныйНомер,
																			ТекСтрокаТовары.КодАктивации
																			));
		Если Остатки.Количество() = 1 Тогда
			Если Остатки[0].Количество < 1 Тогда
				ЕстьОстатки = Ложь;
				Отказ = СтрогийУчетЛицензий;
			КонецЕсли;
		Иначе
			ЕстьОстатки = Ложь;
			Отказ = СтрогийУчетЛицензий;
		КонецЕсли;	
	КонецЦикла;
	
	Если Не Отказ Тогда

		// регистр Лицензии Расход
		Движения.Лицензии.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.Лицензии.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Номер = ТекСтрокаТовары.РегистрационныйНомер;
			Движение.КодАктивации = ТекСтрокаТовары.КодАктивации;
			Движение.Серия = ТекСтрокаТовары.Серия;
			Движение.Количество = 1;
		КонецЦикла;
	Иначе
		Если НЕ ЕстьОстатки Тогда
			Сообщить("Есть позиции с отсутствующими лицензиями на остатках");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеЛицензий") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаТовары);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	Для Каждого Товар Из Товары Цикл
		Товар.КодАктивации = СокрЛП(Товар.КодАктивации);
		Товар.Серия = СокрЛП(Товар.Серия);
		Товар.РегистрационныйНомер = СокрЛП(Товар.РегистрационныйНомер);
	КонецЦикла;
КонецПроцедуры