
&НаСервере
Процедура СформироватьНаСервере(ТабДок, ВидОтчета, Контрагент)
	ТабДок.Очистить();
	
	Истекающие = 0;
	Неистекающие = 0;
	
	Макет = Отчеты.ОтчетДатФискальныхНакопителей.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	
	ТабДок.Вывести(ОбластьШапка);
	
	ЗапросДат = Новый Запрос;
	ЗапросДат.Текст = 
		"ВЫБРАТЬ
		|	ДатыФНСрезПоследних.ФискальныйНакопитель КАК ФискальныйНакопитель,
		|	ДатыФНСрезПоследних.Клиент КАК Клиент,
		|	ДатыФНСрезПоследних.СрокДействия КАК СрокДействия,
		|	ДатыФНСрезПоследних.Регистратор.Ссылка КАК Ссылка,
		|	КарточкиРегистрацийККТСрезПоследних.ККТ.Код КАК ЗН,
		|	КарточкиРегистрацийККТСрезПоследних.РН КАК РН
		|ИЗ
		|	РегистрСведений.ДатыФН.СрезПоследних(, ) КАК ДатыФНСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкиРегистрацийККТ.СрезПоследних КАК КарточкиРегистрацийККТСрезПоследних
		|		ПО ДатыФНСрезПоследних.ФискальныйНакопитель = КарточкиРегистрацийККТСрезПоследних.ФН
		|ГДЕ
		|	ДатыФНСрезПоследних.Регистратор.ВидОперации <> &ВидОперации
		|	И НЕ ДатыФНСрезПоследних.Регистратор.ФискальныйНакопитель.Закрыт";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЗапросДат.УстановитьПараметр("Контрагент",Контрагент);
		ЗапросДат.Текст = ЗапросДат.Текст + "
		|	И ДатыФНСрезПоследних.Клиент.Контрагент = &Контрагент";
	КонецЕсли;
	ЗапросДат.Текст = ЗапросДат.Текст +	"
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокДействия";	
	
	ЗапросДат.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийККТ.Закрытие);
	РезультатЗапросаДат = ЗапросДат.Выполнить();	
	ВыборкаДат = РезультатЗапросаДат.Выбрать();
	
	Пока ВыборкаДат.Следующий() Цикл
		//ОбластьСтрока.Параметры.Дата = Формат(ВыборкаДат.Дата, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.Фн = ВыборкаДат.ФискальныйНакопитель;
		ОбластьСтрока.Параметры.ДатаОкончания = Формат(ВыборкаДат.СрокДействия, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.Клиент = ВыборкаДат.Клиент;
		ОбластьСтрока.Параметры.ФнСсылка = ВыборкаДат.Ссылка;
		ОбластьСтрока.Параметры.ЗН = ВыборкаДат.ЗН;
		ОбластьСтрока.Параметры.РН = ВыборкаДат.РН;
		
		Если ВыборкаДат.СрокДействия - ТекущаяДата() >= 2592000 Тогда
				Неистекающие = Неистекающие + 1;
				Если ВидОтчета = "2" Тогда
					Продолжить;
				КонецЕсли;
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтрока);
		Если ВыборкаДат.СрокДействия - ТекущаяДата() < 3600 * 24 * 30 Тогда
			Истекающие = Истекающие + 1;
			Если ВидОтчета = "1" Тогда
				//Область= ТабДок.Область("R" + Строка(Истекающие + Неистекающие + 2) + "C2:R" +  Строка(Истекающие + Неистекающие + 2) + "C6");
				Область = ТабДок.Область("ДанныеСтроки");
				Область.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
			КонецЕсли;
		Иначе
		КонецЕсли;
	КонецЦикла;
	ОбластьИтоги.Параметры.Истекающих = Истекающие;
	ОбластьИтоги.Параметры.Неистекающих = Неистекающие;
	ТабДок.Вывести(ОбластьИтоги);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ТабДок, ВидОтчета, Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидОтчета = "2";
	СформироватьНаСервере(ТабДок, ВидОтчета, Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	СформироватьНаСервере(ТабДок, ВидОтчета, Контрагент);
КонецПроцедуры
