&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мГод = Год(ТекущаяДата());
	мТекМесяц = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНадпись();
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопки(ЭльФ)
	тКом = Прав(Эльф.Имя, 2);
	Если Прав(тКом, 1) = "Г" Тогда
		мГод = ?(Лев(тКом, 1) = "П", мГод + 1, мГод - 1);
		ОбновитьНадпись();
		Возврат;
	ИначеЕсли тКом <> "ВБ" Тогда
		мТекМесяц = Число(Прав(ЭльФ.Имя, 2));
		ОбновитьНадпись();
		Закрыть(ДатаСтрокой);
	ИначеЕсли тКом = "ВБ" Тогда
		Закрыть(ДатаСтрокой);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадпись()
	ДатаСтрокой = Дата(мГод, мТекМесяц, 1);	
КонецПроцедуры

