
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	//СвойстваСписка.ОсновнаяТаблица = "Документ.ДоговораОбслуживания";
	//СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	//СвойстваСписка.ТекстЗапроса = "ВЫБРАТЬ
	//                              |	ДоговораОбслуживанияСрезПоследних.Период КАК Период,
	//                              |	ДоговораОбслуживанияСрезПоследних.Регистратор КАК Регистратор,
	//                              |	ДоговораОбслуживанияСрезПоследних.Контрагент КАК Контрагент,
	//                              |	ДоговораОбслуживанияСрезПоследних.АбонентскаяПлата КАК АбонентскаяПлата,
	//                              |	ДоговораОбслуживанияСрезПоследних.Тариф КАК Тариф,
	//                              |	ДоговораОбслуживанияСрезПоследних.ТарифСверхурочный КАК ТарифСверхурочный,
	//                              |	ДоговораОбслуживанияСрезПоследних.СрокДействия КАК СрокДействия,
	//                              |	&СтатусДействующий КАК Статус
	//                              |ПОМЕСТИТЬ ДействующиеДоговора
	//                              |ИЗ
	//                              |	РегистрСведений.ДоговораОбслуживания.СрезПоследних(
	//                              |			&Дата,
	//                              |			(СрокДействия > &Дата
	//                              |				ИЛИ СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	//                              |				И НЕ ЧерныйСписок) КАК ДоговораОбслуживанияСрезПоследних
	//                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговораОбслуживания.СрезПоследних(&Дата, ) КАК ДоговораОбслуживанияСрезПоследних1
	//                              |		ПО ДоговораОбслуживанияСрезПоследних.Регистратор = ДоговораОбслуживанияСрезПоследних1.Регистратор
	//                              |ГДЕ
	//                              |	ДоговораОбслуживанияСрезПоследних.Период <= &Дата
	//                              |;
	//                              |
	//                              |////////////////////////////////////////////////////////////////////////////////
	//                              |ВЫБРАТЬ
	//                              |	ДоговораОбслуживанияСрезПоследних.Период КАК Период,
	//                              |	ДоговораОбслуживанияСрезПоследних.Регистратор КАК Регистратор,
	//                              |	ДоговораОбслуживанияСрезПоследних.Контрагент КАК Контрагент,
	//                              |	ДоговораОбслуживанияСрезПоследних.АбонентскаяПлата КАК АбонентскаяПлата,
	//                              |	ДоговораОбслуживанияСрезПоследних.Тариф КАК Тариф,
	//                              |	ДоговораОбслуживанияСрезПоследних.ТарифСверхурочный КАК ТарифСверхурочный,
	//                              |	ДоговораОбслуживанияСрезПоследних.СрокДействия КАК СрокДействия,
	//                              |	&СтатусЧерныйСписок КАК Статус
	//                              |ПОМЕСТИТЬ ЧерныйСписокДоговоров
	//                              |ИЗ
	//                              |	РегистрСведений.ДоговораОбслуживания.СрезПоследних(
	//                              |			&Дата,
	//                              |			(СрокДействия > &Дата
	//                              |				ИЛИ СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	//                              |				И ЧерныйСписок) КАК ДоговораОбслуживанияСрезПоследних
	//                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговораОбслуживания.СрезПоследних(&Дата, ) КАК ДоговораОбслуживанияСрезПоследних1
	//                              |		ПО ДоговораОбслуживанияСрезПоследних.Регистратор = ДоговораОбслуживанияСрезПоследних1.Регистратор
	//                              |;
	//                              |
	//                              |////////////////////////////////////////////////////////////////////////////////
	//                              |ВЫБРАТЬ
	//                              |	ЕСТЬNULL(ДействующиеДоговора.Регистратор, ЧерныйСписокДоговоров.Регистратор) КАК Регистратор,
	//                              |	ЕСТЬNULL(ДействующиеДоговора.Период, ЧерныйСписокДоговоров.Период) КАК Период,
	//                              |	ЕСТЬNULL(ДействующиеДоговора.Контрагент, ЧерныйСписокДоговоров.Контрагент) КАК Контрагент,
	//                              |	ЕСТЬNULL(ДействующиеДоговора.АбонентскаяПлата, ЧерныйСписокДоговоров.АбонентскаяПлата) КАК АбонентскаяПлата,
	//                              |	ЕСТЬNULL(ДействующиеДоговора.Тариф, ЧерныйСписокДоговоров.Тариф) КАК Тариф,
	//                              |	ЕСТЬNULL(ДействующиеДоговора.ТарифСверхурочный, ЧерныйСписокДоговоров.ТарифСверхурочный) КАК ТарифСверхуорочный,
	//                              |	ЕСТЬNULL(ДействующиеДоговора.СрокДействия, ЧерныйСписокДоговоров.СрокДействия) КАК СрокДействия,
	//                              |	ЕСТЬNULL(ДействующиеДоговора.Статус, ЧерныйСписокДоговоров.Статус) КАК Статус
	//                              |ПОМЕСТИТЬ ДействующиеИЧСДоговора
	//                              |ИЗ
	//                              |	ЧерныйСписокДоговоров КАК ЧерныйСписокДоговоров
	//                              |		ПОЛНОЕ СОЕДИНЕНИЕ ДействующиеДоговора КАК ДействующиеДоговора
	//                              |		ПО (ЛОЖЬ)
	//                              |;
	//                              |
	//                              |////////////////////////////////////////////////////////////////////////////////
	//                              |ВЫБРАТЬ
	//                              |	ДоговораОбслуживания.Период КАК Период,
	//                              |	ДоговораОбслуживания.Регистратор КАК Регистратор,
	//                              |	ДоговораОбслуживания.Контрагент КАК Контрагент,
	//                              |	ДоговораОбслуживания.АбонентскаяПлата КАК АбонентскаяПлата,
	//                              |	ДоговораОбслуживания.Тариф КАК Тариф,
	//                              |	ДоговораОбслуживания.ТарифСверхурочный КАК ТарифСверхурочный,
	//                              |	ДоговораОбслуживания.СрокДействия КАК СрокДействия,
	//                              |	&СтатусНедействующий КАК Статус
	//                              |ПОМЕСТИТЬ НедействующиеДоговора
	//                              |ИЗ
	//                              |	РегистрСведений.ДоговораОбслуживания КАК ДоговораОбслуживания
	//                              |		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеИЧСДоговора КАК ДействующиеИЧСДоговора
	//                              |		ПО ДоговораОбслуживания.Регистратор = ДействующиеИЧСДоговора.Регистратор
	//                              |ГДЕ
	//                              |	ДействующиеИЧСДоговора.Регистратор ЕСТЬ NULL
	//                              |;
	//                              |
	//                              |////////////////////////////////////////////////////////////////////////////////
	//                              |ВЫБРАТЬ
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.Регистратор, НедействующиеДоговора.Регистратор) КАК Ссылка,
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.Период, НедействующиеДоговора.Период) КАК Период,
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.Контрагент, НедействующиеДоговора.Контрагент) КАК Контрагент,
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.АбонентскаяПлата, НедействующиеДоговора.АбонентскаяПлата) КАК АбонентскаяПлата,
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.Тариф, НедействующиеДоговора.Тариф) КАК Тариф,
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.ТарифСверхуорочный, НедействующиеДоговора.ТарифСверхурочный) КАК ТарифСверхурочный,
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.СрокДействия, НедействующиеДоговора.СрокДействия) КАК СрокДействия,
	//                              |	ЕСТЬNULL(ДействующиеИЧСДоговора.Статус, НедействующиеДоговора.Статус) КАК Статус
	//                              |ИЗ
	//                              |	НедействующиеДоговора КАК НедействующиеДоговора
	//                              |		ПОЛНОЕ СОЕДИНЕНИЕ ДействующиеИЧСДоговора КАК ДействующиеИЧСДоговора
	//                              |		ПО (1 <> 1)
	//                              |
	//                              |УПОРЯДОЧИТЬ ПО
	//                              |	Период";
	//ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,СвойстваСписка);
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата",ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("СтатусДействующий",Перечисления.СтатусыДоговоровОбслуживания.Действующий);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусНедействующий",Перечисления.СтатусыДоговоровОбслуживания.Недействующий);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусЧерныйСписок",Перечисления.СтатусыДоговоровОбслуживания.ЧерныйСписок);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);		                
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
