Функция ПолучитьДанныеЛицензииПоКодуАктивации(КодАктивации) Экспорт
	Лицензия = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛицензииОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ЛицензииОстаткиИОбороты.Серия КАК Серия,
		|	ЛицензииОстаткиИОбороты.Номер КАК Номер,
		|	ЛицензииОстаткиИОбороты.КодАктивации КАК КодАктивации,
		|	ЛицензииОстаткиИОбороты.Регистратор КАК Регистратор,
		|	ЛицензииОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.Лицензии.ОстаткиИОбороты(, , Запись, , ) КАК ЛицензииОстаткиИОбороты
		|ГДЕ
		|	ЛицензииОстаткиИОбороты.КодАктивации = &КодАктивации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор УБЫВ";
	
	Запрос.УстановитьПараметр("КодАктивации", КодАктивации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Лицензия.Вставить("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура);
		Лицензия.Вставить("Серия",ВыборкаДетальныеЗаписи.Серия);
		Лицензия.Вставить("Номер",ВыборкаДетальныеЗаписи.Номер);
		Лицензия.Вставить("КодАктивации",ВыборкаДетальныеЗаписи.КодАктивации);
		Лицензия.Вставить("Количество",ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток);
	КонецЕсли;
	Возврат Лицензия;
КонецФункции