
// Определяет модель фискального накопителя по его заводскому номеру
// 
// Параметры:
//  ЗаводскойНомер - Строка - Заводской номер фискального накопителя 
// 
// Возвращаемое значение:
//  СправочникСсылка.ФискальныеНакопители - Модель фискального накопителя
Функция МодельФНПоЗН(ЗаводскойНомер) Экспорт
	Модель = Справочники.ФискальныеНакопители.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МоделиФискальныхНакопителей.Ссылка КАК Ссылка,
		|	МоделиФискальныхНакопителей.ШаблонЗаводскогоНомера КАК ШаблонЗаводскогоНомера
		|ИЗ
		|	Справочник.МоделиФискальныхНакопителей КАК МоделиФискальныхНакопителей
		|ГДЕ
		|	МоделиФискальныхНакопителей.ШаблонЗаводскогоНомера <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ШаблонЗаводскогоНомера";
	
	ТаблицаШаблоновЗН = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаШаблона Из ТаблицаШаблоновЗН Цикл
		Префикс = Лев(СтрокаШаблона.ШаблонЗаводскогоНомера,СтрНайти(СтрокаШаблона.ШаблонЗаводскогоНомера,"X") - 1);
		Если Лев(Формат(ЗаводскойНомер,"ЧГ="),СтрДлина(Префикс)) = Префикс Тогда
			Модель = СтрокаШаблона.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Модель;
КонецФункции
