////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые в документе ПрочееОприходованиеТоваров.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриОткрытии(Форма) Экспорт

	//++ Локализация
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	

	//-- Локализация
	
КонецПроцедуры

Функция ОбработкаВыбора(Форма, ВыбранноеЗначение, ИсточникВыбора) Экспорт

	ТребуетсяВызовСервера = Ложь;
	
	//++ Локализация
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора" Тогда
		
		Если ВыбранноеЗначение.Количество() > 0 Тогда
			ТребуетсяВызовСервера = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
	//-- Локализация
	
	Возврат ТребуетсяВызовСервера;
	
КонецФункции
 
#КонецОбласти
