
&НаКлиенте
Процедура ЗаполнениеДанныехКонтактныхЛиц()
	Для Каждого КонтактноеЛицоСтрока Из Объект.КонтактныеЛица Цикл
		Элементы.СтраницаКонтакты.ПодчиненныеЭлементы.КонтактныеЛица.ТекущаяСтрока = КонтактноеЛицоСтрока.ПолучитьИдентификатор();
		ТекущиеДанные = Элементы.СтраницаКонтакты.ПодчиненныеЭлементы.КонтактныеЛица.ТекущиеДанные;
		ЗаполнитьДанныеСтрокиКондактногоЛица(ТекущиеДанные);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСтрокиКондактногоЛица(ТекущиеДанные)
	КонтактноеЛицо = ТекущиеДанные.КонтактноеЛицо;
	ДанныеКонтактногоЛица = ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо);
	ТекущиеДанные.Телефон = ДанныеКонтактногоЛица.Телефон;
	ТекущиеДанные.ЭлектроннаяПочта = ДанныеКонтактногоЛица.ЭлектроннаяПочта;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо)
	Телефон = "";
	ЭлектроннаяПочта = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И ВыборкаДетальныеЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица Тогда
			Телефон = ВыборкаДетальныеЗаписи.Представление;
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И ВыборкаДетальныеЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица Тогда
			ЭлектроннаяПочта = ВыборкаДетальныеЗаписи.Представление;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Телефон,ЭлектроннаяПочта",Телефон,ЭлектроннаяПочта);
КонецФункции

&НаКлиенте
Процедура КонтактныеЛицаКонтактноеЛицоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СтраницаКонтакты.ПодчиненныеЭлементы.КонтактныеЛица.ТекущиеДанные;
	ЗаполнитьДанныеСтрокиКондактногоЛица(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеДанныехКонтактныхЛиц();
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Объект.ПолноеНаименование = Текст;
	Объект.Наименование = Текст
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерТелефонаКонтактногоЛица(КонтактноеЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК НомерТелефона
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = &Вид
		|	И ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НомерТелефона = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НомерТелефона = ВыборкаДетальныеЗаписи.НомерТелефона;		
	КонецЕсли;
	
	Возврат НомерТелефона;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЭлектроннуюПочтуКонтактногоЛица(КонтактноеЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК ЭлектроннаяПочта
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = &Вид
		|	И ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЭлектроннаяПочта = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЭлектроннаяПочта = ВыборкаДетальныеЗаписи.ЭлектроннаяПочта;		
	КонецЕсли;
	
	Возврат ЭлектроннаяПочта;
КонецФункции
