
Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.ДневнойОтчетПочасовыхРабот.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДневнойОтчетПочасовыхРабот.Дата,
	|	ДневнойОтчетПочасовыхРабот.Исполнитель,
	|	ДневнойОтчетПочасовыхРабот.Номер,
	|	ДневнойОтчетПочасовыхРабот.Данные.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВремяПрибытия,
	|		ВремяЗавершения,
	|		Клиент,
	|		СоставРабот,
	|		Удаленка,
	|		Сверхурочка)
	|ИЗ
	|	Документ.ДневнойОтчетПочасовыхРабот КАК ДневнойОтчетПочасовыхРабот
	|ГДЕ
	|	ДневнойОтчетПочасовыхРабот.Ссылка В (&Ссылка)
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанныеШапка = Макет.ПолучитьОбласть("РаботыШапка");
	ОбластьДанные = Макет.ПолучитьОбласть("Работы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьДанныеШапка);
		ВыборкаДанные = Выборка.Данные.Выбрать();
		Пока ВыборкаДанные.Следующий() Цикл
			ОбластьДанные.Параметры.Заполнить(ВыборкаДанные);
			ОбластьДанные.Параметры.ОбъемРабот = ПолучитьОбъемРаботы(ОбластьДанные.Параметры.ВремяПрибытия,
																	 ОбластьДанные.Параметры.ВремяЗавершения,
																	 ОбластьДанные.Параметры.Удаленка);
			ТабДок.Вывести(ОбластьДанные, ВыборкаДанные.Уровень());
			Если ОбластьДанные.Параметры.Сверхурочка Тогда
				ТабДок.Область("СверхурочкаЯчейка").ЦветФона = WebЦвета.СветлоСерый;
			КонецЕсли;															
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
