

#Область ПрограммныйИнтерфейс

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// см. ОбщийМодуль.УправлениеДоступомПереопределяемый.ЗаполнитьПоставляемыеПрофилиГруппДоступа()
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ИндексПрофилей = ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	//++ Локализация
	
	#Область Дополнить_профиль_СупервайзерТорговыхПредставителей
	ОписаниеПрофиля = НайтиПрофиль("СупервайзерТорговыхПредставителей", ОписанияПрофилей, ИндексПрофилей);
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// Документы, чтение.
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурКомиссионеру(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученныхНалоговогоАгента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеТаможенныхДекларацийИмпорта(ОписаниеПрофиля);
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	#КонецОбласти
		
	// ИнтеграцияМОТП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	
	#Область Дополнить_профиль_ТорговыйПредставитель
	ОписаниеПрофиля = НайтиПрофиль("ТорговыйПредставитель", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	#КонецОбласти
	
	#Область Дополнить_профиль_Маркетолог
	ОписаниеПрофиля = НайтиПрофиль("Маркетолог", ОписанияПрофилей, ИндексПрофилей);	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеТоваровКОформлениюТаможенныхДеклараций(ОписаниеПрофиля);
	#КонецОбласти
	
	#Область Дополнить_профиль_РуководительОтделаПродаж
	ОписаниеПрофиля = НайтиПрофиль("РуководительОтделаПродаж", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМКоррекции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурПолученных(ОписаниеПрофиля);
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииПродукцииВЕТИС");
		
	// ИнтеграцияМОТП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	
	// Дополнительные права
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	#КонецОбласти
	
	#Область Дополнить_профиль_МенеджерПоПродажам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоПродажам", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
		
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	
	// ИнтеграцияГИСМ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПоступленииМаркированныхТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМ");
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииПродукцииВЕТИС");
	
	// ИнтеграцияМОТП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляЯндексКассы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурКомиссионеру(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурПолученных(ОписаниеПрофиля);
	#КонецОбласти

	#Область Описание_профиля_ПродавецКассирККМ
	// Профиль "Продавец-кассир ККМ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПродавецКассирККМ";
	ОписаниеПрофиля.Идентификатор = "b93bb8a1-04fa-4c1a-ac3c-75fb05366782";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Продавец-кассир ККМ'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");

	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМКоррекции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийВозвратовПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ОтчетыКассираККМ");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ");
	
	// ИнтеграцияМОТП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит работа с ККМ в течение дня и закрытие
	                                      |кассовой смены.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

	#Область Описание_профиля_МенеджерПоРозничнойТорговле
	// Профиль "Менеджер по розничной торговле".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоРозничнойТорговле";
	ОписаниеПрофиля.Идентификатор = "4c72e308-ff96-40b3-b066-f2dfda73d323";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по розничной торговле'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековККМКоррекции");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПродажиИВозвраты");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхПродажах");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМенеджераПоРозничнойТорговле");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученныхНалоговогоАгента(ОписаниеПрофиля);
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	// Значения доступа.
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется регистрация продаж через ККМ,
	                                      |печатаются ценники и этикетки, формируется отчетность розничной торговли.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

	#Область Дополнить_профиль_Кассир
	ОписаниеПрофиля = НайтиПрофиль("Кассир", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Справочники, чтение.
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");//

	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ОтчетыКассира");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученныхНалоговогоАгента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеТаможенныхДекларацийИмпорта(ОписаниеПрофиля);

	#КонецОбласти

	#Область Дополнить_профиль_Бухгалтер
	ОписаниеПрофиля = НайтиПрофиль("Бухгалтер", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ДобавитьРолиБухгалтераРеглУчета(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийИзЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегламентныхОпераций");
	
	
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");

	#КонецОбласти

	#Область Дополнить_профиль_Казначей
	ОписаниеПрофиля = НайтиПрофиль("Казначей", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Нормативно-справочная информация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
	// Документы чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	
	// Добавление документы.
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОперацийПоЯндексКассе");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	//ЦеныСкидкиНаценки
	 ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры"); 
		
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурНалоговогоАгента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеТаможенныхДекларацийИмпорта(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеДокументовПоУчетуНДС(ОписаниеПрофиля);
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоОбеспечениюПотребностей
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоОбеспечениюПотребностей", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Нормативно-справочная информация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	
	// ИнтеграцияГИСМ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЗакупкиГИСМ");
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриИнвентаризацииПродукцииВЕТИС");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	#КонецОбласти

	#Область Дополнить_профиль_ФинансовыйАналитик
	ОписаниеПрофиля = НайтиПрофиль("ФинансовыйАналитик", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Прикладные роли
	
	// Документы, чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданныхНаАванс(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурКомиссионеру(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурКомитента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурНалоговогоАгента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурНаНеподтвержденнуюРеализацию0(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученныхНаАванс(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученныхНалоговогоАгента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеДокументовПоУчетуНДС(ОписаниеПрофиля);
	#КонецОбласти

	#Область Дополнить_профиль_Кладовщик
	ОписаниеПрофиля = НайтиПрофиль("Кладовщик", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");

	// Документы, чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	
	// ИнтеграцияГИСМ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЗакупкиГИСМ");
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученныхНалоговогоАгента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеТаможенныхДекларацийИмпорта(ОписаниеПрофиля);
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоЗакупкам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоЗакупкам", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	
	// ИнтеграцияГИСМ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЗакупкиГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПоступленииМаркированныхТоваровГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМ");
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииПродукцииВЕТИС");
	
	// ИнтеграцияМОТП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурКомитента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеЗаявленийОВвозеТоваров(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеТаможенныхДекларацийИмпорта(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурКомиссионеру(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеТоваровКОформлениюТаможенныхДеклараций(ОписаниеПрофиля);
	#КонецОбласти

	#Область Дополнить_профиль_УчастникСогласованияУсловийЗакупок
	ОписаниеПрофиля = НайтиПрофиль("УчастникСогласованияУсловийЗакупок", ОписанияПрофилей, ИндексПрофилей);
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	#КонецОбласти

	#Область Дополнить_профиль_Клиент
	ОписаниеПрофиля = НайтиПрофиль("Клиент", ОписанияПрофилей, ИндексПрофилей);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеПартнеров
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеПартнеров", ОписанияПрофилей, ИндексПрофилей);
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеФизлиц
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеФизлиц", ОписанияПрофилей, ИндексПрофилей);

	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеНоменклатуры
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеНоменклатуры", ОписанияПрофилей, ИндексПрофилей);
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	#КонецОбласти		

	#Область Дополнить_профиль_РаботникСклада
	ОписаниеПрофиля = НайтиПрофиль("РаботникСклада", ОписанияПрофилей, ИндексПрофилей);
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоДоставке
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоДоставке", ОписанияПрофилей, ИндексПрофилей);	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	#КонецОбласти

	#Область Дополнить_профиль_ИнициаторЗаявокНаРасходованиеДенежныхСредств
	ОписаниеПрофиля = НайтиПрофиль("ИнициаторЗаявокНаРасходованиеДенежныхСредств", ОписанияПрофилей, ИндексПрофилей);
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	#КонецОбласти

	#Область Создать_профиль_ОтветственныйЗаОбменЭД
	// Профиль "Ответственный за обмен электронными документами (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаОбменЭД";
	ОписаниеПрофиля.Идентификатор = "1c7bc32a-60eb-4395-ab8d-87fd6103a095";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за обмен электронными документами (дополнительный)'");

	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, назначается пользователям, осуществляющим настройку
	                                      |соглашений по обмену электронными документами'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	#КонецОбласти
	
	#Область Создать_профиль_ВетеринарныйВрач

	// Профиль "Ветеринарный врач".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ВетеринарныйВрач";
	ОписаниеПрофиля.Идентификатор = "2434ce08-e835-48a1-a1c9-d02e5ce8adba";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ветеринарный врач'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Справочники, добавление, изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	
	// Документы, добавление, изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриИнвентаризацииПродукцииВЕТИС");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	// ЛокализацияУчета
	УчетНДСУП.ДобавитьЧтениеСчетовФактурВыданных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученных(ОписаниеПрофиля);
	УчетНДСУП.ДобавитьЧтениеСчетовФактурПолученныхНалоговогоАгента(ОписаниеПрофиля);
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит оформление ветеринарной сопроводительной документации,
	                                      |оформление транспортных, производственных и складских операций с продукцией,
	                                      |автоматическое взаимодействие с системой ""Меркурий"".'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти
		
	//-- Локализация
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// см. ОбщийМодуль.УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных()
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	//++ Локализация
	|Документ.БлокировкаВычетаНДС.Чтение.Организации
	|Документ.БлокировкаВычетаНДС.Изменение.Организации
	|Документ.ЗаписьКнигиПокупок.Чтение.Организации
	|Документ.ЗаписьКнигиПокупок.Изменение.Организации
	|Документ.ЗаписьКнигиПродаж.Чтение.Организации
	|Документ.ЗаписьКнигиПродаж.Изменение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Изменение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Чтение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Изменение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Чтение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Изменение.Организации
	|Документ.РаспределениеНДС.Чтение.Организации
	|Документ.РаспределениеНДС.Изменение.Организации
	|Документ.СписаниеНДСНаРасходы.Чтение.Организации
	|Документ.СписаниеНДСНаРасходы.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураВыданныйАванс.Чтение.Организации
	|Документ.СчетФактураВыданныйАванс.Изменение.Организации
	|Документ.СчетФактураКомиссионеру.Чтение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Чтение.Организации
	|Документ.СчетФактураКомиссионеру.Изменение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Изменение.Организации
	|Документ.СчетФактураКомитента.Чтение.Организации
	|Документ.СчетФактураКомитента.Изменение.Организации
	|Документ.СчетФактураНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураНалоговыйАгент.Изменение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Чтение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученныйАванс.Чтение.Организации
	|Документ.СчетФактураПолученныйАванс.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Подразделения
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Подразделения
	|ЖурналДокументов.КорректировкиНДС.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Изменение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Изменение.Организации
	|РегистрНакопления.НДСПредъявленный.Чтение.Организации
	|РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Изменение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|РегистрСведений.СостоянияБлокировкиВычетаНДСПоСчетамФактурам.Чтение.Организации
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.ГруппыПартнеров
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.Организации
	|РегистрСведений.СчетаФактурыКомитентовКРегистрации.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Чтение.ГруппыПартнеров
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Изменение.ГруппыПартнеров
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.СчетФактураВыданныйАвансПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйАвансПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйАвансПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйАвансПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Подразделения
	//-- Локализация
	|";
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// см. УправлениеДоступомУТ.ЗаполнитьИспользованиеВидаДоступа()
//
Процедура ЗаполнитьИспользованиеВидаДоступа(ВидДоступа, Использование) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// см. УправлениеДоступомПереопределяемый.ЗаполнитьВидыДоступа()
//
Процедура ЗаполнитьВидыДоступа(ВидыДоступа) Экспорт
	
	//++ Локализация
	
	
	//-- Локализация
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// см. ОбщийМодуль.УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа()
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	// Конец ЭлектронноеВзаимодействие
	
	
	УчетНДСУП.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	Списки.Вставить(Метаданные.Документы.АктПостановкиНаБалансЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.АктСписанияЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВнесениеДенежныхСредствВКассуККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратИзРегистра2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВыемкаДенежныхСредствИзКассыККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВыпускКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.КассоваяСмена, Истина);
	Списки.Вставить(Метаданные.Документы.ЛистКассовойКниги, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияПоЯндексКассе, Истина);
	Списки.Вставить(Метаданные.Документы.ОстаткиЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаВРегистр2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ТранспортнаяНакладная, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНВходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНИсходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИСВозврат, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекККМВозврат, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекККМКоррекции, Истина);
	
	Списки.Вставить(Метаданные.ЖурналыДокументов.РегламентныеДокументы, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ЧекиККМ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТМЦВЭксплуатации, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОформлениюТаможенныхДеклараций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПримененияЕНВД, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РегистрацииВНалоговомОргане, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФИОФизическихЛиц, Истина);
	
	Списки.Вставить(Метаданные.Справочники.КассовыеКниги, Истина);
	Списки.Вставить(Метаданные.Справочники.КлассификаторОрганизацийЕГАИС, Истина);
	Списки.Вставить(Метаданные.Справочники.ЛицензииПоставщиковАлкогольнойПродукции, Истина);
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИндексироватьПрофили(ОписанияПрофилей, ПолеПрофиля = "Имя")
	
	Результат = Новый Соответствие;
	Для Индекс = 0 По ОписанияПрофилей.ВГраница() Цикл
		
		Профиль = ОписанияПрофилей[Индекс];
		Результат.Вставить(Профиль[ПолеПрофиля], Индекс);
		
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция НайтиПрофиль(ИмяПрофиля, ОписанияПрофилей, ИндексПрофилей)

	ИндексПрофиля = ИндексПрофилей[ИмяПрофиля];
	Если ИндексПрофиля = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не обнаружен дополняемый профиль доступа'")+" ""%1""";
		ВызватьИсключение СтрШаблон(ТекстСообщения, ИмяПрофиля);
	КонецЕсли;
	Возврат ОписанияПрофилей[ИндексПрофиля];
	
КонецФункции

//++ Локализация
// Служебная функция. Сделана экспортной для удобства внедрения.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваМОТП");
	
	// Новости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.
//
Процедура ДобавитьРолиБухгалтераРеглУчета(ОписаниеПрофиля) Экспорт
	
	// Справочники, чтение. 
	// Чтение физических лиц
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// Документы
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоЯндексКассе");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовСЯндексКассой");
	
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиБухгалтера");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиОперацииЗакрытияМесяца");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированияПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегламентныхОпераций");
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчета");
	
	// Регистры сведений, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПримененияЕНВД");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	
	// ИнтеграцияГИСМ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЗакупкиГИСМ");
	
	// ИнтеграцияЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияМеждуРегистрамиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияПоСправке2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИнформацияОбОрганизацииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсторияСправок2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНеобработанныеТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОбработанныеЧекиЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСводныйОтчетЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриИнвентаризацииПродукцииВЕТИС");
	
	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРегламентированныйУчет");
	
	
	УчетНДСУП.ДобавитьПолныйДоступКУчетуНДС(ОписаниеПрофиля);
	
КонецПроцедуры

//Процедура ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля, ДоступнаРольЧтенияФизическихЛицУТ, ДоступныРолиФизическихЛицБЗКР)
Процедура ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// ИнтеграцияВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	
	
КонецПроцедуры


//-- Локализация
#КонецОбласти
