
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контрагент") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Параметры.Контрагент);
		Список.Параметры.УстановитьЗначениеПараметра("КонтрагентУказан",ЗначениеЗаполнено(Параметры.Контрагент));
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент",ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		Список.Параметры.УстановитьЗначениеПараметра("КонтрагентУказан",Ложь);
	КонецЕсли;
КонецПроцедуры
