
&НаСервере
Процедура ЗаполнитьНаСервере(перем_ТабЗнач, Месяц)
	Месяц = КонецДня(Месяц);
	перем_ТабЗнач.Очистить();
	
	ЗапросДоговоров = Новый Запрос;
	ЗапросДоговоров.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТКонтрагенты
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Клиенты.Контрагент = Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговораОбслуживанияСрезПоследних.Контрагент КАК Контрагент,
		|	МАКСИМУМ(ДоговораОбслуживанияСрезПоследних.Период) КАК Дата
		|ПОМЕСТИТЬ ВТДаты
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(&Дата, ) КАК ДоговораОбслуживанияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговораОбслуживанияСрезПоследних.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ДоговораОбслуживания.АбонентскаяПлата, ЛОЖЬ) КАК АбонентскаяПлата,
		|	ЕСТЬNULL(ДоговораОбслуживания.Тариф, 0) КАК Тариф,
		|	ЕСТЬNULL(ДоговораОбслуживания.Период, ""Без договора"") КАК Дата,
		|	ЕСТЬNULL(ДоговораОбслуживания.ТарифСверхурочный, ""Без договора"") КАК ТарифСверхурочный,
		|	ВТКонтрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	ВТКонтрагенты КАК ВТКонтрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговораОбслуживания КАК ДоговораОбслуживания
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДаты КАК ВТДаты
		|			ПО ДоговораОбслуживания.Период = ВТДаты.Дата
		|		ПО ДоговораОбслуживания.Контрагент = ВТКонтрагенты.Ссылка";
	
	ЗапросДоговоров.УстановитьПараметр("Дата", Месяц);
	
	РезультатЗапросаДоговоров = ЗапросДоговоров.Выполнить();
	
	ВыборкаДоговоров = РезультатЗапросаДоговоров.Выбрать();
	
	Пока ВыборкаДоговоров.Следующий() Цикл
		Стр = перем_ТабЗнач.Добавить();                 
		Стр.ДатаДоговора = Формат(ВыборкаДоговоров.Дата, "ДФ=""дд.ММ.гггг");
		Стр.Контрагент = ВыборкаДоговоров.Контрагент;
		Стр.ТекущийТариф = ВыборкаДоговоров.Тариф;
		Стр.ТекущийТарифСверхурочный = ВыборкаДоговоров.ТарифСверхурочный;
		Стр.Абонент = ВыборкаДоговоров.АбонентскаяПлата;
	КонецЦикла;
	
	КопироватьДанныеФормы(перем_ТабЗнач, ТабЗнач);
	Сообщить("Заполнение завершено!");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	перем_ТабЗнач = ТабЗнач;
	ЗаполнитьНаСервере(перем_ТабЗнач, МесяцСтарыхДоговоров);
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере(ТабЗнач, Месяц, Действие)
	Месяц = НачалоДня(Месяц);
		
	Для Каждого ТекСтрока Из ТабЗнач Цикл		
		Если ТекСтрока.НовыйТариф = 0 Тогда	
			Если Действие = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Договор = Документы.ДоговорОбслуживания.СоздатьДокумент();
		Договор.Дата = Месяц;
		Договор.Контрагент = ТекСтрока.Контрагент;
		Договор.АбонентскаяПлата = ТекСтрока.Абонент;
		Договор.Тариф = ТекСтрока.НовыйТариф;
		Договор.ТарифСверхурочный = ТекСтрока.НовыйТарифСверхурочный;
		
		Попытка
			Договор.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
	КонецЦикла;
	Сообщить("Договоры созданы!");
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	Действие = 2;
	Для Каждого ТекСтрока Из ТабЗнач Цикл		
		Если ТекСтрока.НовыйТариф = 0 Тогда	
			ВызванаФорма = Истина;
			Действие = ОткрытьФормуМодально("Обработка.ОбновлениеДоговоров.Форма.Ошибка");
			Если Действие = 1 Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	перем_ТабЗнач = ТабЗнач;
	СоздатьНаСервере(перем_ТабЗнач, МесяцНовыхДоговоров, Действие);
КонецПроцедуры

&НаКлиенте
Процедура МесяцНовыхДоговоровНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МесяцНовыхДоговоров = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2");
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтарыхДоговоровНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МесяцСтарыхДоговоров = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2");
КонецПроцедуры

&НаСервере
Процедура КопироватьДоговораНаСервере(перем_ТабЗнач)
	Для Каждого ТекСтрока Из перем_ТабЗнач Цикл		
		ТекСтрока.НовыйТариф = ТекСтрока.ТекущийТариф;
		ТекСтрока.НовыйТарифСверхурочный = ТекСтрока.ТекущийТарифСверхурочный;
	КонецЦикла;
	
	КопироватьДанныеФормы(перем_ТабЗнач, ТабЗнач);
	Сообщить("Договоры скопированы!");
КонецПроцедуры

&НаКлиенте
Процедура КопироватьДоговора(Команда)
	перем_ТабЗнач = ТабЗнач;
	КопироватьДоговораНаСервере(перем_ТабЗнач);
КонецПроцедуры
