
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ТалонНаРемонт)
	ТабДок = Новый ТабличныйДокумент;
	ТалонНаРемонт(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ТалонНаРемонт(ТабДок, ПараметрКоманды)
	Документы.ЗаявкаНаРемонт.ТалонНаРемонт(ТабДок, ПараметрКоманды);
КонецПроцедуры
