
&НаСервере
Процедура НАЧАТЬНаСервере()
	Сообщить("Запись начата");
	
	ПробежатьсяПоКонтрагентам();
		
	ВыборкаДокументы = Документы.ДневнойОтчетПочасовыхРабот.Выбрать();	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокОбъект = ВыборкаДокументы.ПолучитьОбъект();
		Для Каждого Стр Из ДокОбъект.Данные Цикл 
			Если Не ЕстьЛиКлиент(Стр.Организация) Тогда
				ЗаписатьКлиента(Стр.Организация);
			КонецЕсли;
			Стр.Клиент = НайтиКлиента(Стр.Организация);
		КонецЦикла;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
	
	Сообщить("Запись Закончена");
КонецПроцедуры

&НаКлиенте
Процедура НАЧАТЬ(Команда)
	НАЧАТЬНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКлиента(Контрагент)
	Клиент = Справочники.Клиенты.СоздатьЭлемент();
	
	Клиент.Наименование = Контрагент.Наименование;
	Клиент.ИНН = Контрагент.ИНН;
	Клиент.ПолноеНаименование = Контрагент.НаименованиеПолное;
	Клиент.Контрагент = Контрагент.Ссылка;
	
	Попытка
		Клиент.Записать();
		Сообщить("Новый клиент создан");
	Исключение
		Сообщить("Произошла ошибка при создании клиента");
	КонецПопытки;	
КонецПроцедуры

&НаСервере
Функция ЕстьЛиКлиент(Клиент)
	ЗапросКлиентов = Новый Запрос;
	ЗапросКлиентов.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Контрагент КАК Контрагент
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Контрагент = &Контрагент";
	
	ЗапросКлиентов.УстановитьПараметр("Контрагент", Клиент);		
	РезультатЗапросаКлиентов = ЗапросКлиентов.Выполнить();		
	ВыборкаКлиентов = РезультатЗапросаКлиентов.Выбрать();
	ВыборкаКлиентов.Следующий();
	
	Если ВыборкаКлиентов.Количество() = 0 Тогда         
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции
	
&НаСервере
Функция НайтиКлиента(Контрагент)
	ЗапросКлиентов = Новый Запрос;
	ЗапросКлиентов.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Контрагент = &Контрагент";
		
	ЗапросКлиентов.УстановитьПараметр("Контрагент", Контрагент.Ссылка);		
	РезультатЗапросаКлиентов = ЗапросКлиентов.Выполнить();		
	ВыборкаКлиентов = РезультатЗапросаКлиентов.Выбрать();
	ВыборкаКлиентов.Следующий();
	Возврат ВыборкаКлиентов.Ссылка;
КонецФункции

&НаСервере
Процедура ПробежатьсяПоКонтрагентам()
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЕстьЛиКлиент(ВыборкаДетальныеЗаписи.Ссылка) Тогда
			ЗаписатьКлиента(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры