
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ЧерныйСписокПриИзменении(Элемент)
	Если Объект.ЧерныйСписок И (Не ЗначениеЗаполнено(Объект.СрокДействия) ИЛИ Объект.СрокДействия > НачалоДня(ТекущаяДата())) Тогда
		Объект.СрокДействия = НачалоДня(ТекущаяДата() + 3600 * 24); 
	КонецЕсли;
	//УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	Если Объект.Проведен Тогда
		Элементы.АктуальныйДоговорНадпись.Видимость = Ложь;
		АктуальныйДоговорНадпись = "Перейти к актуальному";
		
		Если Объект.ЧерныйСписок Тогда
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.ЧерныйСписок");
		ИначеЕсли Не ЕстьНовыйДоговор() И (Объект.СрокДействия > НачалоДня(ТекущаяДата()) Или Не ЗначениеЗаполнено(Объект.СрокДействия)) Тогда
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.Действующий");
		Иначе
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.Недействующий");
		КонецЕсли;
		
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.Действующий") Тогда
			Элементы.Статус.ЦветТекста = WebЦвета.Черный;
		Иначе
			Элементы.Статус.ЦветТекста = WebЦвета.Красный;
			ПоследнийДоговор = ПоследнийДоговор(Объект.Контрагент);
			Если ПоследнийДоговор <> Неопределено И ПоследнийДоговор <> Объект.Ссылка Тогда
				Элементы.АктуальныйДоговорНадпись.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	//УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Функция ЕстьНовыйДоговор()
	Возврат АутсорсРаботы.ЕстьНовыйДоговор(Объект.Контрагент, Объект.Дата);
КонецФункции

&НаСервереБезКонтекста
Функция ПоследнийДоговор(Контрагент)
	Договор = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговораОбслуживанияСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(, Контрагент = &Контрагент) КАК ДоговораОбслуживанияСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Договор = ВыборкаДетальныеЗаписи.Регистратор;
	КонецЕсли;
	Возврат Договор;
КонецФункции

&НаКлиенте
Процедура АктуальныйДоговорНадписьНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	АктуальныйДоговор = ПоследнийДоговор(Объект.Контрагент);
	Если ЗначениеЗаполнено(АктуальныйДоговор) Тогда
		ОткрытьЗначение(АктуальныйДоговор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	//УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УправлениеВидимостью();
КонецПроцедуры
