
&НаКлиенте
Процедура МесяцНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2"); 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформирватьНаСервере(Работник, Месяц, Диаграмма)
	ЗапросНорм = Новый Запрос;
	ЗапросНорм.Текст = 
		"ВЫБРАТЬ
		|	НормаРабот.СуточнаяНорма КАК СуточнаяНорма,
		|	НормаРабот.Работник КАК Работник,
		|	ПРЕДСТАВЛЕНИЕ(НормаРабот.Работник) КАК РаботникПредставление,
		|	НормаРабот.МесячнаяНорма КАК МесячнаяНорма
		|ИЗ
		|	РегистрСведений.НормаРабот КАК НормаРабот
		|ГДЕ
		|	НормаРабот.Работник = &Работник
		|	И НормаРабот.Регистратор.Дата <= &Дата";
	
	ЗапросНорм.УстановитьПараметр("Работник", Работник);	
	ЗапросНорм.УстановитьПараметр("Дата", КонецДня(Месяц));
	РезультатЗапросаНорм = ЗапросНорм.Выполнить();	
	ВыборкаНорм = РезультатЗапросаНорм.Выбрать();
	ВыборкаНорм.Следующий();
	
	ЗапросРабот = Новый Запрос;
	ЗапросРабот.Текст = 
		"ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ПочасовыеРаботы.Регистратор.Дата, ДЕНЬ) КАК Дата,
		|	ПочасовыеРаботы.Исполнитель КАК Исполнитель,
		|	ПРЕДСТАВЛЕНИЕ(ПочасовыеРаботы.Исполнитель) КАК ИсполнительПредставление,
		|	ПочасовыеРаботы.ВремяЗатраты КАК ВремяЗатраты,
		|	ПочасовыеРаботы.Сверхурочка КАК Сверхурочка
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Регистратор.Дата МЕЖДУ &От И &До
		|	И ПочасовыеРаботы.Исполнитель = &Исполнитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	СУММА(ВремяЗатраты)
		|ПО
		|	Исполнитель,
		|	Дата,
		|	Сверхурочка";
	
	От = КонецДня(Месяц);
	До = КонецМесяца(Месяц);
	
	ЗапросРабот.УстановитьПараметр("До", КонецМесяца(Месяц));
	ЗапросРабот.УстановитьПараметр("От", Месяц);
	ЗапросРабот.УстановитьПараметр("Исполнитель", Работник);
	
	РезультатЗапросаРабот = ЗапросРабот.Выполнить();
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.АвтоТранспонирование = Ложь;
	
	ВыборкаИсполнитель = РезультатЗапросаРабот.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИсполнитель.Следующий();
	
	Дата = От;
			
	Серия = Диаграмма.УстановитьСерию("Обычные работы");
	Серия.Текст = "Обычные работы";
	Серия.Расшифровка = ВыборкаИсполнитель.Исполнитель;
	
	СерияСверхурочка = Диаграмма.УстановитьСерию("Сверхурочные работы");
	СерияСверхурочка.Текст = "Сверхурочные работы";
	СерияСверхурочка.Расшифровка = ВыборкаИсполнитель.Исполнитель;
	
	СерияИндикатор =  Диаграмма.УстановитьСерию("СуточнаяНорма");
	СерияИндикатор.Индикатор = Истина;
	СерияИндикатор.Линия = Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	СерияИндикатор.Маркер = ТипМаркераДиаграммы.Нет;
	
	ВыборкаДата = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДата.Следующий();
	
	СуммаВремязатрат = 0;
	
	Пока Дата <= До Цикл			
		Если Не Дата = ВыборкаДата.Дата Тогда
			Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
			Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
			Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
			Диаграмма.УстановитьЗначение(Точка, Серия, 0);
		ИначеЕсли Дата = ВыборкаДата.Дата Тогда
			ВыборкаСверхурочка = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСверхурочка.Следующий() Цикл
				Если ВыборкаСверхурочка.Сверхурочка Тогда
					Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
					Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Диаграмма.УстановитьЗначение(Точка, СерияСверхурочка, ВыборкаСверхурочка.ВремяЗатраты);
				Иначе
					Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
					Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Диаграмма.УстановитьЗначение(Точка, Серия, ВыборкаСверхурочка.ВремяЗатраты);
					СуммаВремязатрат = СуммаВремязатрат + ВыборкаСверхурочка.ВремяЗатраты;
				КонецЕсли;
			КонецЦикла;
			ВыборкаДата.Следующий();
		КонецЕсли;
		Диаграмма.УстановитьЗначение(Точка, СерияИндикатор, ВыборкаНорм.СуточнаяНорма);
		Дата = Дата + 86400;
	КонецЦикла;
	
	СерияМесячняНорма =  Диаграмма.УстановитьСерию("Месячная норма: " + Строка(СуммаВремязатрат) + "/" + Строка(ВыборкаНорм.МесячнаяНорма));
	СерияМесячняНорма.ОтображатьГрафическоеПредставлениеДанныхВДиаграмме = ОтображениеВДиаграмме.НеОтображать;
	СерияМесячняНорма.ОтображатьГрафическоеПредставлениеДанныхВЛегендеДиаграммы  = ОтображениеВЛегендеДиаграммы.Отображать;
	
	Диаграмма.АвтоТранспонирование = Истина;
	Диаграмма.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформирвать(Команда)
	СформирватьНаСервере(ЭтаФорма.Работник, ЭтаФорма.Месяц, ЭтаФорма.График);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
	Работник = ПолучитьИсполнителя();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсполнителя(Пользователь=Неопределено)
	Если Пользователь = Неопределено Тогда
		Возврат ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо;
	Иначе
		Возврат ПользователиКлиентСервер.Пользователь.ФизическоеЛицо;
	КонецЕсли;
КонецФункции