
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("СоздаваемыеОбъекты") Тогда
		Возврат
	Иначе
        СтруктураСоздания = Параметры.СоздаваемыеОбъекты;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СтруктураСоздания.Свойство("ЗНККТ") Тогда
		ЗНККТ = СтруктураСоздания.ЗНККТ;
		Если (СтрНайти(СтруктураСоздания.МодельККТ," ") <> 0) Тогда
			МодельККТ = Сред(СтруктураСоздания.МодельККТ,СтрНайти(СтруктураСоздания.МодельККТ," ") + 1)
		КонецЕсли;
	Иначе
		Элементы.ГруппаККТ.Видимость = Ложь;
	КонецЕсли;
	Если СтруктураСоздания.Свойство("ЗНФН") Тогда
		ЗНФН = СтруктураСоздания.ЗНФН;
	Иначе
		Элементы.ГруппаФН.Видимость = Ложь;
	КонецЕсли;
	Если СтруктураСоздания.Свойство("ИННКлиента") Тогда
		ИННКлиента = СтруктураСоздания.ИННКлиента;
		ИмяКлиента = СтруктураСоздания.ИмяКлиента;
	Иначе
		Элементы.ГруппаКлиент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьККТ(Команда)
	Если НЕ ЗначениеЗаполнено(ПолучитьККТПоЗН(ЗНККТ)) Тогда
		ККТ = СоздатьККТНаСервере(ЗНККТ,МодельККТ);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьККТПоЗН(ЗН)
	Возврат Справочники.КонтрольноКассоваяТехника.НайтиПоКоду(ЗН);
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьККТНаСервере(ЗН,Модель)
	МодельККТ = Справочники.МоделиККТ.НайтиПоНаименованию(Модель);
	
	ККТ = Справочники.КонтрольноКассоваяТехника.СоздатьЭлемент();
	ККТ.Код = ЗН;
	ККТ.Наименование = ЗН;
	ККТ.Модель = МодельККТ;
	ККТ.Записать();
	
	Возврат ККТ.Ссылка;
КонецФункции

&НаКлиенте
Процедура СоздатьФН(Команда)
	Если НЕ ЗначениеЗаполнено(ПолучитьФНПоЗН(ЗНФН)) Тогда
		ФН = СоздатьФННаСервере(ЗНФН);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФНПоЗН(ЗН)
	Возврат Справочники.ФискальныеНакопители.НайтиПоКоду(ЗН);
КонецФункции


&НаСервере
Функция СоздатьФННаСервере(ЗН)
	//МодельККТ = Справочники.МоделиККТ.НайтиПоНаименованию(Модель);
	//МодельФН = Справочники.ФискальныеНакопители.ПустаяСсылка();
	МодельФН = МодельФНПоЗН(ЗН);
	
	НовыйФН = Справочники.ФискальныеНакопители.СоздатьЭлемент();
	НовыйФН.Код = ЗН;
	НовыйФН.Наименование = ЗН;
	НовыйФН.Модель = МодельФН;
	НовыйФН.Записать();
	
	Если Не ЗначениеЗаполнено(НовыйФН.Модель) Тогда
		Сообщить("Не удалось определить модель ФН");
	КонецЕсли;
	
	Возврат НовыйФН.Ссылка;
КонецФункции

&НаСервере
Функция МодельФНПоЗН(ЗН)
	Модель = Справочники.ФискальныеНакопители.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МоделиФискальныхНакопителей.Ссылка КАК Ссылка,
		|	МоделиФискальныхНакопителей.ШаблонЗаводскогоНомера КАК ШаблонЗаводскогоНомера
		|ИЗ
		|	Справочник.МоделиФискальныхНакопителей КАК МоделиФискальныхНакопителей";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТаблицаШаблоновЗН.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ШаблонЗаводскогоНомера) Тогда
			СтрокаШаблона = ТаблицаШаблоновЗН.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШаблона,ВыборкаДетальныеЗаписи);
		КонецЕсли; 
	КонецЦикла;
	                     
	ТаблицаШаблоновЗН.Сортировать("ШаблонЗаводскогоНомера");						 
						 
	Для Каждого СтрокаШаблона Из ТаблицаШаблоновЗН Цикл
		Префикс = Лев(СтрокаШаблона.ШаблонЗаводскогоНомера,СтрНайти(СтрокаШаблона.ШаблонЗаводскогоНомера,"X") - 1);
		Если Лев(ЗН,СтрДлина(Префикс)) = Префикс Тогда
			Модель = СтрокаШаблона.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Модель;
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Результат = Новый Структура;
	Если ЗначениеЗаполнено(ФН) Тогда 
		Результат.Вставить("ФН",ФН);
	КонецЕсли;
	Если ЗначениеЗаполнено(ККТ) Тогда
		Результат.Вставить("ККТ",ККТ);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Результат);
КонецПроцедуры
