
// Возвращает список контактных номеров телефона контактного лица в виде строки.
// 
// Параметры:
//  КонтактноеЛицо - СправочникСсылка.КонтактныеЛицаПартнеров - Контактное лицо
// 
// Возвращаемое значение:
//  Строка - Телефоны контактного лица строкой
Функция ТелефоныКонтактногоЛицаСтрокой(КонтактноеЛицо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И НЕ КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.ПометкаУдаления
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
	
	НомераТелефона = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерТелефона");
	
	Возврат СтрСоединить(НомераТелефона,", "); 
КонецФункции